{"title":"SIN_CITY","uid":7218306,"size":1365183103,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0208d80f33f7f712a3993235dbaec0079d2a5b90&amp;dn=SIN_CITY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"reppirg","files":3,"time":1335447573,"description":"Sin City (2005) More at IMDbPro Â»\n \nad feedback\nFour tales of crime adapted from Frank Miller's popular comics, focusing around a muscular brute who's looking for the person responsible for the death of his beloved Goldie, a man fed up with Sin City's corrupt law enforcement who takes the law into his own hands after a horrible mistake, a cop who risks his life to protect a girl from a deformed pedophile, and a hitman looking to make a little cash. Written by Tom Benton\n\nAn adaptation of Frank Miller's stories based in a morally bankrupt metropolis. Chief amongst the town's residents is Marv, who trawls the darkest areas of town looking for the person who murdered Goldie while she lay sleeping in his bed. Written by Anonymous\n\n&quot;Sin City&quot; is infested with criminals, crooked cops and sexy dames, some searching for vengeance, some for redemption and others, both. The film incorporates storylines from three of Miller's graphic novels including 'Sin City,' which launched the long-running, critically acclaimed series, as well as 'That Yellow Bastard' and 'The Big Fat Kill.' Where Hartigan, a cop with a bum ticker and a vow to protect stripper Nancy. Marv, the outcast misanthrope, is on a mission to avenge the death of his one true love, Goldie; there's also Dwight, the clandestine love of Shelley who spends his nights defending Gail and her Old Towne girls from Jackie Boy, a dirty cop with a penchant for violence","torrent":{"xt":"urn:btih:0208d80f33f7f712a3993235dbaec0079d2a5b90","amp;dn":"SIN_CITY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0208d80f33f7f712a3993235dbaec0079d2a5b90","infoHashBuffer":{"type":"Buffer","data":[2,8,216,15,51,247,247,18,163,153,50,53,219,174,192,7,157,42,91,144]},"announce":[],"urlList":[]}}