{"title":"Empires and Generals","uid":7307230,"size":564152373,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:0218cf6ff1bf4f882bc0ae381f023e13cd3c95b1&amp;dn=Empires+and+Generals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jc118899","files":-1,"time":1338234579,"description":"I found this cool free game at http://www.empiresandgenerals.com/#!mainPage I decided I would make a torrent for it...just to see how to make a torrent. This is from May 2012 as I bet there will be some changes since then. \n\nHere is the part where I rip the description off of the homepage\n\n------------------------------------------------------------------------------\n\n\nYou are the true power behind one of the largest empires in your time. The people hang on your every word. The army heeds your every whim. You control the Generals and the Empire in this epic tradable and collectible card game. Take control of the barbarian horde and conquer the existing world, or become the shining beacon of hope and civilization for the glory of the people.\n\nThe object of Empires and Generals is to become the greatest and most powerful Empire. You can do this by gaining Cultural Health or by causing others to lose theirs until the desired level is reached. In a normal game if you gain five Cultural Health or force your opponants to lose five Cultural Health, you will achieve victory.\n\n-----------------------------------------------------------------------------\n\nGame Preparation\n\nFirst off, print off the cards!\n\nEach card is formatted to fit onto a 3x5 index card, but you can stretch and fit each .jpg if you want to use &quot;Playing Card&quot; size or 5x7 index cards.\n\nYou will find that each deck has it's own unique playing styles, just like\neach real life empire. Chose one and start building yours.\n\nAnywhere from 2-20 Players can play but 2-6 is recommended.\n\nSeparate all Resource Cards from Playing Cards. The Resource Cards\nmake up The Supply Pile. Shuffle it and place to your left.\n\nShuffle the remaining Playing Cards and place next to the supply pile.\nThis is your Playing Deck. Have the player to the left of you cut each deck.\n\nYou will have an assortment  of Non-Playing Reference Cards that will help you\nduring game play. The most important one is the Cultural Health Card.\n\nThe Cultural Health Card is placed to your left with a card on top of it (often Attack Resolution or Game Phase Chart) to keep track of your points. Place the top or bottom edge of the card on the starting middle line to determine your beginning number at 0 (Zero) Cultural Health.\n\nMake sure there is ample room in front of you and to each side.\n\nKeeping snacks on the playing table is discouraged.\nKeep it fun. ","torrent":{"xt":"urn:btih:0218cf6ff1bf4f882bc0ae381f023e13cd3c95b1","amp;dn":"Empires+and+Generals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0218cf6ff1bf4f882bc0ae381f023e13cd3c95b1","infoHashBuffer":{"type":"Buffer","data":[2,24,207,111,241,191,79,136,43,192,174,56,31,2,62,19,205,60,149,177]},"announce":[],"urlList":[]}}