{"title":"Inu X Boku Secret Service - All Episodes","uid":7371661,"size":1130983745,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:02fc40a3c4ccc7e28e2f018df2a021686d1a0518&amp;dn=Inu+X+Boku+Secret+Service+-+All+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Friendly_Seeder","files":-1,"time":1340248936,"description":"First of all, if your not an otaku of Japanese culture or anime ;) then you should know that black is the color of innocence and white is the color of evil. So the term used pure black mean pure innocence or pure white or snow (in American culture anyway). So I suppose you want a review or something. Fine I'll write one :P\n\nA girl from a high name in japan keeps constantly telling people of because of child hood experiences, but thats all just an act and she hurting inside. So she decides to go live by herself and try to get over her problem, alone. BUT, that wont happen she runs into a man from the secret service or there own special secret who claims to know her and is the most loyal person you've ever seen. But this people are not exactly who the seem and they face bigger problems then robbers with guns. ;)\n\nThis file includes:\n\nInu x Boku Secret Service - EP001 - The Dog and Me (2012-01-13)\nInu x Boku Secret Service - EP002 - The Lonely Dog (2012-01-20)\nInu x Boku Secret Service - EP003 - The Real Contract (2012-01-27)\nInu x Boku Secret Service - EP004 - Ayakashi Kan Walk Rally (2012-02-03)\nInu x Boku Secret Service - EP005 - Kagerou in the Spring (2012-02-10)\nInu x Boku Secret Service - EP006 - Rather Than Thinking (2012-02-17)\nInu x Boku Secret Service - EP007 - The Couple`s Night (2012-02-24)\nInu x Boku Secret Service - EP008 - Tea and Distance (2012-03-02)\nInu x Boku Secret Service - EP009 - The Promised Day (2012-03-09)\nInu x Boku Secret Service - EP010 - The Traitor Fox (2012-03-16)\nInu x Boku Secret Service - EP011 - Haze (2012-03-23)\nInu x Boku Secret Service - EP012 - The Day Two Became One (2012-03-30)\nAnd again a nice picture for your use\n\nWell sorry it took so long I had downloading problems then had to make them smaller (pretty sure you didn't want about 5gb to download also the subtitles are removable but maybe I should have burnt the in) maybe I'll post that torrent if some one comments and ask for it -_- also If someone comments and requests it ill upload an new eroge that is hard to find not using file monster. Anyway COMMENT AND SEED!!! SERIOUSLY!!! It;s lonely talking to myself ;(","torrent":{"xt":"urn:btih:02fc40a3c4ccc7e28e2f018df2a021686d1a0518","amp;dn":"Inu+X+Boku+Secret+Service+-+All+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fc40a3c4ccc7e28e2f018df2a021686d1a0518","infoHashBuffer":{"type":"Buffer","data":[2,252,64,163,196,204,199,226,142,47,1,141,242,160,33,104,109,26,5,24]},"announce":[],"urlList":[]}}