{"title":"Mr Poppers Penguins  (2011) TS-ScreenerHQ DUAL Eng-Spa","uid":6559732,"size":1557899264,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:045e1d462e99502e6460609cace0f55e10c78ea7&amp;dn=Mr+Poppers+Penguins++%282011%29+TS-ScreenerHQ+DUAL+Eng-Spa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1311419520,"description":"Los PingÃƒÂ¼inos Del Sr Poper (2011) [TS-ScreenerHQ][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.lospinguinosdelsrpoper.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lospinguinosdelsrpoper.es/&lt;/a&gt;\n\nEnglish:\n--------\nQuality: TS HQ \nAudio: MIC Castilian / English \n\nTitle: Mr. Popper's Penguins \nOriginal title: Mr. Popper's Penguins \nCountry: USA \nUSA release: 17/06/2011 \nReleased in Spain: 22/07/2011 \nStudio: 20th Century Fox \nDirector: Mark Waters \nWriter: Sean Anders, John Morris \nStarring: Jim Carrey, Carla Gugino, Angela Lansbury, Madeline Carroll, Maxwell Perry Cotton, Ophelia Lovibond, Dominic Chianese, James Tupper, Philip Baker Hall, Kelli Barrett, Pepper Binkley, Matthew Wolf, Danielle McKee, Joshua Rush, Jeff Lima \nRating: Not recommended for children under 12 years \n\n\nSynopsis: \nWhile doing more in Brooklyn, New York, the young Tommy Poper just waiting the moment, as he stands on tiptoe standing to reach a radio amateur, can speak with his father, traveling the world, years later, Tommy and Mr. Popper's (Jim Carrey), a successful real estate developer in Manhattan. After going through an amicable divorce with Amanda (Carla Gugino), with two children (Madeline Carroll and Maxwell Perry Cotton) whom he meets every two weekends, Mr. Popper leads a life of luxury at the ultra modern apartment Park Avenue, while doing very well on your way to becoming a member of the prestigious firm he works for. That is, until one morning a large packaging appears at his door, one last gift from his late father, a memory of Antarctica. \n\nInside the wooden box, tucked between ice packs, a penguin is 60 cm tall, with bright orange legs and all. Not a toy penguin, not a stuffed bird for a taxidermist, as is Mr. Popper at first, but a real penguin, alive and kicking, it scampers across the floor while emitting strong Poper squawking. Eager to get rid of this wild creature, Popper makes contact with each and every imaginable city and state agencies, but none is willing to take on a pet penguin. Your call to the Antarctic to try to send the penguin back fails and ends up causing the arrival of five other penguins at the door of Popper. \n\nAs you begin to make friends, and more and more involved with peers winged apartment life quickly starts to freak out Poper: the flamboyant New York apartment becomes a winter wonderland, the contract that has long been working derailed and almost did not end up in jail. But thanks to his new duties, Poper begins to understand the importance of family, human and less human. \n\nProduction notes: \nAdaptation of the text child of Richard and Florence Atwater is first published in 1938.\n\n\n\n\nEspaÃƒÂ±ol:\n--------\nCalidad: TS HQ\nAudio: MIC Castellano / Ingles\n\nTÃƒÂ­tulo: Los pingÃƒÂ¼inos del Sr. Poper\nTÃƒÂ­tulo original: Mr. Popper's Penguins\nPaÃƒÂ­s: USA \nEstreno en USA: 17/06/2011 \nEstreno en EspaÃƒÂ±a: 22/07/2011 \nProductora: 20th Century Fox \nDirector: Mark Waters \nGuiÃƒÂ³n: Sean Anders, John Morris \nReparto: Jim Carrey, Carla Gugino, Angela Lansbury, Madeline Carroll, Maxwell Perry Cotton, Ophelia Lovibond, Dominic Chianese, James Tupper, Philip Baker Hall, Kelli Barrett, Pepper Binkley, Matthew Wolf, Danielle McKee, Joshua Rush, Jeff Lima \nCalificaciÃƒÂ³n: No recomendada para menores de 12 aÃƒÂ±os\n\n\nSinopsis:\nMientras se hace mayor en Brooklyn, Nueva York, el joven Tommy Poper sÃƒÂ³lo espera el momento en que, mientras se pone en puntillas de pie para alcanzar una radio de radioaficionados, pueda hablar con su padre, de viaje por el mundo, AÃƒÂ±os despuÃƒÂ©s, Tommy ya es el Sr. Poper (Jim Carrey), un promotor inmobiliario de ÃƒÂ©xito en Manhattan. DespuÃƒÂ©s de pasar por un divorcio amistoso con Amanda (Carla Gugino), y con dos hijos (Madeline Carroll y Maxwell Perry Cotton) a los que ve cada dos fines de semana, el Sr. Poper lleva una vida de lujo en su ultra moderno apartamento de Park Avenue, mientras va muy bien encaminado a convertirse en socio de la prestigiosa firma para la que trabaja. Es decir, hasta que una maÃƒÂ±ana aparece un gran embalaje en su puerta, un ÃƒÂºltimo regalo de su finado padre, un recuerdo de la AntÃƒÂ¡rtida. \n\nDentro de la caja de madera, arropado entre paquetes de hielo, se encuentra un pingÃƒÂ¼ino de 60 cm de alto, con sus brillantes patas de color naranja y todo. No es un pingÃƒÂ¼ino de juguete, ni un ave disecada por algÃƒÂºn taxidermista, como supone el Sr. Poper en un primer momento, sino un autÃƒÂ©ntico pingÃƒÂ¼ino, vivito y coleando, que corretea por el piso de Poper mientras emite fuertes graznidos. Ansioso por librarse de esta criatura salvaje, Poper se pone en contacto con todas y cada una de las agencias municipales y estatales imaginables, pero ninguna de ellas estÃƒÂ¡ dispuesta a hacerse cargo de un pingÃƒÂ¼ino mascota. Su llamada a la AntÃƒÂ¡rtida para intentar enviar el pingÃƒÂ¼ino de vuelta fracasa, y termina provocando la llegada de otros cinco pingÃƒÂ¼inos a la puerta de Poper. \n\nMientras comienza a hacer migas, y cada vez mÃƒÂ¡s implicado con sus compaÃƒÂ±eros alados de apartamento, la vida de Poper rÃƒÂ¡pidamente empieza a desmadrarse: su ostentoso apartamento de Nueva York se convierte en un paraÃƒÂ­so invernal, el contrato en el que ha estado largo tiempo trabajando descarrila y por poco no termina en la cÃƒÂ¡rcel. Pero, gracias a sus nuevas obligaciones, Poper comienza a comprender la importancia de una familia, humana y no tan humana. \n\nNotas de producciÃƒÂ³n:\n- AdaptaciÃƒÂ³n del texto infantil de Richard y Florence Atwater que se editÃƒÂ³ por primera vez en 1938.\n","torrent":{"xt":"urn:btih:045e1d462e99502e6460609cace0f55e10c78ea7","amp;dn":"Mr+Poppers+Penguins++%282011%29+TS-ScreenerHQ+DUAL+Eng-Spa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045e1d462e99502e6460609cace0f55e10c78ea7","infoHashBuffer":{"type":"Buffer","data":[4,94,29,70,46,153,80,46,100,96,96,156,172,224,245,94,16,199,142,167]},"announce":[],"urlList":[]}}