{"title":"A Good Ol' Fashioned Orgy(2011)DVDRip.AC3(ENG)-DROCK","uid":7276275,"size":734605312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:052aa7b52cd170ca44c1a0536bbe157d64c4d72d&amp;dn=A+Good+Ol%27+Fashioned+Orgy%282011%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1337292378,"description":"An arrested adolescent hell-bent on good times decides to throw a different sort of bash in this comedy. Eric (Jason Sudeikis) is in his early thirties, but he hasn't changed much since his high school days -- the guy lives to party with a handful of his old friends, and the crazier the get-together, the better. Every summer, Eric throws an epic-scale theme party at his parents' home in the Hamptons, as he and his pals get crazy at the &quot;White Trash Bash&quot; or a &quot;Star Wars vs. Star Trek&quot; throwdown. However, this grand tradition is about to end, as Eric's dad (Don Johnson) has announced he's selling the house. Eric decides he should save the biggest party for last, and tells his friends he's hosting an orgy. While Eric and his male friends are just thick-headed enough not to see the problems inherent in having group sex with some of their best friends, the gals in their social circle are more hesitant, but most decide to sign on, at least in principle. However, Eric has become infatuated with Kelly (Leslie Bibb), the attractive real-estate agent who is selling the house, and decides to invite her to the big blowout without telling her just what kind of party she can expect. Also starring Will Forte, Tyler Labine, David Koechner, Lake Bell, and Lindsay Sloane, A Good Old Fashioned Orgy was the first directorial project for Alex Gregory and Peter Huyck, who previously served as writers and producers on the television comedies King of the Hill, The Larry Sanders Show, and Frasier.\nLength: 1 Hour 40 Minutes\n\nFrame Width: 624\n\nFrame Height: 336\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 126fps","torrent":{"xt":"urn:btih:052aa7b52cd170ca44c1a0536bbe157d64c4d72d","amp;dn":"A+Good+Ol%27+Fashioned+Orgy%282011%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"052aa7b52cd170ca44c1a0536bbe157d64c4d72d","infoHashBuffer":{"type":"Buffer","data":[5,42,167,181,44,209,112,202,68,193,160,83,107,190,21,125,100,196,215,45]},"announce":[],"urlList":[]}}