{"title":"28 Weeks L:ater(2007)DVDRip.AC3(ENG)-DROCK","uid":6555939,"size":733044736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:064d6eeb593f540f7ae7345806c1739b50f82269&amp;dn=28+Weeks+L%3Aater%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1311292032,"description":"The devastating rage virus that annihilated the British Isles mysteriously resurfaces in Goya Award-winning director Juan Carlos Fresnadillo's sequel to the Danny Boyle-directed horror hit that terrified audiences worldwide by offering a breathless new take on the familiar zombie mythos. Six months has passed since the rage virus caused British residents to indiscriminately murder and destroy everything in their paths, and now the U.S. military has declared victory in the war against the rapidly spreading infection. As the reconstruction process gets underway and the first wave of refugees return to British shores, a family separated by the devastation is happily reunited. During the initial outbreak, Don Harris (Robert Carlyle) and his wife Alice (Catherine McCormack) sat holed up with a small band of survivors in a remote farmhouse. Their kids well out of harm's way at a remote boarding school, Don and Alice's outlook for the future is decidedly bright until all hell breaks loose in the country and Don just barely manages to escape the clutches of the infected. The joy of later seeing his son Andy (Mackintosh Muggleton) and daughter Tammy (Imogen Poots) as repopulation efforts get underway in London is short-lived, however, when an innocent bid to reconnect with the past sets into motion a tragic series of events. Now, just as society struggles to sort through the rubble and rebuild London from the ground up, the virus that nearly destroyed a nation strikes back with a vengeance. Jeremy Renner, Rose Byrne, and Harold Perrineau, Jr. co-star in the frightful sequel, which highlights the dangers of declaring victory in the calm before the storm.\t\n\nRipped with Autogk.\n\nLength: 1 Hour 40 Minutes\n\nFile Type: AVI\n\nFrame Width: 608\n\nFrame Height: 352\n\nFrame Rate: 30fps\n\nAudio\n\nBit Rate: 113kbps","torrent":{"xt":"urn:btih:064d6eeb593f540f7ae7345806c1739b50f82269","amp;dn":"28+Weeks+L%3Aater%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064d6eeb593f540f7ae7345806c1739b50f82269","infoHashBuffer":{"type":"Buffer","data":[6,77,110,235,89,63,84,15,122,231,52,88,6,193,115,155,80,248,34,105]},"announce":[],"urlList":[]}}