{"title":"Democracy Now - 15 sep 2011","uid":6678329,"size":456041114,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0838b53de5890c950e2f4d3fcf12d70a672c7e80&amp;dn=Democracy+Now+-+15+sep+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1316106063,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Sep 15, 2011\n\n- U.S. Envoy, International Leaders Visit Libya; Mass Graves Uncovered\n- Syrians Mark 6 Months of Sustained Protests\n- 19 Killed in Iraq Bombings\n- U.S. Blames Haqqani for Kabul Attack\n- Warren Confirms U.S. Senate Bid in Massachusetts\n- Obama Admin Questioned on Backing of Failed Solar Firm\n- Gov't Report Cites New BP Infractions Before Gulf Spill\n- Texas Urged to Halt Execution Over Racially-Biased Witness\n- California to Release Thousands of Female Prisoners\n- U.S. Urges Sri Lanka to Address War Crimes Findings\n- Ex-Chief of Colombian Secret Police Sentenced to 25 Years\n- Haitians Demand Ouster of U.N. Peacekeeping Force\n- FBI Teaches Anti-Muslim Content in Counter-terrorism Training\n- ICC Urged to Probe Vatican for Sexual Abuse, Cover-Up\n\n\nSpecial reports\n\n- Former Senator Bob Graham Urges Obama to Reopen Investigation into Saudi Role in 9/11 Attacks\n\nFormer Florida governor and senator Bob Graham is calling on President Obama to reopen the investigation into the Sept. 11 attacks after new information has emerged about the possible role of prominent Saudis in the 9/11 plot. According to recent news reports, a wealthy young Saudi couple fled their home in a gated community in Sarasota, Florida, just a week or so before Sept. 11, 2001, leaving behind three cars and nearly all of their possessions. The FBI was tipped off about the couple but never passed the information on to the 9/11 Commission investigating the attacks, even though phone records showed the couple had ties to Mohamed Atta and at least 10 other al-Qaeda suspects. Graham joins us to discuss the news he's called &quot;the most important thing about 9/11 to surface in the last seven or eight years.&quot; As the former chair of the Senate Select Committee on Intelligence, a post he held on September 11, 2001, Graham chaired the Congressional Joint Inquiry into the attacks. He's just written a novel called &quot;Keys to the Kingdom,&quot; which follows a fictitious former senator and co-chair of the 9/11 congressional inquiry who is murdered near his Florida home after he uncovers an international conspiracy linking the Saudi Kingdom to Osama bin Laden and al-Qaeda. Graham says he chose to write the novel after his 2000 non-fiction book, &quot;Intelligence Matters,&quot; was heavily censored.\n\n\n- Genocide-Linked General Otto PÃƒÂ©rez Molina Poised to Become Guatemala's Next President\n\nA retired military general has won the first round in Guatemela's presidential election, leading to a run-off election in November. If elected, General Otto PÃƒÂ©rez Molina would become the first former military official to win the presidency since the end of the military dictatorships in 1986. Human rights groups have accused PÃƒÂ©rez of being directly involved in the systematic use of torture and acts of genocide in Guatemala in the 1980s. PÃƒÂ©rez has run largely on a platform of using &quot;an iron fist&quot; to crack down on drug cartels. Nobel Peace Prize laureate and Mayan activist, Rigoberta MenchÃƒÂº, is one of nine other candidates challenging PÃƒÂ©rez. Democracy Now! discusses the election and its implications with human rights attorney, Jennifer Harbury. Her husband Efrain Bamaca Velasquez, a communist guerrilla leader, who was tortured and killed in 1992 by members of the Guatemalan army. She is the author of a book documenting her quest to undercover what happened to him called, &quot;Searching for Everardo: A Story of Love, War &amp; the CIA in Guatemala.&quot; She has new evidence linking General Otto PÃƒÂ©rez Molina to her husband's death.\n\n\n- &quot;Granito: How to Nail a Dictator&quot;: New Film Tracks Struggle for Justice After Guatemalan Genocide\n\nA new documentary links Guatemala's turbulent past with those who are active players in its present. The film, &quot;Granito: How to Nail a Dictator,&quot; which is part political thriller and part memoir, spans four decades, following several people as they search for the details that can be used to hold accountable those responsible for the genocide in which Guatemalan military and paramilitary soldiers killed more than 200,000 people. The film documents the movement by Mayans to seek justice after the genocide, featuring Nobel Prize-winner and indigenous Guatemalan activist, Rigoberta Menchu, who is challenging Perez in the presidential election.We're joined by the film's co-director, Pamela Yates, who narrates the film's central story about the search for evidence of Guatemala's genocide, much of it drawn from footage she filmed in 1982 for her documentary, &quot;When the Mountains Tremble.&quot; We're also joined by Fredy Peccerelli, director of the Guatemalan Forensic Anthropology Foundation. The film documents his team's work to unearth mass graves in a search for those killed by the military, even as he faces threats from clandestine groups that want the truth to stay buried.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0838b53de5890c950e2f4d3fcf12d70a672c7e80","amp;dn":"Democracy+Now+-+15+sep+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0838b53de5890c950e2f4d3fcf12d70a672c7e80","infoHashBuffer":{"type":"Buffer","data":[8,56,181,61,229,137,12,149,14,47,77,63,207,18,215,10,103,44,126,128]},"announce":[],"urlList":[]}}