{"title":"Attack The Block 2011 BRRip XviD AC3-SANTi","uid":6663198,"size":1544568218,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0caae442005ba106f0391d41b60c1ad8d60a0a00&amp;dn=Attack+The+Block+2011+BRRip+XviD+AC3-SANTi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Test_Verify","files":5,"time":1315592754,"description":"Attack the Block\n\nGenre: Action, Comedy, Sci-Fi\nYear: 2011\nCountry: UK\nRuntime: 88 min\nDirector: Joe Cornish\nCasts: John Boyega, Jodie Whittaker, Alex Esmail and etc.\n\n.: Plot :.\nWhen aliens touch down a movie screen, it is usually near a desolate desert gas station. The humans who are charged with confronting it/them are a hearty band of passers-by who had the misfortune to break down there or spend their whole lives there looking for a way out. A select subset of alien invaders land smack in the middle of New York City or Los Angeles and start annihilating the entire city block by block. Now, direct to you from the producers of Shaun of the Dead is a location and band of warriors just a bit different from the norm.\n\nAliens have invaded a low-rent housing complex in South London complete with Cockney accents! Who gets the unlucky job of standing between them and the rest of humanity? A group of teenagers trying to master their mugging skills and just breaking into the drug racket. Led by their leader Moses and a woman whose role is the \\'always in the wrong place at the wrong time\\' girl, the haphazard group takes on the dog/wolf like aliens while the rest of the apartment building seems blissfully ignorant of the fight which is raging outside in the hallways.\n\nNick Frost shows up as the actor you will recognize from Shaun of the Dead and Hot Fuzz, but he has a limited role as the building\\'s resident drug enthusiast. The girl, Jodie Whittaker, looks exactly like Emily Mortimer. In fact, I thought it was Emily Mortimer until the end credits. The kids are all convincing and are supplied with great one-liners. It would be a hell of a film to combine these South London blokes with the small town kids from Super 8 who join forces to fight yet another thing from the sky. The aliens here though seem like a script afterthought. Almost all of the screenwriter\\'s energy was in the one off gags and witty street banter. The aliens are dimensionless, unexplored, unexplained, and even when they are directly on the screen, you still can barely see them because they are supposedly the blackest things anyone has ever seen, except for their neon green teeth.\n\nAttack the Block is worth seeing for its rare location, its above average dialogue, and because you\\'ll take away some sayings you can use with your friends later such as \\&quot;Trust\\&quot; and \\&quot;Believe\\&quot;. Don\\'t go for the aliens, many other films have done that better, but most films do not match this sophisticated level of mockery.\n\n\n\nAttack The Block 2011 BRRip XviD AC3-SANTi\n\nA teen gang in South London defend their block from an\nalien invasion\n\nDuration: 1h 27m 44s iMDB: imdb.com/title/tt1478964\nFile Size: 1.42 GiB Source: 720p iNFAMOUS\n\nViDEO AUDiO\nCodec: XviD Codec: AC-3\nBitrate: 1876 kbps Bitrate: 448 kbps\nRes/FPS: 720x304 / 24.000 Channels: 5.1\nFilters: BVOP-NoQpel-NoGMC-Default Matrix\n\nContinuing to provide QUALITY which is our priority\n\n* English subs included for those who need it\n\n* Special filters used which takes a lot of time to encode\nFor those who wait knows what they\\'re getting and we\ndo not disappoint\n\n* Colors, brightness and contrast untouched same as source\n\n* Standard filesize to make this release DVD burn friendly\n\n* Compatibility: PC, PS3, XBOX 360, Popcorn Hour\nWDTV HD media player, WDTV LIVE HD media player\nWDTV Live Plus HD media player and other media players\n\niCE Yca Ezra M1k3L p0xy rok3r\nT0XiC spongebob SAFC w00t FLAWL3SS\nDiNZi BmB oldbomb MLG ViSiON MEDiC\nRx mcchris KaN1vE vidya Resurrector\n\nSpecial thanks to MB for making these rips possible\n\n\n\n","torrent":{"xt":"urn:btih:0caae442005ba106f0391d41b60c1ad8d60a0a00","amp;dn":"Attack+The+Block+2011+BRRip+XviD+AC3-SANTi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0caae442005ba106f0391d41b60c1ad8d60a0a00","infoHashBuffer":{"type":"Buffer","data":[12,170,228,66,0,91,161,6,240,57,29,65,182,12,26,216,214,10,10,0]},"announce":[],"urlList":[]}}