{"title":"Lion Cache Cleaner v6.0 MacOSX Intel","uid":6554988,"size":18280019,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:1104ff40f5cdd056e54a7ed7dc77778d585f2eed&amp;dn=Lion+Cache+Cleaner+v6.0+MacOSX+Intel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1311255761,"description":"Lion Cache Cleaner v6.0 MacOSX Intel\n\nLion Cache Cleaner is an award winning general purpose tool for Mac OS X. LCC makes system maintenance simple with an easy point and click interface to many OS X functions. Novice and expert users alike will appreciate the powerful toolset LCC provides. Lion Cache Cleaner is installed on thousands of personal and business systems around the globe.\n\nMaintenance\nLion Cache Cleaner is a one stop solution for all of your OS X maintenance needs. Intel or PPC, Tiger or Lion, LCC has the tools to keep your system running at its best. LCC Documents and the LCC Engine maintain system health by providing full automation of common maintenance chores including virus scanning of internet downloads. The LCC Engine can even repair permissions automatically after software installations. With the LCC Engine, powerful system maintenance and antivirus can be completely transparent or as close as your menu bar.\n\nOptimization\nLion Cache Cleaner can improve system performance by tuning internet and file cache settings, implementing ram disks, and cleaning out various cached and stale data. LCC includes tools to help optimize files and memory. LCC can recover wasted disk space by eliminating language localization files and slimming Universal Binaries.\n\nCustomization\nLion Cache Cleaner lets you control your OS X experience. Turn off Spotlight or Dashboard, or turn on a Login Items Folder. LCC can tweak many OS X features to suit your tastes. All without permanently altering or harming your system.\n\nDisaster Planning\nLion Cache Cleaner lets you create a bootable Installer dvd from your Lion download that will boot and install Lion on any supported machine. Lion Cache Cleaner lets you create bootable Emergency Disks that include system repair utilities and LCC's powerful cache cleaning functions. If disaster strikes, the power of Lion Cache Cleaner is available at the command prompt in Single User Mode. Registered users of LCC can install a portable version on a flash drive or iPod. Lion Cache Cleaner Portable runs on any supported Mac and is a great tool for testing hard drives, screen pixels, batteries, ram, and more before buying a machine.\n\nAntivirus\nLion Cache Cleaner helps protect your system from malware. LCC adds three additional layers of malware protection to Lion, and ships with the powerful ClamAV antivirus built in. LCC can scan your downloads on the fly providing industrial strength virus protection from Mac and Windows threats.\n\nWhat's New in version 6.0:\nThis release updates all of the maintenance routines and customization features to work in Lion while still maintaining backwards compatibility down to OS X 10.4. This release also includes other minor bug fixes and improvements.\n\nHomepage &lt;a href=&quot;\nhttp://www.northernsoftworks.com/lioncachecleaner.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.northernsoftworks.com/lioncachecleaner.html&lt;/a&gt;\n\n\n\n\n\n\n\n\nfor my 1000+ torrents \n                 &lt;a href=&quot;\nhttp://thepiratebay.se/user/Anacondaz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Anacondaz/&lt;/a&gt;\n\n\nfor reporting bad torrents\n                 &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\n\nto join the forum go here\n                 &lt;a href=&quot;\nhttp://forum.suprbay.org/member.php?action=register&amp;referrer=126762&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/member.php?action=register&amp;referrer=126762&lt;/a&gt;\n\n\t\t","torrent":{"xt":"urn:btih:1104ff40f5cdd056e54a7ed7dc77778d585f2eed","amp;dn":"Lion+Cache+Cleaner+v6.0+MacOSX+Intel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1104ff40f5cdd056e54a7ed7dc77778d585f2eed","infoHashBuffer":{"type":"Buffer","data":[17,4,255,64,245,205,208,86,229,74,126,215,220,119,119,141,88,95,46,237]},"announce":[],"urlList":[]}}