{"title":"The Moderns (1988) Xvid with multisubs (moviesbyrizzo)","uid":6542579,"size":1468466499,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:11857873a8f7c96c05dd86c8f4f722d7087de394&amp;dn=The+Moderns+%281988%29+Xvid+with+multisubs+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"moviesbyrizzo","files":-1,"time":1310746675,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0095649/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0095649/&lt;/a&gt;\n\nThis is the PAL to Xvid version that we found on the net and bring to you as-is\nWe added several subtitles that we fixed to fit the format of a split \nfile movie (Movie is in two equal part avi files - as thats how we found them)\n\nSubtitles for Polish, Spanish, Russian and an English template too is\nincluded for whatevr othe rlanguage conversion needs you might have.\nWe could only at this point find the ones included here for you initially.\n\n\nThis is a movie which has remained with me for years since I first enjoyed\nit at a small Toronto movie theater back in 1988 when it was released.\n\nThere is great charm to Paris in the 20s - multiculturalism is unheard of\nalthough there is a &quot;new kid in town with money toburn&quot; played by John Lone\nwith an intense effect on the woman of Italy (lovely Ms. Linda Fiorentino) \nthat he is teamed with in sexual engagement - although in a completely misfitted\nsituation to what is the alternative offered by the character of Artist/ Art forger Keith Carradine in the movie as he comes to save the day, as a man with\na much lighter touch on the senses I submit entirely with sincerety too.\n\nWallace Shawn (My Dinner with Andre) describes (boxer) Lone's character as \n&quot;trying to buy his way into (Parisian) cluture&quot;\n\nIts a nice movie to have and with great romantic passion on the part\nof Ms. Fiorentino that seeks to be given justice as her sort rarely\nhas found in human history - Im sorry to say - yet she has survived\nand in fine spirits indeed - to be the real thing too - equally - and\noerhaps even as she takes turns on the stage while deferring ultimately\nto those that survived more able to continue into an eternity this way \nsuch as those that have the Melanie Griffith secret of success in maintaing\na clearly most vibrant spirit.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:11857873a8f7c96c05dd86c8f4f722d7087de394","amp;dn":"The+Moderns+%281988%29+Xvid+with+multisubs+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11857873a8f7c96c05dd86c8f4f722d7087de394","infoHashBuffer":{"type":"Buffer","data":[17,133,120,115,168,247,201,108,5,221,134,200,244,247,34,215,8,125,227,148]},"announce":[],"urlList":[]}}