{"title":"Clarify 1.1.1 (Trial) Cracked","uid":7275955,"size":31673752,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:13d1f9eef0bdeca6901d7ce32dd5faeb2dc815a7&amp;dn=Clarify+1.1.1+%28Trial%29+Cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dudegu87","files":313,"time":1337279910,"description":"Clarify provides a hassle-free way of turning screenshots into beautiful documents in five minutes or less. \n\nMany screen capture applications let you work with one picture at a time. But combining multiple screenshots into clear documents is a pain. It's such a pain that most of us don't take the time to do it, even though we KNOW our clients, co-workers and friends would like us to use more pictures when we are trying to help them. \n\nClarify gets rid of all of the hassle and frustration of creating documents out of screenshots. Say goodbye to working with multiple screen capture, image editing and word processing applications and say hello to instant productivity. \n\nClarify lets you:\nCapture multiple images and turn them into a document\nAdd text and annotations with simple, integrated tools\nShare your document via email, PDF, Dropbox or Clarify-it.com\nCustomer quotes via Twitter: \n\n&quot;The App is genius! Just created an instructional document that would have been 6 paragraphs of exposition otherwise. Thank you!&quot; - @mostlymuppet \n\n&quot;LOVE Clarify for Mac. Took me 3 minutes to do what would usually take 30 minutes! Clients are happy, which makes me happy!!&quot; - @zolihonig \n\nFeatures:\nCapture windows or regions\nImport photos or other image files\nAssemble multiple images or screen captures into a document\nEasily reorder screen captures\nEasily replace images (Clarify remembers the size and location of the original capture making updates a snap)\nCrop and resize images\nAdd borders or picture frames\nAdd arrows, boxes, circles, highlights, text annotations and numbers\nBlur out sensitive information\nExport as PDF\nExport individual images or all images in a document\nShare online via Dropbox or Clarify-it.com\nCopy RTF content to emails, word processing documents or Evernote\n\n\n\nThis appears as a trial, but has no restrictions.","torrent":{"xt":"urn:btih:13d1f9eef0bdeca6901d7ce32dd5faeb2dc815a7","amp;dn":"Clarify+1.1.1+%28Trial%29+Cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d1f9eef0bdeca6901d7ce32dd5faeb2dc815a7","infoHashBuffer":{"type":"Buffer","data":[19,209,249,238,240,189,236,166,144,29,124,227,45,213,250,235,45,200,21,167]},"announce":[],"urlList":[]}}