{"title":"[TVB] Gloves Come Off æ‹³çŽ‹ 1-25 RMVB","uid":7279684,"size":5909797886,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:13e2f0f6c3b5bda0726b8615791afdde25b6850a&amp;dn=%5BTVB%5D+Gloves+Come+Off+%E6%8B%B3%E7%8E%8B+1-25+RMVB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxbel","files":-1,"time":1337399689,"description":" &lt;a href=&quot;http://en.wikipedia.org/wiki/Gloves_Come_Off&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://en.wikipedia.org/wiki/Gloves_Come_Off&lt;/a&gt;\n\nSynopsis\n\nTong Sap Yat (Kevin Cheng) was a devoted adherent of Muay Thai, wishing to prove himself against the best practitioners of the art, he fought in underground matches in Thailand, and out of a desire to win accidentally kills an opponent. Jailed for manslaughter for 7 years, Tong returns to Hong Kong 11 years later a changed man. During his time in prison his wife died of an untreated illness leaving Tong a lone parent and sole provider for his son. A remorseful Tong attempts to wash his hands of Muay Thai and seeks to lead a peaceful and peaceable life.\n\nKo Wai Ting (Kenny Wong) is Tong Sap Yat's friend, and they were students together in the same Muay Thai gym, in the intervening years Ko has built a successful Muay Thai boxercise business, based on his own success and the success of his stable of fighters in competition. With his stable depleted by injuries and defections, leaving him weak in some weight classes, Ko attempts to convince Tong to return to the ring. The promised purse being enough to lift Tong from his hand-to-mouth existence as a security guard and odd-job man and allow him to better provide for his son.\n\nPat Ka Sing (Raymond Wong), although athletic and fit, is a newcomer to Muay Thai, saved by Ko Wai Ting from a beating by muggers, Pat joins Ko's gym to learn enough to protect himself, but initially has no wish to fight in competition. A natural at the sport, Pat is persuaded to fight and falls in love with the experience; Muay Thai giving him a purpose and direction in life that he had previously lacked.\n\nWhile each gains from being in the ring, be it money, glory or self-esteem, they each come to desire to know just how good they are and which of them is the true &quot;King of the ring&quot;.","torrent":{"xt":"urn:btih:13e2f0f6c3b5bda0726b8615791afdde25b6850a","amp;dn":"%5BTVB%5D+Gloves+Come+Off+%E6%8B%B3%E7%8E%8B+1-25+RMVB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13e2f0f6c3b5bda0726b8615791afdde25b6850a","infoHashBuffer":{"type":"Buffer","data":[19,226,240,246,195,181,189,160,114,107,134,21,121,26,253,222,37,182,133,10]},"announce":[],"urlList":[]}}