{"title":"Silas-TiNYiSO","uid":6679870,"size":1373653452,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:13e6806b7f1416a315b56df6bfd2f549249028f6&amp;dn=Silas-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1316166716,"description":"Silas-TiNYiSO\n\nSilas (c) Exalt Studios\n\nRelease On   : 15 September 2011         Disk Amount/Format : 1 DVD ISO\nType of Game : Action                    Media Protection   : Nothing\n\n\nRelease Information:\n\nWelcome To Planet Silas!\n\nA tournament has been formed, and you have been chosen to fight. You will\nlearn how to fly, race, and kill with precision while unlocking tons of\ncheats and achievements. As you become better, you'll gain new perks and\nranks, advance to the top of the leaderboards, and ultimately become the\nbest this planet has ever seen.\n\nIn the first ever FPS/Kart Hybrid, it's up to you to decide how you want\nto play. With innovative modes that allow you to get in on the action\nlike you never have before. From the fast paced races, to the kart\ncombat on the ground and air, Silas delivers an intense experience that\nnever slows down!\n\nPlay against your friends online or in LAN, or keep to yourself in the\nsingle player modes. 21 levels, 18 weapons, 10 modes, and over 30\noriginal songs make this one of the biggest indie games ever!\n\nFeatures:\n\nUnique Intense Gameplay\n   \nReach great speeds while still maintaining solid maneuverability. Whether\nyou're playing in the online modes or single player, Silas just feels\ndifferent than any game before it. It is extremely fast and intense,\nallowing you to blow up your opponents with tons of different weapons,\nall while making decisions in split seconds. The many obstacles and\nboosts scattered around the tracks and arenas only add to the excitement.\n   \nInnovative Ground-Air/Air-Air Combat\nTake the battle to the skies with the flight powerups, or bring down\nanyone in the air using the unique instant &quot;&quot;Turret Mode&quot;&quot; functions of\nthe weapons. The anti-air weapons are all very well thought out. This\nallows the player to develop many different strategies to win. If you're\nin the air, you can easily defend yourself with dual chain guns and the\nability to carpet bomb your foes.\n   \nA Really Deep Single Player Experience\n  \nThere are 12 characters and karts in Silas, each with their own unique\nattributes. Play in the Grand-Prix, V.S, Time Trail, and Mercenary Modes.\nThe Mercenary Mode offers 24 missions that you have to complete in the\nshortest time possible, including 4 boss battles. Plus 24 achievements,\n20 cheats, and even a museum showing off the games development over the\nyears. Silas delivers many hours of gameplay with tons of unlockables.\n   \nThe Full Multiplayer Experience\n    \nUp to 12 player online gameplay. Create a profile and gain up to 50\ndifferent ranks and 30 perks as you become the best in the world. Stats\nare tracked for everything, and if that wasn't enough, you can fully\ncustomize every multiplayer game you create. There is also a message\nboard and leaderboards for kills, races, and Time Trail scores. Capture\nthe flag, Capture the Pipes, Deathmatch, Team-Deathmatch, Survival, and\nOnline racing are the multiplayer modes. And if you're not into online\nplay, then you and your friends can easily play the LAN mode at home.\n    \n21 Diverse Worlds\n    \nThe racetracks, arenas, and other locals within Silas offer you an\namazing assortment of challenges and opportunities. Designed for great\ngameplay before any major graphics work is done on them, they offer\nboth and immersive experience and a great sense of flow. Since this is\na fantasy game with a sci-fi edge, the worlds range anywhere from snow,\nto deserts, to space, to the unknown.\n   \n18 Weapons, 32 Different Functions\n   \nEach weapon has 2 unique functions suited for different situations. There\nare 2 classifications of weapons, projectile based and turret based. The\nturret based weapons utilize a lock-on system never seen in racing games\nbefore, allowing a seamless experience between racing and targeting. Or\nyou can duke it out in &quot;&quot;Shooter Mode&quot;&quot; which allows you to seamlessly\ntarget your foes in battle.\n   \n32 Song Original Soundtrack\n   \nEach song in the game was produced to the best quality possible by\nLoudcore. I have always believed in offering the best audio experience\npossible. With 100's of audio effects, and 32 songs, the audio is top\nnotch in Silas.\n   \nExperience Great Visuals\n   \nOffering many great features such as reflective/refractive water, glass,\nvolumetric clouds, DOF, HDR, normalmapping, shadowmapping, postprocessing\neffects, dynamic weather, dynamic lighting, and realistic vegetation.\nAlong with the various effects and unique visual style, the worlds come\nto life in a very imaginative way. Silas is leading the way in its genre.\n   \nDynamic tutorial modes which teach your how to play directly in the game.\n\n\n\nBurn/mount, install, play!\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n\n\n&quot; SIZE DOES NOT MATTER! &quot;\n\n","torrent":{"xt":"urn:btih:13e6806b7f1416a315b56df6bfd2f549249028f6","amp;dn":"Silas-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13e6806b7f1416a315b56df6bfd2f549249028f6","infoHashBuffer":{"type":"Buffer","data":[19,230,128,107,127,20,22,163,21,181,109,246,191,210,245,73,36,144,40,246]},"announce":[],"urlList":[]}}