{"title":"POtHS - Holy Treasures - 16 - Ancient Archeology - Mystery of th","uid":7386363,"size":4433085182,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1861028129d026fad8448ad6b93beb82878e402a&amp;dn=POtHS+-+Holy+Treasures+-+16+-+Ancient+Archeology+-+Mystery+of+th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":71,"time":1340644472,"description":"POtHS - Holy Treasures - 16 - Ancient Archeology - Mystery of the Pyraminds\n\n\n\n\nPOtHS Comments on This one: These are good films.  \n\n\nDiscription -  \n\n\n\nTHE REVELATION OF THE PYRAMIDS:\nNarrated by Brian Cox, Revelation Of The Pyramids takes an in-depth look into one of the seven wonders of the world, the Great Pyramids of Egypt.  Mystery has surrounded these epic structures for centuries with theories varying from the scientific to the bizarre. However with over thirty seven years of in depth research taking in sites from China, Peru, Mexico and Egypt one scientist has as at last managed first to understand and then to prove what lies behind this greatest of archaeological mysteries: a message of paramount importance for all mankind, through time and space.  \n\n\nLost Pyramids and Other Hidden Ancient Artifacts:\nIndiana Jones, the fictional adventurer and treasure seeker introduced in 'Raiders of the Lost Ark' lit the world on fire with ideas of ancient mystical legends. But little is known about our true ancient past. Klaus Dona, an adept researcher on a quest for artifacts, held the world's first 'Unsolved Mysteries' exhibit to Vienna in 2001. The over 400 original artifacts on display revealed a forbidden archeology and pointed to lost civilizations whose acceptance would re-write history. Crystal skulls, ancient world maps, mysterious continents, Atlantean relics, golden space craft, tools that defy modern technology, magnetic pyramids that glow under ultraviolet light, and evidence of giants 25 feet tall! Join Klaus as he details his findings in 'Secret World I', the first in a series of educational DVDs that chronicle his adventures and discoveries.\n\nA symposium for lost pyramids, ancient artifacts, alien skulls and other anomalous objects from around the world. For a more deeper analysis go to","torrent":{"xt":"urn:btih:1861028129d026fad8448ad6b93beb82878e402a","amp;dn":"POtHS+-+Holy+Treasures+-+16+-+Ancient+Archeology+-+Mystery+of+th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1861028129d026fad8448ad6b93beb82878e402a","infoHashBuffer":{"type":"Buffer","data":[24,97,2,129,41,208,38,250,216,68,138,214,185,59,235,130,135,142,64,42]},"announce":[],"urlList":[]}}