{"title":"Need for Speed: LTi6/Lossless ","uid":6668522,"size":1501065530,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:18bea6aa0d1fe47efeb38dfe7dff330b1474bbd1&amp;dn=Need+for+Speed%3A+LTi6%2FLossless+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"doareu1234","files":29,"time":1315788328,"description":"Need for Speed ??World Online - A new entertainment project with thrilling gameplay, great graphics and a complex rating system, encouraging interaction of players. Players can join a team and challenge rivals and the police on numerous routes in different modes of multiplayer games. The new project represents an opportunity to gather and alter the character, riding a realistic licensed cars, and track the achievement of individual riders in races with the largest open-world game in the history of Need for Speed.\n\nFeatures:\n* Need for Speed ??is one of the most successful video game franchises in the world, and is particularly popular in Hong Kong and Taiwan.\n* We are pleased to present this draft EA in Asia and begin self-publishing products in Taiwan and Hong Kong.\n* We are looking forward to the results of this test, to make the necessary improvements in the game and provide the best online product of Asian players, &quot;- said Jon Niermann, President of EA Asia.\n\nSystem requirements:\nv Operating system: Microsoft Windows XP / Windows Vista / Windows 7\nv Processor: Intel Pentium IV 2.1 Ghz\nv RAM: 1 GB XP / 2 GB Vista / 7\nv Video Card: compatible with DirectX, Memory 256 MB\nv Sound Card: DirectX 9.0c compatible\nv Free disk space: 3.3 GB\n\nList of changes from 10/09/2011:\n25.08.2011\nInnovations:\n- Sporting parts were added to the store for in-game currency\n- Amplifier money and reputation are now given an increase of 100% instead of 25% and work within 10 days instead of 7\nNOTE: This change only affects amplifiers, purchased after a patch, but have an older amp and buying a new, old and will increase 100%\n- Mercedes-Benz SLR McLaren 722 was added to the game and is available in Car Dealers\n- Audi RS 4 was added to the game and is available in Car Dealers\nCorrections:\n- Fixed a bug that appeared when trying to unlock vinyls\n- Artificial Intelligence traffic has been amended to reduce the instances of inappropriate behavior of cars (most often seen in the folding of players)\n- Fixed an issue because of which I drive Audi TT RS on the back after the installation of tuning parts\n- Some effects of nitro missing have been added for some skirts Porsche 911 GT3 RS\n- Some missing icons were added to vinyl for the Porsche 911 GT3 RS\n- Fixed a display issue on the effect of nitro Lotus Exige Cup 260s\n- Fixed a problem when trying to escape a client joining the race with an open window profile\n- Fixed an issue blocking control after closing the message box of the violation\n- Fixed an issue because of which did not work properly display after police Treasure Hunt\n- Fixed disappearance of the interface after the Meeting Places\n- Some missing reversing lamps were added at the Audi A1 Clubsport quattro\n- Fixed some body kits Porsche 911 GT3 RS\n- Fixed View &quot;from the hood&quot; at the Porsche Cayman S &quot;Treasure Hunter&quot;, Audi A1 Clubsport quattro and Mazda MX5\n- Fixed an issue which caused the highway to Eagle Drive, in some cases at the start of one of the players appeared trash\n31-08-11\n1. Introducing The Nissan Skyline R34 Art Director Car\nThe exclusive creation of teams of artists NFSW! Due to the black tinting, aggressive black-red vinyl, and exclusive license plate &quot;RAVEN&quot;, Nissan Skyline R34, certainly excite you!\nNissan Skyline R34 Art Director Car is now available as a gift when you buy SpeedBoost. Get it today!\n2. Introducing the Porsche GT3 RS - Cop Edition\nPowerful and fast Porsche GT3 RS Cop Edition with a design taken from the NFS Hot Pursuit! How fast? Your competitors will see only a glimpse of the exclusive license plate &quot;SCPD&quot; during the race with you.\nThis Seacrest County Police Edition car is equipped with RACE TUNED parts that will give you an extra advantage over your competitors.\n&quot;Speed ??Enforcer&quot; ready to race and dominate them. Get your own at the store!\n7-09-11\n1. Introducing the 1973 Nissan Skyline 2000GT-R\nDesigned for racing, 1973 Nissan Skyline 2000GT-R is a true legend and a very rare model Skyline.\nIn Need For Speed ??World is no more of these cars, so with this retro racer you just select themselves out of the gray masses! Only 197 copies have been designed, so make sure that the tier 1 rocket you have.\nGet it today! 1500 SpeedBoost\n2. Darius R8 is now available for game currency!\nCar for in-game currency! Darius R8 is a classic car Need for Speed, not to mention the fact that this machine is the main boss in NFS Carbon.\nHe sought respect on the streets Palmont'a and now it's your turn to take the streets NFSW!\nOn the top boss of the driver's seat, sit behind the wheel and add it to your collection to enter the elite club of owners of the vehicle level 40!\n\nFeatures:\nDo not cut / no recoded\nBeen updated as of 10/09/2011\nBetter compression, short installation time\nTo install the required 512 MB of RAM\nInstallation time ~ 10 min.\nRuns a full scan of the server on the integrity of game files\nRePack by fatal2266\n","torrent":{"xt":"urn:btih:18bea6aa0d1fe47efeb38dfe7dff330b1474bbd1","amp;dn":"Need+for+Speed%3A+LTi6%2FLossless+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18bea6aa0d1fe47efeb38dfe7dff330b1474bbd1","infoHashBuffer":{"type":"Buffer","data":[24,190,166,170,13,31,228,126,254,179,141,254,125,255,51,11,20,116,187,209]},"announce":[],"urlList":[]}}