{"title":"Armed Conflict Injuries to the Extremities{BBS}","uid":6672929,"size":56762657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c4cfb0dc2d6c324e4813877d3238061f40c94d7&amp;dn=Armed+Conflict+Injuries+to+the+Extremities%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1315930386,"description":"This book is designed to meet the continued need to re-learn the principles of treatment of complex war injuries to the extremities in order to minimize post-traumatic and post-treatment complications and optimize functional recovery. Most of the chapters are based on the unique experience gained in the treatment of military personnel who have suffered modern combat trauma and civilian victims of terror attacks at a single, large level 1 trauma center. The remaining chapters present the experience of leading international authorities in trauma and reconstructive surgery. A staged treatment protocol is presented, ranging from primary damage control through to definitive functional limb reconstruction. The organization of medical aid, anesthesiology, diagnostic imaging, infection prophylaxis, and management of complications are reviewed, and a special chapter is devoted to the challenging dilemma of limb salvage versus amputation in the treatment of limbs at risk.\nFrom the Back Cover\n\nModern weapons and high-energy accidents inflict devastating damage to soft tissue and bone. As a result, both primary treatment and late limb reconstruction present a difficult surgical challenge. This book is designed to meet the continued need to re-learn the principles of treatment of complex war injuries to the extremities in order to minimize post-traumatic and post-treatment complications and to optimize functional recovery. \n\nMost of the chapters in the book are based on the unique experience gained in the treatment of military personnel who have suffered modern combat trauma and civilian victims of terror attacks at a single, large level 1 trauma center. The remaining chapters present the experience of leading international authorities in the field of trauma and reconstructive surgery. A staged treatment protocol is presented, ranging from primary damage control, including the use of external fracture stabilization, through to definitive functional limb reconstruction by means of various internal and external fracture fixation methods.  The organization of medical aid, anesthesiology, diagnostic imaging, and infection prophylaxis also receive detailed attention.  The management of potential complications such as delayed unions, non-unions, and osteomyelitis is reviewed, and controversies in limb salvage are considered.  Primary and late limb amputations are fully discussed, and a special chapter is devoted to the challenging dilemma of limb salvage versus amputation in the treatment of limbs at risk. \n\nThis well-illustrated book will be of value both to beginners and to experts in the field of trauma, including orthopedic surgeons, plastic surgeons, vascular surgeons, and military medical personnel.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 431 pages\n    * Publisher: Springer; 1st Edition. edition (July 18, 2011)\n    * Language: English\n    * ISBN-10: 3642161545\n    * ISBN-13: 978-3642161544","torrent":{"xt":"urn:btih:1c4cfb0dc2d6c324e4813877d3238061f40c94d7","amp;dn":"Armed+Conflict+Injuries+to+the+Extremities%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c4cfb0dc2d6c324e4813877d3238061f40c94d7","infoHashBuffer":{"type":"Buffer","data":[28,76,251,13,194,214,195,36,228,129,56,119,211,35,128,97,244,12,148,215]},"announce":[],"urlList":[]}}