{"title":"Game.of.Thrones.S02E05.HDTV.XviD-MGD","uid":7229362,"size":577433600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1e59fb6e366dff474d29efffb5c5ec22b1807b6b&amp;dn=Game.of.Thrones.S02E05.HDTV.XviD-MGD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"api731","files":1,"time":1335784189,"description":"Game of Thrones\n\nGenre: Drama, Fantasy\nYear: 2012\nCountry: USA\nRuntime: 60 min\nProducer: Thomas Martin\nCast: Isaac Hempstead-Wright, Charles Dance, John Bradley, Ron Donachie, Mark Addy, Alfie Allen, Gethin Anthony, Emilia Clarke\n\n.: Plot :.\nSeven noble families fight for control of the mythical land of Westeros. Political and sexual intrigue abound. The primary families are the Stark, Lannister, and Baratheon families. Robert Baratheon, King of Westeros, asks his old friend Eddard Stark to serve as his chief advisor. Eddard, suspecting that his predecessor had been murdered, accepts so that he can investigate further. It turns out more than one family is plotting to take the throne. The Queen's family, the Lannisters, may be hatching an incestuous plot to take control. Across the sea, the last surviving members of the previously deposed ruling family, the Targaryens, are also plotting a return to power. The conflict between these families and others, including the Greyjoys, the Tullys, the Arryns, and the Tyrells, leads to war. Meanwhile, in the north, an ancient evil awakens. Amidst war and the political confusion, a brotherhood of misfits, The Night's Watch, is all that stands between the realms of men and the horrors beyond.","torrent":{"xt":"urn:btih:1e59fb6e366dff474d29efffb5c5ec22b1807b6b","amp;dn":"Game.of.Thrones.S02E05.HDTV.XviD-MGD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e59fb6e366dff474d29efffb5c5ec22b1807b6b","infoHashBuffer":{"type":"Buffer","data":[30,89,251,110,54,109,255,71,77,41,239,255,181,197,236,34,177,128,123,107]},"announce":[],"urlList":[]}}