{"title":"THE DICTATOR Xvid Cam GLOBE","uid":7295852,"size":938563642,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ff64f17d990c82c0e9a20e9b110d19e8a22378d&amp;dn=THE+DICTATOR+Xvid+Cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1337882361,"description":"* XVID CAM  * 01H16M14S    * + 1400 Bitrate\n\n* CONVERTED HIGH QUALITY XVID AVI\n\n\n\n\n* Plot :\n\nFor forty years, the North African Republic of Wadiya has been ruled by Admiral General Hafez Aladeen (Sacha Baron Cohen), a childish, lecherous, anti-western and antisemitic despot who surrounds himself with female bodyguards and is working on developing nuclear weapons. After the United Nations Security Council resolves to intervene militarily, Aladeen travels to the UN Headquarters in New York City to address the council. Shortly after arriving, he is kidnapped by Clayton (John C. Reilly), a hitman hired by his traitorous uncle Tamir (Ben Kingsley). Tamir then replaces Aladeen with a political decoy named Efawadh, who he can manipulate into signing a document democratizing Wadiya and opening the country's oil fields for business. Aladeen escapes, but his beard has been shaved off by Clayton, making him practically unrecognizable. He encounters activist Zoey (Anna Farris), who offers him a job at her alternative lifestyle co-op. Aladeen refuses the offer and travels to New York's &quot;Little Wadiya&quot;, populated by refugees from his country, where he encounters Nadal (Jason Mantzoukas), the former chief of Wadiya's nuclear weapons program, whom Aladeen thought he had previously had executed.\n\nWanting his old job back, Nadal promises to help reinstate Aladeen as dictator on condition that he make him head of Wadiya's weapons of mass destruction program again. Aladeen then accepts Zoey's job offer, as Zoey's employees have access to the hotel where the signing ceremony is to take place. Aladeen falls in love with Zoey after she refuses his sexual advances and teaches him to masturbate. In gratitude, Aladeen begins running the co-op in an authoritarian manner, forming a personality cult around Zoey and intimidating a shop inspector into giving the store a good review. After acquiring a new beard taken from a corpse, Aladeen infiltrates the hotel and incapacitates Efawadh. At the signing ceremony, he tears up Tamir's document in front of the UN delegation, and holds an impassioned speech praising the virtues of dictatorships, drawing unintended parallels to current issues within the United States. However, upon seeing Zoey in the room, he declares his love for her and, knowing Zoey's strongly-held views, vows to democratize his country, but not on totally capitalistic terms.\n\nA year later, Wadiya holds its first democratic elections, although they are rigged in favor of Aladeen. Afterwards, he marries Zoey, but is shocked when she crushes a glass and reveals herself to be Jewish.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n\n\n","torrent":{"xt":"urn:btih:1ff64f17d990c82c0e9a20e9b110d19e8a22378d","amp;dn":"THE+DICTATOR+Xvid+Cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff64f17d990c82c0e9a20e9b110d19e8a22378d","infoHashBuffer":{"type":"Buffer","data":[31,246,79,23,217,144,200,44,14,154,32,233,177,16,209,158,138,34,55,141]},"announce":[],"urlList":[]}}