{"title":"Democracy Now - 12 jul 2011","uid":6535190,"size":446190698,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:206a8bb48996a11490ab2e54870c376657169696&amp;dn=Democracy+Now+-+12+jul+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1310490280,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jul 12, 2011\n\n- Brother of Afghan President Hamid Karzai, Assassinated in Kandahar\n- Multiple U.S. Drone Strikes in Northwest Pakistan Kill at Least 45 People\n- CIA Organized Fake Vaccination Program to Identify Osama bin Laden\n- United Nations Describes Somalia As &quot;Worst Humanitarian Disaster in the World&quot;\n- U.S. Anti-Terror Laws Hamper Aid Effort in Somalia\n- Drought Spreading Through The United States Rivals Dust Bowl Era\n- WikiLeaks' Founder Julian Assange in U.K. Court for Extradition Appeal\n- Murdoch Scandal Expands; Scotland Yard, Former British Prime Minister Targeted\n- Israeli Knesset Passes Law to Punish Boycotts of Israel, West Bank\n- Assad Loyalists Attack U.S., French Embassies In Syria\n- NRA Opposes New Rules Limiting Semi-Automatic Rifle Sales Near Mexican Border\n- Betty Ford Funeral to Be Held in California\n\n\nSpecial reports\n\n- Debt Lock: Will Obama Make Cuts to Social Security and Medicare?\n\nAs President Obama tries to broker a compromise budget deal that would allow Congress to raise the national debt ceiling before an August 2 deadline, he may appease Republicans by cutting funding for Medicare and Social Security. Congressional Democrats say they have ruled out any gutting of Social Security, but there are concerns the cuts could still be achieved through a back-handed approach. Retiree benefits are set by the Consumer Price Index, which is used to calculate cost-of-living benefits. Obama and top Democrats have left open the possibility of readjusting the CPI, which could effectively amount to a cut for Social Security recipients. For more on this debate, we speak with Rep. RaÃƒÂºl Grijalva (D-Ariz.), co-chair of the Congressional Progressive Caucus, which has sent President Obama a letter calling for the protection of Social Security and Medicare under any deficit deal. &quot;It has nothing to do with the fiscal policy,&quot; Grijalva says. &quot;It has to do with ideological positions on social programs and domestic programs and how you dismantle and get rid of them. I think the American people see the smoke and mirrors.&quot;\n\n\n- A Debate on Human Rights Watch's Call For Bush Administration Officials Be Tried For Torture\n\nHuman Rights Watch has released a new report calling on the U.S. government to launch a broad criminal investigation into alleged crimes of torture committed by former President George W. Bush and other top officials under his administration. It comes on the heels of a Department of Justice investigation into alleged torture, abuse and murder during the interrogation of detainees in CIA custody. Earlier this month, the DOJ announced it would launch a full criminal investigation into the deaths of just two prisoners out of 101 cases under review, including one who died at the Abu Ghraib prison in Iraq. We speak to Kenneth Roth, executive director of Human Rights Watch, and to John Baker, professor emeritus at Louisiana State University Law School.\n\n\n- Clinton Foundation Accused of Sending Haiti Shoddy Trailers Found Toxic After Katrina\n\nA new exposÃƒÂ© in The Nation magazine reveals that trailers the Clinton Foundation donated to post- earthquake Haiti to use as temporary classrooms - and to double as hurricane shelters - are plagued by mold, shoddy construction. In at least one case, an air quality test revealed worrying levels of formeldahyde. The trailers were built by the same company that is being sued in the United States for providing formeldahyde-laced trailers to displaced residents after Hurricane Katrina. We speak with the journalists who broke this story, Isabel Macdonald and Isabeau Doucet. &quot;What does it say about the reconstruction efforts in Haiti if the very first project approved by the commission that is supposed to ensure accountability and transparency in Haiti's rebuilding passes this kind of project and Bill Clinton himself has his hands all over it?,&quot; says Macdonald. &quot;He is the co-chair of this commission that is supposed to ensure Haiti is built back better.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:206a8bb48996a11490ab2e54870c376657169696","amp;dn":"Democracy+Now+-+12+jul+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"206a8bb48996a11490ab2e54870c376657169696","infoHashBuffer":{"type":"Buffer","data":[32,106,139,180,137,150,161,20,144,171,46,84,135,12,55,102,87,22,150,150]},"announce":[],"urlList":[]}}