{"title":"Outsiders.Japan.Drift.BRRIP.1080p.mov","uid":7212609,"size":1912963473,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:21b0fe4b4e02a8503d414341cd8f14ef9d136a5a&amp;dn=Outsiders.Japan.Drift.BRRIP.1080p.mov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"r1nger","files":-1,"time":1335289926,"description":"Wicked film from the Driftworks guys.\n\nA unique professionally filmed feature length documentary following four drivers exploring the Japanese drift scene from the streets to the mountains to the tracks and everywhere in between..\n\n\nA little bit about Outsiders:\n\nPhil Morrison and Matt Steele head to the Land of the Rising Sun with James Robinson and Pieter Gouwy to experience a mind blowing fortnight of the origin of the motorsport of Drifting.\n\nMore than 20 years ago in the hills of Japan, the rules of driving began to be re-written. Over this time to the present, Japan has always been at the forefront of drifting. From the streets in the cities to the Touge passes in the mountains to the dedicated drifting circuits, one thing never changes - Drifting is fun. It is the reason every driver we met does it. Not for the fame or the glory, not for money, not for corporate support, but just pure thrills. See the guys visiting the whole of the south prefecture of Japan including Bihoku, Suzuka Twin and Meihan, plus the crazy city of Nagoya and the surrounding areas and much much more. We capture one of the most insane nights of street drifting for the first time using professional equipment at night. We visit some of the biggest (and smallest) shops in the business including Bee*R, Mind Control, Kids Heart, 326 Power and V-Factory. We hang out with D1 legends and current drivers and discuss how the sport is changing with the separation of D1 and Drift Muscle. We talk about the way the cars are setup and we get a very rare look at the underside and technical details behind some of the most famous drift cars in the world. Let's not forget the road trips, the food, running from the police, the karaoke, the highs and the lows.\n\nIf you like this film, support them by grabbing the real deal from Driftworks.com :)","torrent":{"xt":"urn:btih:21b0fe4b4e02a8503d414341cd8f14ef9d136a5a","amp;dn":"Outsiders.Japan.Drift.BRRIP.1080p.mov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21b0fe4b4e02a8503d414341cd8f14ef9d136a5a","infoHashBuffer":{"type":"Buffer","data":[33,176,254,75,78,2,168,80,61,65,67,65,205,143,20,239,157,19,106,90]},"announce":[],"urlList":[]}}