{"title":"Cyber Update Jun.2012---DB-23625 Alani Pi and Coral Aorta WMV","uid":7395689,"size":769804144,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:222dfd84bac0b945727cb9e51df46ab71effef64&amp;dn=Cyber+Update+Jun.2012---DB-23625+Alani+Pi+and+Coral+Aorta+WMV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1340909531,"description":"Alani Pi - Head Shaved Slut Live Show - Part 1\n\nJun 19, 2012 - Performers: Alani Pi and Coral Aorta \n\nWMV + Pics\n\nAlani Pi is no ordinary model. Her cute demeanor is disarming compared to the deep and perverted girl on the interior. For her live show, she consented and even requested a head shaving. Its very unusual to get such a request. A model makes a lot of money based off of appearance, and no hair is a very extreme thing for a hot cunt like Alani to take on.\n\nWasting no time, Alani is installed in metal stocks with her wrists trapped in leather cuffs and metal and her neck wrapped in metal. The stocks are deliberately a little high, making her chin pitch slightly upward and her legs splayed open by cuffs and straps. The idea is to make the process uncomfortable and already she is fidgeting nervously in her restraints.\n\nThe electric monster clippers click on in an excited whirring frenzy. She looks calm but if you study her closely, she is trembling. Barely able to make eye contact and furtive sideways glances through her long lashes, she might be reconsidering... Claire however is very committed and starts shaving only half her head so we can see the stark comparison of shaved and not from our soon to be bald Alani. \n\nPatiently and slowly, her hair disappears and with it all ability to identify with who she previously was. Now she is just a shell... a vessel... one that we intend to fill to the brim with pain and pleasure; shaping, forming, and manipulating.\n\nscreens  &lt;a href=&quot;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=23625&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.devicebondage.com/site/shoot.jsp?shootId=23625&lt;/a&gt;\n\nAnd if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :) \n\nCheers  :-)\n\t\t\n","torrent":{"xt":"urn:btih:222dfd84bac0b945727cb9e51df46ab71effef64","amp;dn":"Cyber+Update+Jun.2012---DB-23625+Alani+Pi+and+Coral+Aorta+WMV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"222dfd84bac0b945727cb9e51df46ab71effef64","infoHashBuffer":{"type":"Buffer","data":[34,45,253,132,186,192,185,69,114,124,185,229,29,244,106,183,30,255,239,100]},"announce":[],"urlList":[]}}