{"title":"City of Pillars","uid":7282122,"size":839147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24f150b81c5e91f0e014259de1f36a3da3cc9587&amp;dn=City+of+Pillars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"superluminal23","files":-1,"time":1337464257,"description":"City of Pillars is a sort of conspiracy-laden adventure novel. It's a cautionary tale of obsession and the Men in Black. It's a cross between Fight Club and DaVinci Code, or maybe it's like if Cormac McCarthy tried to write an episode of the X-Files. It also came out before DaVinci Code so suck it Dan Brown. Some people also think that it's got a bit of a Lovecraft/Cthuthlu vibe to it, but any connection to the Elder Gods is very minor at best. Here's what the publisher says about it:\n\n\nMen in Black...\nAn Ancient Manuscript...\nA City that Isn't Supposed to Exist...\nNo matter how paranoid you are, you're not paranoid enough!\n\nAn innocent man accidentally comes into possession of an ancient text. Soon he is being chased to the ends of the earth, pursued by shadowy forces who seem intent on getting the book back and eliminating all evidence of it. As he attempts to stay alive and translate the mysterious document he uncovers horrific and ominous details of an ancient, worldwide conspiracy. But the question is, can he find the answers he seeks before he loses everything?\n\nCity of Pillars charts one man's journey into madness, past the narrow confines of Western notions of reason and scientific reality. As he decodes more and more of the secrets of the City of Pillars, Sinclair is pushed farther and farther outside the bounds of traditional society and is forced to discard his morality piece by piece to stay alive. He is forced to answer the question: How far am I willing to go to uncover the truth?","torrent":{"xt":"urn:btih:24f150b81c5e91f0e014259de1f36a3da3cc9587","amp;dn":"City+of+Pillars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24f150b81c5e91f0e014259de1f36a3da3cc9587","infoHashBuffer":{"type":"Buffer","data":[36,241,80,184,28,94,145,240,224,20,37,157,225,243,106,61,163,204,149,135]},"announce":[],"urlList":[]}}