{"title":"Half Life 2 [Original]","uid":6667737,"size":2002027116,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:254b5d7c8b9b308334229cc3d66a5aeb3f232296&amp;dn=Half+Life+2+%5BOriginal%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Manosgs98","files":-1,"time":1315755507,"description":"                              HALF LIFE 2 - PC GAME\n\n                                      SYSTEM :\n\nMinimum System Configuration\n1.2 GHz Processor \n256MB RAM \nDirectX 7 capable graphics card (64 MB or higher)\nWindows 2000/XP/ME/98 \nMouse \nKeyboard \nInternet Connection \nCD or DVD rom drive \n\nPreferred System Configuration\n2.4 GHz Processor \n512MB RAM \nDirectX 9 capable graphics card \nWindows 2000/XP/ME/98 \nMouse \nKeyboard \nInternet Connection\n-------------------------------------------------------------------------------------\nGAMESPOT RATING: 9.2\n\n\n                       Some information for this game\n\nHalf-Life 2, like its predecessor Half-Life, is a singleplayer first-person shooter broken into chapters, and permanently casts the player as Gordon Freeman. The sequel has nearly the same mechanics as Half-Life, duplicating its health and weapon systems for combat and including periodic puzzles. The player also starts without items, and slowly builds up an arsenal over the course of the game. A similar diverse set of enemies are present with different tactics; some coordinate in groups, some fly, some use predictable but powerful attacks, some are armed, some utilize melee and/or swift movement, and some rely on lurking and/or obscurity. Gordon can still kill enemies directly with his weapons, or indirectly using environmental hazards such as explosive barrels and gas fires.\nThe game's original features utilize its detailed physics simulation. Two sections of the game are played by driving vehicles. New environmental puzzles are also introduced through makeshift mechanical systems. Unlike the scripted, button-based puzzles of Half-Life, these revolve around the player's intuitive new ability to pick up, move, and place objects. Solutions involve objects' physical properties, such as shape, weight, and buoyancy. For example, the player is asked in the first chapter to stack up crates and barrels, and climb on them to escape through a high window. Part-way through the game, Gordon acquires the gravity gun, which allows him to push large objects and to grab smaller objects from a distance and fling them away at high speeds. These abilities are required to solve some puzzles, and can also be used in combat.\nThe game does not have cutscenes, and no formal explanation of the story is given. Instead, the player is left to piece together the hints and clues in each chapter. Much of the overarching story that links with Half-Life can be understood through the interactive non-combat scenes with the game's major characters. The facial animation system allows these characters to have realistic expressive interactions with each other.\n\nPlease Seed This Torrent!\nThanks!","torrent":{"xt":"urn:btih:254b5d7c8b9b308334229cc3d66a5aeb3f232296","amp;dn":"Half+Life+2+%5BOriginal%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"254b5d7c8b9b308334229cc3d66a5aeb3f232296","infoHashBuffer":{"type":"Buffer","data":[37,75,93,124,139,155,48,131,52,34,156,195,214,106,90,235,63,35,34,150]},"announce":[],"urlList":[]}}