{"title":"Naomi and the Horse-Flavored T-Shirt by Dan Boehl","uid":7276850,"size":108010175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2619b4079e1e2c6772ea92f178540551c20040bc&amp;dn=Naomi+and+the+Horse-Flavored+T-Shirt+by+Dan+Boehl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1337309057,"description":"Ebook formats: mobi, epub, pdf, zip, jpg, mp4.\n\nNaomi and the Horse-Flavored T-Shirt by Dan Boehl.\n\nA mix of Charlie and the Chocolate Factory by way of 1984 with some Hunger Games mixed in, Naomi and the Horse-Flavored T-Shirt is a science fiction novel for middle school readers set in a future without gasoline that follows fourteen-year-old Naomi, who, along with her farmer friend, Sammy, searches the paste factory for her father and the town's missing horses.\n\nEndless Ranches is a town like any other town in Texas. Everybody works for the paste company, eats paste for breakpaste, plunch, and dinner, and walks to work. But things were different before the factory came to town and all of the horses disappeared.\n\nFourteen-year-old Naomi knows something is not right, but nobody talks about it. Naomi's mom changes the subject when Naomi asks about her missing father and one of her teachers disappears after he tells the class about the town's past. But on her birthday, Naomi's mother gives her an amazing gift that unlocks the truth about Endless Ranches: her father's horse-flavored T-shirt. Accompanied by Sammy, a teenaged farmer forced to steal paste so he can feed his brothers and sisters, Naomi uncovers a devious Paste Company plot to subdue the townspeople and raise an army of mindless white people.","torrent":{"xt":"urn:btih:2619b4079e1e2c6772ea92f178540551c20040bc","amp;dn":"Naomi+and+the+Horse-Flavored+T-Shirt+by+Dan+Boehl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2619b4079e1e2c6772ea92f178540551c20040bc","infoHashBuffer":{"type":"Buffer","data":[38,25,180,7,158,30,44,103,114,234,146,241,120,84,5,81,194,0,64,188]},"announce":[],"urlList":[]}}