{"title":"The Tree of Life (2011) [VHS-Screener][DUAL][Eng-Spa]","uid":6684350,"size":1600348160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26e75c54a4999b4dac78dde01a8d2d0353eee7f6&amp;dn=The+Tree+of+Life+%282011%29+%5BVHS-Screener%5D%5BDUAL%5D%5BEng-Spa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1316346964,"description":"El ÃƒÂ¡rbol de la vida (2011) [VHS-Screener][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0478304/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0478304/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.tripictures-spain.com/thetreeoflife/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tripictures-spain.com/thetreeoflife/&lt;/a&gt;\n\n--------\nEnglish:\n--------\nVideo Quality: VHS-believe \nAudio Quality: English Mp3 / MP3 128Kbits (MIC) (Castilian) \n\n\nTitle: The Tree of Life \nOriginal title: The Tree of Life \nCountry: USA \nUSA release: 27/05/2011 \nReleased in Spain: 16/09/2011 \nStudio: Fox Searchlight Pictures \nDirector: Terrence Malick \nScreenplay: Terrence Malick \nStarring: Brad Pitt, Sean Penn, Jessica Chastain, Fiona Shaw, Crystal Mantecon, Joanna Going, Jackson Hurst, Dalip Singh, Kimberly Whalen, Kari Matchett, Brenna Roth, Jennifer Sipes, Zach Irsik, Brayden Whisenhunt, Danielle Rene, Tamara Jolaine, Hunter McCracken \nRating: Suitable for all audiences \n\n\nSynopsis: \nStory of three brothers during the 50's and how the greatest of them live the loss of innocence. \n\nWe see the development of a child, Jack, 11, of the Midwest. At first everything is wonderful in his eyes, but their parents get two very different images of the world, while his mother is the ways of love and compassion, her father tries to teach him how hard life, to survive and overcome. Both will fight for your attention and Jack must combine the two teachings. Everything begins to change when first experienced the disease, suffering and death. The world, until then clean and bright, it becomes dark and frustrating. \n\nThis story combines with the adult Jack, a lost soul in a modern world that will try to find among the scenes of his childhood that which remains unchanged, the eternal plan of which we all belong. When you discover all that has eluded him for the way you learn to value things that are to come. Jack, with a new vision of the world is well able to forgive her father for the first time to their steps through life. \n\nProduction notes: \n- Winner of the Palme d'Or at the 64th Cannes Film Festival 2011\n\n\n\n--------\nEspaÃƒÂ±ol:\n--------\nCalidad de Video: VHS-creener \nCalidad de Audio: InglÃƒÂ©s Mp3 / MP3 128Kbits (MIC) (Castellano)\n\n\nTÃƒÂ­tulo: El ÃƒÂ¡rbol de la vida\nTÃƒÂ­tulo original: The Tree of Life\nPaÃƒÂ­s: USA \nEstreno en USA: 27/05/2011 \nEstreno en EspaÃƒÂ±a: 16/09/2011 \nProductora: Fox Searchlight Pictures \nDirector: Terrence Malick \nGuiÃƒÂ³n: Terrence Malick \nReparto: Brad Pitt, Sean Penn, Jessica Chastain, Fiona Shaw, Crystal Mantecon, Joanna Going, Jackson Hurst, Dalip Singh, Kimberly Whalen, Kari Matchett, Brenna Roth, Jennifer Sipes, Zach Irsik, Brayden Whisenhunt, Danielle Rene, Tamara Jolaine, Hunter McCracken\nCalificaciÃƒÂ³n: Apta para todos los pÃƒÂºblicos\n\n\nSinopsis:\nHistoria de tres hermanos durante los aÃƒÂ±os 50 y de cÃƒÂ³mo el mayor de ellos vive la pÃƒÂ©rdida de la inocencia. \n\nVemos la evoluciÃƒÂ³n de un niÃƒÂ±o, Jack, de 11 aÃƒÂ±os, del Medio Oeste. Al principio todo es maravilloso a sus ojos, pero obtiene de sus padres dos imÃƒÂ¡genes muy distintas del mundo: mientras su madre representa los caminos del amor y la compasiÃƒÂ³n, su padre intenta enseÃƒÂ±arle lo duro de la vida, a sobrevivir y a superarse. Ambos lucharÃƒÂ¡n por su atenciÃƒÂ³n y Jack debe combinar ambas enseÃƒÂ±anzas. Todo empieza a cambiar cuando experimenta por primera vez la enfermedad, el sufrimiento y la muerte. El mundo, hasta entonces limpio y luminoso, se convierte en oscuro y frustrante. \n\nEsta historia se compagina con la de Jack adulto, un alma perdida en un mundo moderno, que tratarÃƒÂ¡ de encontrar entre las escenas de su infancia aquello que permanece inalterado, el plan eterno del que todos formamos parte. Cuando descubre todo lo que se le ha escapado por el camino aprenderÃƒÂ¡ a valorar mÃƒÂ¡s las cosas que le quedan por venir. Jack, con una nueva visiÃƒÂ³n del mundo, es capaz asÃƒÂ­ de perdonar a su padre y dar por vez primera sus propios pasos por la vida. \n\nNotas de producciÃƒÂ³n:\n- Ganadora de La Palma de Oro en el 64Ã‚Âº Festival de Cannes 2011\n","torrent":{"xt":"urn:btih:26e75c54a4999b4dac78dde01a8d2d0353eee7f6","amp;dn":"The+Tree+of+Life+%282011%29+%5BVHS-Screener%5D%5BDUAL%5D%5BEng-Spa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26e75c54a4999b4dac78dde01a8d2d0353eee7f6","infoHashBuffer":{"type":"Buffer","data":[38,231,92,84,164,153,155,77,172,120,221,224,26,141,45,3,83,238,231,246]},"announce":[],"urlList":[]}}