{"title":"King's Bounty: The Legend","uid":7265093,"size":3299626628,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:295f8e7dcb22d5c2e7bab71e28500ac5d6079b2e&amp;dn=King%27s+Bounty%3A+The+Legend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WinterGale","files":1,"time":1336858050,"description":"Gameplay is divided into two major sections: adventure mode and battle mode. While playing in adventure mode the gamer controls their character in real-time. With several classes available at the start of a new game, the player moves through the adventure map seeking various treasures, fighting monsters and accomplishing quests tasked to him by the local stewards. Once in battle mode the gamer assumes the role of a war chief, leading his troops in tactical turn-based combat. Battles take place on land or sea, in dungeons or castles or even in some items! The hero himself doesn't participate in the combat, but can assist his troops by casting spells or summoning different creatures.\n\nFeatures:\n- Classic real-time (adventure) meets turn-based (battles) gameplay \n- Rich fantasy setting, storyline with a lot of twists and an unexpected ending \n- Three types of characters to choose from - Warrior, Paladin and Mage. Each of them with unique characteristics and abilities \n- Huge game world with dozens locations and battlefields -- both on the surface and in the dungeons \n- The game world isn't static - enemies don't just sit and wait for the hero to arrive, they pursue their own aims and try to get into the player's way \n\nMinimal system requirements:\n- Mac OS X v10.6.8 or later\n- 2GB of RAM\n- Intel Core 2 Duo 2.0 GHz or faster \n- NVIDIA or ATI video card with min. 256 Mb RAM \n- 5.8GB free hard-drive space \n- Macintosh mouse and keyboard \n- It is recommended to use a two-button mouse to run this game","torrent":{"xt":"urn:btih:295f8e7dcb22d5c2e7bab71e28500ac5d6079b2e","amp;dn":"King%27s+Bounty%3A+The+Legend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"295f8e7dcb22d5c2e7bab71e28500ac5d6079b2e","infoHashBuffer":{"type":"Buffer","data":[41,95,142,125,203,34,213,194,231,186,183,30,40,80,10,197,214,7,155,46]},"announce":[],"urlList":[]}}