{"title":"Elvis the story (Nordic subs)","uid":7281676,"size":1270198088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:295f8117d252570fd1b6dfb47c5af0a3fba5ca27&amp;dn=Elvis+the+story+%28Nordic+subs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"slurpy97","files":-1,"time":1337450603,"description":"Movie with Kurt Russel.\n\n\nWell it's one for the money (John Carpenter), two for the show (Kurt Russell), three to get ready (Ronnie McDowell's uncanny vocals), now go, cat, go! This legendary and elusive 1979 made-for-TV feature was the first Elvis biopic, and it remains the best. Presented for the first time on DVD complete and uncut (thankyouverymuch), Elvis was produced less than two years after Presley's death. The script hits all the career milestones. It treads lightly on Elvis's dark side (his disdain for his film career, his penchant for shooting out television sets), but don't look here for dirt, scandal, or sordid details of his bloated final years. This is a sincere and sympathetic treatment of the King's life, framed by his apprehension over his upcoming do-or-die 1969 Las Vegas concert. Elvis marked the first collaboration between Carpenter and Russell. From sneer to sideburns, the former Disney child star is a revelation in his Emmy-nominated performance. He is ably supported by Shelley Winters as Elvis's beloved mother, Bing Russell (Kurt's dad) as father Vernon, Pat Hingle as Colonel Tom Parker, and Season Hubley as Priscilla. Look for Joe Mantegna in one of his earliest roles as Joe Esposito, a member of Elvis's infamous entourage, the Memphis Mafia. This DVD rocks with a hunka hunka extra features, including an archival featurette about the production of the film, audio commentary by McDowell (who recorded all of the film's songs in one day), and Elvis-less tribute clips from American Bandstand. Well worth the wait, Elvis is highly recommended for fans who will ever love him tender.\n\n\n\nGreetings Realuploads","torrent":{"xt":"urn:btih:295f8117d252570fd1b6dfb47c5af0a3fba5ca27","amp;dn":"Elvis+the+story+%28Nordic+subs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"295f8117d252570fd1b6dfb47c5af0a3fba5ca27","infoHashBuffer":{"type":"Buffer","data":[41,95,129,23,210,82,87,15,209,182,223,180,124,90,240,163,251,165,202,39]},"announce":[],"urlList":[]}}