{"title":"Veena Das Essay Collection","uid":7296802,"size":20578880,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2a1a2ea61e0b82560b10c5bb1e620d1ec4beef7e&amp;dn=Veena+Das+Essay+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iradins","files":1,"time":1337906068,"description":"A collection of essays written by Veena Das. \n\nVeena Das is Krieger-Eisenhower Professor of Anthropology at the Johns Hopkins University. She also serves on the Executive Board of the Institute of Socio-Economic Research on Development and Democracy in India. She studied at the Indraprastha College for Women and Delhi School of Economics at the University of Delhi and taught there from 1967 to 2000. She has published extensively as an ethnographer of India and thus is an established figure within Indian anthropology. Beyond India, her research has broad appeal within the anthropology of violence, suffering, and the State.\n\nEssays:\nDas - Anthropological Knowledge and Collective Violence - The Riots in Delhi, November 1984\nDas - Christianity and World Religions - A Response\nDas - Commentary - Trauma and Testimony - Between Law and Discipline\nDas - Dislocation and Rehabilitation - Defining a Field\nDas - For a Folk-Theology and Theological Anthropology of Islam\nDas - Human Rights and Changing Definitions of Warfare\nDas - Language and Body - Transactions in the Construction of Pain\nDas - Language of Sacrifice\nDas - Modernity and Biography - Women's Lives in Contemporary India\nDas - Official Narratives, Rumour, and the Social Production of Hate\nDas - Public Good, Ethics, and Everyday Life - Beyond the Boundaries of Bioethics\nDas - Sexual Violence, Discursive Formations and the State\nDas - Sociological Research in India - The State of Crisis\nDas - Specificities - Official Narratives, Rumour, and the Social Production of Hate\nDas - Sufferings, Theodicies, Disciplinary Practices, Appropriations\nDas - The Anthropology of Violence and the Speech of Victims\nDas - The Structure of Marriage Preferences - An Account from Pakistani Fiction\nDas - Time, Self, and Community - Features of the Sikh Militant Discourse\nDas - Trauma and Testimony - Implications for Political Community\nDas - Violence and Translation\nDas - Violence, Gender, and Subjectivity\nDas - Voices of Children\nDas - Wittgenstein and Anthropology\nDas and Addlakha - Disability and Domestic Citizenship - Voice, Gender, and the Making of the S\nDas and Cushman - A Conversation on Religion and Violence with Veena Das\nDas and Dasgupta - Scientific and Political Representations - Cholera Vaccine in India\nDas and Nandy - Violence, Victimhood, and the Language of Silence\nDas, Das and Coutinho - Disease Control and Immunisation - A Sociological Enquiry\n","torrent":{"xt":"urn:btih:2a1a2ea61e0b82560b10c5bb1e620d1ec4beef7e","amp;dn":"Veena+Das+Essay+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a1a2ea61e0b82560b10c5bb1e620d1ec4beef7e","infoHashBuffer":{"type":"Buffer","data":[42,26,46,166,30,11,130,86,11,16,197,187,30,98,13,30,196,190,239,126]},"announce":[],"urlList":[]}}