{"title":"Castle 2011 -2012 Season 4 Complete","uid":7295925,"size":7807216047,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d82cb90a1777d2dbe56854456b1334970db43ff&amp;dn=Castle+2011+-2012+Season+4+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"76koumparos","files":49,"time":1337883737,"description":"Storyline\n*********\n\nAfter a serial killer imitates the plots of his novels, successful mystery novelist Richard &quot;Rick&quot; Castle gets permission from the Mayor of New York City to tag along with an NYPD homicide investigation team for research purposes. A &quot;guy's guy&quot;, he proves popular with the male team members, but immediately offends the sensibilities of the team leader, Detective Kate Beckett. Though she'll never admit it, he slowly wins her over with his innovative approach to crime solving. He brings to the table skills the others don't have: contacts in Manhattan high society, free-form creative thinking, and years of developing believable fictional characters that have inadvertently molded him into a natural criminal profiler. But life is not all crime fighting adventure for this wealthy playboy: his relationship with Beckett becomes even more strained when he unveils a new series of detective novels featuring a racy character based on her...\n\nThis season start like this\n***************************\n\nCastle is grieved when Becket, once regaining health, tells him to leave her time without calling for months. Yet when she returns to work after therapy, Ryan and Esposito tell Castle help them keep the case of her mothers killers going, behind ex-IA by-the-book-Captain Victoria Gates's back. They work out the only remaining angle are bank files lost in a fire, according to decorated officer Rod Halstead definitely no arson. Becket grudgingly passes her gun exam, but can't perform in real danger anymore in their assigned case, the ingeniously staged murder of a rock ...\n\n\n\nDedails\n********\n\nGenres:Comedy | Crime | Drama | Mystery \nCreator:Andrew W. Marlowe\nStars:Nathan Fillion, Stana Katic and Susan Sullivan \nCountry:USA\nLanguage:English\nRelease Date:2009 (USA)\nRuntime:USA: 43 min per episode\n23 episode alltogether to complete this season\n\n\n\n","torrent":{"xt":"urn:btih:2d82cb90a1777d2dbe56854456b1334970db43ff","amp;dn":"Castle+2011+-2012+Season+4+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d82cb90a1777d2dbe56854456b1334970db43ff","infoHashBuffer":{"type":"Buffer","data":[45,130,203,144,161,119,125,45,190,86,133,68,86,177,51,73,112,219,67,255]},"announce":[],"urlList":[]}}