{"title":"Cannabis Collection - The Union  - The Business Behind Getting H","uid":7320432,"size":2887159808,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:364210178bf35843d442ca6820a00ebe25a161c9&amp;dn=Cannabis+Collection+-+The+Union++-+The+Business+Behind+Getting+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GRNS3","files":-1,"time":1338604095,"description":"\nThe Cannabis Collection - a series of educative and entertaining info dvd's\nPlease enjoy, share with friends and seed :)\n\nThe Union: The Business Behind Getting High is a 2007 documentary film by Canadian filmmaker Brett Harvey.\n\nThe film explores the illegal growth, sale and trafficking of marijuana. Its theatrical run was limited to film festivals. The film follows host Adam Scorgie as he examines the underground market, interviewing growers, police officers, criminologists, psychologists, economists, doctors, politicians and pop culture icons, revealing how the trade is booming despite being a criminal enterprise. The history of marijuana and the reasons for its present prohibition are discussed, often comparing it to the prohibition of alcohol in the United States in the 1920s, suggesting that gang drug warfare and other negative aspects associated with marijuana are a result of prohibition, not the drug itself. The gangs that grow and traffic the drugs are likened to those that appeared in major U.S. cities during Prohibition, with the intention of profiting from the sale of illegal alcohol. The film answers many questions about marijuana, including the purported health effects of marijuana use, the Gateway drug theory, and what could happen if marijuana was legalized. The film also discusses the medicinal value of the marijuana plant and what the pharmaceutical industry stands to lose from marijuana legalization.\n\nCheck this account for update regularly :)","torrent":{"xt":"urn:btih:364210178bf35843d442ca6820a00ebe25a161c9","amp;dn":"Cannabis+Collection+-+The+Union++-+The+Business+Behind+Getting+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"364210178bf35843d442ca6820a00ebe25a161c9","infoHashBuffer":{"type":"Buffer","data":[54,66,16,23,139,243,88,67,212,66,202,104,32,160,14,190,37,161,97,201]},"announce":[],"urlList":[]}}