{"title":"FreeSpace 2 Open 3.6.14 RC6","uid":7266614,"size":1753214043,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:36803276907122a5a8266431509b64b726765ef4&amp;dn=FreeSpace+2+Open+3.6.14+RC6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hclivess","files":2,"time":1336916597,"description":"Details: This is a handmade installer of a full modded client for FreeSpace 2 and it does not get any better than that. At the moment, if you want to mod your client, you have to do everything manually. In this package, everything has been done for you. Furthermore, you do not need to have FreeSpace 2 already installed. This is a FULL release, not a patch. What you get is improved lightning, textures, models, sounds, music and screen resolution. An uninstaller is packed too and so is the official manual, reference card, readme file. Note that this has been built off the GOG version of the game. Good luck and god speed!\n &lt;a href=&quot;\nhttp://img20.imageshack.us/img20/2466/screen0027.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img20.imageshack.us/img20/2466/screen0027.jpg&lt;/a&gt;\n\n-------------------------------------------------------------------------------------\n\nThe year is 2367, thirty two years after the Great War. Or at least what YOU thought was the Great War. The seemingly endless tide of Shivan capital ships, bombers and fighters with super advanced technology was nearly overwhelming.\n\nAs the Terran and Vasudan races finish rebuilding their decimated societies, a disturbance lurks in the not-so-far reaches of the Gamma Draconis system. Your nemesis has arrived... and they are wondering what happened to their scouting party...\n\nThe game continues on the story from Descent: FreeSpace, once again thrusting the player into the role of a pilot fighting against the mysterious aliens, the Shivans. While defending the human race and its alien Vasudan allies, the player also gets involved in putting down a rebellion of those elements of Vasudan (Hammer of Light) and Human (Neo Terran Front) forces which don't want to cooperate with one another. ","torrent":{"xt":"urn:btih:36803276907122a5a8266431509b64b726765ef4","amp;dn":"FreeSpace+2+Open+3.6.14+RC6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36803276907122a5a8266431509b64b726765ef4","infoHashBuffer":{"type":"Buffer","data":[54,128,50,118,144,113,34,165,168,38,100,49,80,155,100,183,38,118,94,244]},"announce":[],"urlList":[]}}