{"title":"Wareya - Into the Dark (FLAC)","uid":6541007,"size":91852210,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:36b23600058765e97407dfa75ea708cd9fa08a03&amp;dn=Wareya+-+Into+the+Dark+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AidanV","files":16,"time":1310688813,"description":"&quot;Go ahead and upload it, it's not like anyone's going to buy it anyways&quot; - Wareya, artist of the album\n\nthis copy was downloaded right from the bandcamp site &lt;a href=&quot;\nhttp://wareya.bandcamp.com/album/into-the-dark&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wareya.bandcamp.com/album/into-the-dark&lt;/a&gt;\n&quot;In White&quot; previously appeared on a Futures Passed album so it is downloadable there for free\n&quot;Megaroide&quot; is directly inspired by another song so it's also downloadable there for free\napparently\nI highly recommend you buy this album, it's really cheap and very unique\n\nThe author is very clearly to me a genius and is desolate and poor, you should definitely support him and buy the album, especially since it costs of an elementary school kid's lunch money\n\nso as far as the story goes, i'm going to make a lot of assumptions here\nthe author said it was a concept album about heroism, and had a story, so I'm going to assume there's a main character\nnow just from the flow of the album I can tell that it's all from the protagonist's point of view\n\nThe introduction shows off a couple of the things that keep showing up in the album's composition: melodies with genius usage of tension, arpeggios with harmonics not in that chord, and impossible chord progressions that pull through by abusing dissonance. i could also assume that it makes an emotional base for the beginning of the next song, where i assume something bad happened to the main character\nLight in the Dark is, by its name, about hope in desperation\nHerever is a chord progression with no melody or anything, as an arpeggio. it's just uplifting so that means they got out of whatever was bad for them, we can assume that they have some connection to something because the name is a portamenteau of &quot;here&quot; and &quot;ever&quot;\nOutside is very happy and has segments where the treble and melody/bass split apart in how it feels so that the bass and melody feel relieved and serene where the treble feels high and eurphoric\nIn White is a christmas song, and at one point the author had lyrics (though it's an instrumental song, so they must have just been there for completion's sake) in the description for it on his soundcloud, which said &quot;Between these golden arches, I see need, in white&quot; which gave the song both its name and its concept - it's about helping something needy\nLights of Time is very slow and solemn, and has the melody that  shows up later in Come Back Alive, which makes me think that the song is about getting the power to do something heroic\nDuty is self-explanatory\nCome Back Alive is ridiculous. Wareya called it &quot;the herocore anthem&quot;, and that herocore was a joke genre made to mock certain kinds of fake chiptunes. the song is extremely heroic and extremely trancey, the most repetitive thing on the entire album, in a good way\nRealization progresses from a small bit of an almost metallic intro into something I could almost call &quot;8-bit screamo&quot; though it of course isn't because this isn't a real chipmusic album and because there's no voice. it's obviously extremely tense and stressed, so that with the title makes it very fitting where it is\nSubmerge myself has a chord progression on an octatonic scale, and it is such a sad song. Basically I take it as the main character realizing they have to end something about themselves to do what's right\nMegaroide is &quot;a song about personal identity&quot;, to quote wareya\nThe Death of Phamson E. Chord is described by its title\nLullaby feels very peaceful and &quot;the bad isn't really bad&quot;-like. a fitting end for a heroic death of one kind or another.\n\nso the protagonist ended themselves to do save what they lived for or identified with, basically\n\nthe entire album was composed in a tool called Musagi: http://www.drpetter.se/project_musagi.html","torrent":{"xt":"urn:btih:36b23600058765e97407dfa75ea708cd9fa08a03","amp;dn":"Wareya+-+Into+the+Dark+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36b23600058765e97407dfa75ea708cd9fa08a03","infoHashBuffer":{"type":"Buffer","data":[54,178,54,0,5,135,101,233,116,7,223,167,94,167,8,205,159,160,138,3]},"announce":[],"urlList":[]}}