{"title":"Windows XP SP3","uid":7269805,"size":618066036,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3a13fdfff8ff853010574c2409a5f53e2f8196fb&amp;dn=Windows+XP+SP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"andrey250","files":2,"time":1337015655,"description":"Windows XP is an operating system produced by Microsoft for use on personal computers, including home and business desktops, laptops and media centers. First released to computer manufacturers on August 24, 2001, it is the second most popular version of Windows, based on installed user base. The name &quot;XP&quot; is short for &quot;eXPerience.&quot;\n\nWindows XP, the successor to Windows 2000 and Windows Me, was the first consumer-oriented operating system produced by Microsoft to be built on the Windows NT kernel. Windows XP was released worldwide for retail sale on October 25, 2001, and over 400 million copies were in use in January 2006.[7] It was succeeded by Windows Vista in January 2007. Direct OEM and retail sales of Windows XP ceased on June 30, 2008. Microsoft continued to sell Windows XP through their System Builders (smaller OEMs who sell assembled computers) program until January 31, 2009. On April 10, 2012, Microsoft reaffirmed that extended support for Windows XP and Office 2003 would end on April 8, 2014 and suggested that administrators begin preparing to migrate to a newer OS.\n\nThe NT-based versions of Windows, which are programmed in C, C++, and assembly,[13] are known for their improved stability and efficiency over the 9x versions of Microsoft Windows. Windows XP presented a significantly redesigned graphical user interface, a change Microsoft promoted as more user-friendly than previous versions of Windows. A new software management facility called Side-by-Side Assembly was introduced to ameliorate the &quot;DLL hell&quot; that plagued 9x versions of Windows. It is also the first version of Windows to use product activation to combat illegal copying.\n\nDuring development, the project was codenamed &quot;Whistler&quot;, after Whistler, British Columbia, as many Microsoft employees skied at the Whistler-Blackcomb ski resort.\n\nAccording to web analytics data generated by W3Schools, from September 2003 to July 2011, Windows XP was the most widely used operating system for accessing the w3schools website, which they claim is consistent with statistics from other websites. As of March 2012, Windows XP market share is at 28.9% after having peaked at 76.1% in January 2007.","torrent":{"xt":"urn:btih:3a13fdfff8ff853010574c2409a5f53e2f8196fb","amp;dn":"Windows+XP+SP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a13fdfff8ff853010574c2409a5f53e2f8196fb","infoHashBuffer":{"type":"Buffer","data":[58,19,253,255,248,255,133,48,16,87,76,36,9,165,245,62,47,129,150,251]},"announce":[],"urlList":[]}}