{"title":"[gg] Mahou Shoujo Madoka Magica","uid":6552504,"size":2499031042,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e65da271716b790ad121b72f38d0fad4c415f0d&amp;dn=%5Bgg%5D+Mahou+Shoujo+Madoka+Magica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"veen_deesel","files":12,"time":1311161358,"description":"There exist strange creatures who have the power to grant one wish to each chosen girl. However, in exchange, that girl must then become a Puella Magi, a girl with magical powers, and fight against witches, evil creatures born from darkness that are responsible for murders and suicides.\n\nIn the city of Mitakihara, a schoolgirl named Madoka Kaname and her friend Sayaka Miki are approached by a familiar named Kyubey, who offers to grant each of them one wish in return for making each of them a Puella Magi. Another Puella Magi named Homura Akemi tries to prevent Madoka from making such a deal, while Kyubey urges Madoka by telling her she will become the most powerful Puella Magi. However, contrary to glamorous notions of being a magical girl, a Puella Magi finds herself dealing with death, isolation, agony over the value of her wish, and existential crises. Madoka, following her friends, soon sees the darker side of being a Puella Magi, and because of knowing the truth about being a Puella Magi, she questions if she should become one as well.\n\nthis is the AVI re-encode from gg's subs. Enjoy!","torrent":{"xt":"urn:btih:3e65da271716b790ad121b72f38d0fad4c415f0d","amp;dn":"%5Bgg%5D+Mahou+Shoujo+Madoka+Magica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e65da271716b790ad121b72f38d0fad4c415f0d","infoHashBuffer":{"type":"Buffer","data":[62,101,218,39,23,22,183,144,173,18,27,114,243,141,15,173,76,65,95,13]},"announce":[],"urlList":[]}}