{"title":"Star.Wars.The.Bonus.Discs.1080p.BluRay-EbP","uid":6684124,"size":95929052545,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:40e007b317b78983ba9db5136c7e2b6e1f535eda&amp;dn=Star.Wars.The.Bonus.Discs.1080p.BluRay-EbP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TPBAgri","files":-1,"time":1316336057,"description":"Star Wars  Bonus Discs 1080p Blu-ray GER AVC DD 2.0-EbP\n\nBonus Disc 1: Prequel Features\n\nDeleted, extended and alternate scenes\nMaking of the equipment, models and costumes\nDrawings and conceptual art fans\nAdditional interviews with cast and crew with the crew\nTour of the Lucasfilm Archives\n\nBonus Disc 2: Original Trilogy Features\n\nDeleted, extended and alternate scenes\nMaking of the equipment, models and costumes\nDrawings and conceptual art\nAdditional interviews with cast and crew\n\nBonus Disc 3: The Star Wars Documentaries\n\nStar Wars (2007, 84 min.) - Some fans of Star Wars have decided to become heroes of their favorite movie! Five hundred and first Legion global organization of enthusiasts Star Wars Saga star moves through charity and volunteer work to raise funds and help with organizing special events around the world.\n\nA Conversation with the Masters: The Empire Strikes Back 30 Years Later (2010, 25 min.) - George Lucas, Irvin Kershner, Lawrence Kasdan and John Williams talk about the creation of Episode The Empire Strikes Back in a deep film retrospective, which was set up to 30th anniversary of the episode. The creators talk and reminisce about one of the most beloved movie saga.\n\nHoaxes Star Wars (2011, 91 min.) - Enjoy a fun collection of parodies and hoaxes on Star Wars, which were collected for many years! The collection consists of scandalous episodes of Family Guy, Simpsons, How I Met Your Mother and more.\n\nThe Making of Star Wars (1977, 49 min.) - Learn how to create original Star Wars trilogy. Included are interviews with George Lucas, and you'll see Mark Hamill, Harrison Ford and Carrie Fisher.\n\nThe Empire Strikes Back: Special Effects (1980, 48 min.) - This film will reveal the secrets of making films about the far, far away galaxy. Presenter Mark Hamill tells you about the amazing special effects that have translated the vision of George Lucas about how the film should look like in reality!\n\nClassic Creatures: Return of the Jedi (1983, 48 min.) - Go behind the scenes to learn how to create costumes. Stories about the shooting alternates with vintage clips of the monsters that have been used as a basis for further creation of the inhabitants of the classic Star Wars universe. Leading and storytellers - Carrie Fisher and Billy Dee Williams.\n\nRosospin Anatomy (1997, 26 min.) - Learn how some special effects of Star Wars has become even more special than two decades later! George Lucas will tell and show how his team has transformed the original rosospinnikov of fixed rubber dolls (in the original film in 1977) in an almost living, breathing creatures in the updated 1997 movie Star Wars Special Edition.\n\nStar Wars Tech (2007, 46 min.) - Explore the technical aspects of vehicles, weapons and technical equipment of Star Wars, along with leading scientists in the field of physics, prosthetics, lasers, engineering and astronomy. After seeing this film, you will understand exactly what the scientific axioms determine the plausibility of Star Wars.\n\n\nBonus Disc 1 : \n\nMPEG-4 AVC Video 12698 kbps 1080p / 23,976 fps / 16:9 / High Profile 4.1\nDD Audio 2 Ch 224 kbps\nSubs PGS : German Italian Japanese Spanish\n\n\nBonus Disc 2 : \n\nMPEG-4 AVC Video 8632 kbps 1080p / 23,976 fps / 16:9 / High Profile 4.1\nDD Audio 2 Ch 224 kbps\nSubs PGS : German Italian Japanese Spanish\n\nBonus Disc 3 : \n\nMPEG-4 AVC Video 19917 kbps 1080i / 29,976 fps / 16:9 / High Profile 4.1\nDD Audio 2 Ch 224 kbps\nSubs PGS : English Czech Danish Dutch Finnish French German Greek Hungarian Norwegian Polish Portuguese Spanish Swedish\n","torrent":{"xt":"urn:btih:40e007b317b78983ba9db5136c7e2b6e1f535eda","amp;dn":"Star.Wars.The.Bonus.Discs.1080p.BluRay-EbP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40e007b317b78983ba9db5136c7e2b6e1f535eda","infoHashBuffer":{"type":"Buffer","data":[64,224,7,179,23,183,137,131,186,157,181,19,108,126,43,110,31,83,94,218]},"announce":[],"urlList":[]}}