{"title":"Ps3 Rebug CFW","uid":7299581,"size":366340323,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:4154d5d88031e1796abf04cda26ef8b1f451c67c&amp;dn=Ps3+Rebug+CFW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ph0nixFury","files":4,"time":1337990380,"description":"Rebug CFW for ps3\n\nHow to install:\n\nCopy the contents of the OFW folder(not the folder itsself. folder structure for the files should be X:PS3UPDATEPS3UPDAT.PUP where X is your usb drive) to the root of a usb flash drive or portable hard drive with fat32 filesystem.\n\nConnect the usb drive with the update on it to the ps3.\n\nUpdate through the xmb menu(settings&gt;system update). when asked, select update via storage media.\n\nThe ps3 will copy the update contents to the ps3 then restart and install the update.\n\nAfter the ps3 Restarts again and you are at the xmb, overwrite the contents of the ofw on the usb drive with the contents of the rebug Folder and update via storage media again.\n\nafter the ps3 copies the contents of the update to the ps3, restarts and installs the update, it will restart one last time and you have the Rebug CFW!\n\nAlternate method: if you cannot access the xmb(red screen) you can still install an update to restore your ps3.\n\nMake sure the ps3 is off\n\nPress and hold the power button, it will beep a few times(2 times once then 2 quick beeps) then turn back off.\n\npress and hold the power button again until you hear 3 beeps and you will be presented with the recovery menu, you may install the update from here if you need.\n\nThis torrent Was uploaded by RavenAngelus. If you make use of it, you should seed to others(at least 300%).\n\n","torrent":{"xt":"urn:btih:4154d5d88031e1796abf04cda26ef8b1f451c67c","amp;dn":"Ps3+Rebug+CFW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4154d5d88031e1796abf04cda26ef8b1f451c67c","infoHashBuffer":{"type":"Buffer","data":[65,84,213,216,128,49,225,121,106,191,4,205,162,110,248,177,244,81,198,124]},"announce":[],"urlList":[]}}