{"title":"Speaking For The Dead, 2nd Edition{BBS}","uid":6678845,"size":3036963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:427048b04eeac377e59ef8415ebc1cb38acd20ee&amp;dn=Speaking+For+The+Dead%2C+2nd+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316123308,"description":"&quot;Speaking for the Dead&quot; is an incisive examination of the highly topical and often controversial issues surrounding the use of human cadavers in scientific research. This new edition has been fully revised and updated to take account of recent developments in this area. These include the repeated organ scandals in the UK, body parts scandals in the United States, and the abuses of bodies in China. Plastination in the form of BodyWorlds types of exhibitions is also discussed. The book also provides new material on neuroimaging, neuroethics and Alzheimer's disease and the major ethical issues they raise for society.The on-going discussion on embryonic stem cells is reflected in the focus of the chapter on the embryo. With it's clear writing style and use of non-technical language &quot;Speaking for the Dead&quot; will be an essential book for all those interested in bioethics, an area which continues to increase in significance with the development of new techniques for the manipulation of human cadavers. As a human anatomist and bioethicist, Gareth Jones offers a unique perspective on these issues, crossing the boundaries between clinical, medical, legal and ethical concerns. His exploration of historical developments as well as his analysis of recent case studies results in a pertinent and comprehensive examination of issues at the forefront of bioethics.\nAbout the Author\nProfessor D. Gareth Jones is Professor of Anatomy and Structural Biology at the Otago School of Medical Sciences, University of Otago. He has published widely on the areas of synaptic plasticity and bioethical issues. Maja I. Whitaker is Assistant Research Fellow in Anatomy and Structural Biology at the Otago School of Medical Sciences, University of Otago. \n\n\n\n\n# Hardcover: 310 pages\n# Publisher: Ashgate; 2nd Revised edition edition (28 Mar 2009)\n# Language English\n# ISBN-10: 0754674525\n# ISBN-13: 978-0754674528","torrent":{"xt":"urn:btih:427048b04eeac377e59ef8415ebc1cb38acd20ee","amp;dn":"Speaking+For+The+Dead%2C+2nd+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"427048b04eeac377e59ef8415ebc1cb38acd20ee","infoHashBuffer":{"type":"Buffer","data":[66,112,72,176,78,234,195,119,229,158,248,65,94,188,28,179,138,205,32,238]},"announce":[],"urlList":[]}}