{"title":"The.Dark.Eye.Chains.of.Satinav.Proper.Crack-RELOADED","uid":7371040,"size":7001162,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:43ebcc3ea76387a6274bc7d26a76de9f0200e5cf&amp;dn=The.Dark.Eye.Chains.of.Satinav.Proper.Crack-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"scene4all","files":-1,"time":1340230846,"description":"nERv\n\nThe Dark Eye: Chains of Satinav *Proper Crack* (c) Daedalic\n\n06/2012 :..... RELEASE.DATE .. PROTECTION .......: Securom\n- :.......... DISC(S) .. GAME.TYPE ........: Adventure\n\nNote:\n\nSRs crack again has various issues. One that is easy to demonstrate and\nquite noticable, is the general game performance.\n\nLoading times on an example system, compared with our crack:\nLoad to menu with intro videos     = 47s vs 28s\nLoad to menu, intro videos skipped = 38s vs 19s\nLoad new game                      = 16s vs 10s\n\nOther systems have similar results. But don't take our word for it.\nCheck it out yourself, and enjoy ;)\n\nWith a history of more than 25 years, The Dark Eye is one of Europe's\nbest-known role-playing brands. In addition to the popular pen &amp; paper\nadventures, TDE has also inspired a series of successful computer games.\nThe Dark Eye: Chains of Satinav immerses players deep in the world of\nAventuria, where they experience an amazing story and explore lands never\nbefore featured in a TDE computer game.\n\nIn Andergast, whose inhabitants are considered to be notoriously\nsuperstitious, King Efferdan awaits a state visit from high-ranking\ndignitaries. For centuries the kingdom has been at odds with neighboring\nNostria, but now first steps are being undertaken toward a lasting peace.\nBut a plague of crows troubles the king, for the birds are acting with\nunusual aggressiveness, even attacking humans. Moreover, there are those\namong the citizens of Andergast who swear that the crows are bringing them\ndark nightmares. As the belligerent creatures infiltrate even the castle\nitself, the king seeks a skilled bird catcher - an opportunity for young\nGeron to prove that the reputation for ill luck that has followed him\nsince childhood is undeserved. Following an audience with the king, the\nprestigious task is assigned to him. However, not only does his task prove\nunexpectedly difficult, but it also turns out to be the first step of the\ngreatest adventure of his life, which will lead him to the borders of the\ncharted lands of Aventuria and beyond.\n\n1. Unrar this crackfix into the &lt;install&gt; dir of the game.\n2. Play the game.\n3. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:43ebcc3ea76387a6274bc7d26a76de9f0200e5cf","amp;dn":"The.Dark.Eye.Chains.of.Satinav.Proper.Crack-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43ebcc3ea76387a6274bc7d26a76de9f0200e5cf","infoHashBuffer":{"type":"Buffer","data":[67,235,204,62,167,99,135,166,39,75,199,210,106,118,222,159,2,0,229,207]},"announce":[],"urlList":[]}}