{"title":"Ricky Carmichael's Motocross Matchup Pro ipod.ipad.iphone","uid":7218682,"size":113702525,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:448c81eb7072a65729fa690bbf6580a5a105dc23&amp;dn=Ricky+Carmichael%27s+Motocross+Matchup+Pro+ipod.ipad.iphone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cad40","files":1,"time":1335458208,"description":"So you think you have what it takes to ride with the big boys? Well, here is your chance to step up and prove it! \n\nTry to own your friends and rivals in this newest installment from the team that brought you the hits 2XL Supercross, 2XL ATV Offroad and X Games Snocross. \n\nRicky Carmichael's Motocross Matchup Pro is an all-new racing game where it's just you against online competitors from around the globe! This includes the chance to bang bars with some of the best in the business, including Ricky Carmichael himself! \n\nPlay Matchup mode and go head-to-head on both indoor (based on the real 2011 Supercross track layouts) and outdoor nationals tracks, including Ricky's very own backyard. \n\nChoose from a wide selection of avatars! Pick a rider outfitted in all of the latest Fox gear riding official Suzuki racing bikes to special characters on their own personalized machines. \n\nCollect in-game prizes and currency that you can use to upgrade your ride and give you the edge to beat your friends. Real Rewards is all set to hand out some very cool real world prizes. Check out www.YourRealRewards.com to see what's on tap! \n\nYou'll love the new video out support which allows you to crank up the action on your TV. \n\nKey Features: \n\n- Win real world prizes with RealRewards! \n- Full achievement system and leaderboards \n- 5 indoor and 5 outdoor tracks to master \n- Track layouts based on the 2011 Supercross season \n- 2 modes of play: Practice and Online Multiplayer Matchup \n- Select your appearance from a huge selection of bikes and riders \n- Level up to upgrade your bike and rider \n- iPad 2 and iPhone 4 Retina support \n- Gesture based stunt system \n- Multiple camera views including first person with handle bars \n- Select from multiple preset control schemes \n- Responsive tilt steering interface \n- Play on your TV with Apple's Component A/V cable \n\nRicky Carmichael's Motocross Matchup Pro requires Game Center in order to play online multiplayer. Please use iTunes to update your device to the latest iOS to play.\n... Show More\nWhat's new in Version 1.0\n- Very fast, reliable match ups.\n- Game Center no longer required for Match Up mode.\n- Support Game Center names in any language including Emoji.\n- Fixed a bug with tool chest awards. \n- Bighamton added to Match Up races. \n- Added new Ricky Carmichael rider audio.\n- Faster entry level bikes.\n- New music.\n","torrent":{"xt":"urn:btih:448c81eb7072a65729fa690bbf6580a5a105dc23","amp;dn":"Ricky+Carmichael%27s+Motocross+Matchup+Pro+ipod.ipad.iphone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"448c81eb7072a65729fa690bbf6580a5a105dc23","infoHashBuffer":{"type":"Buffer","data":[68,140,129,235,112,114,166,87,41,250,105,11,191,101,128,165,161,5,220,35]},"announce":[],"urlList":[]}}