{"title":"[Nuke]Kurokami_01-23_[1280x720]","uid":6560045,"size":10561599878,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:456c9e68871504633041ac88196b929eecc0253f&amp;dn=%5BNuke%5DKurokami_01-23_%5B1280x720%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Presk","files":23,"time":1311429111,"description":"I am reuploading it for others, am not the original maker of the torrent but i help to seed, so here it is. It is complete series and in 720p. Enjoy!\n\nSynopsis:\n\nKeita Ibuki is a 19-year-old independent and struggling freelance computer programmer. The two biggest things on his mind are 1) the death years ago of his mother, a few days after she and he had seen her doppelganger (see below, doppeliner), and 2) his project, with two of his friends, to develop and sell a video game program to a big-time video game company in Tokyo. he tries to stay afloat, survive financially and finance his video game project with money given to him by his 21-year old childhood friend Akane Sano. (In the anime, he is an ordinary high school student.) He has a chance meeting on one night with a high Mototsumitama named Kuro while eating alone at a ramen stand. He gives her his dinner, a bowl of ramen, and tries to protect her when she is attacked in an ambush by an unknown Tera Guardian. Keita loses an arm during the second round of that fight but Kuro is able to save his life by exchanging his arm for hers since she has enhanced healing abilities like all Mototsumitamas. (In the anime, his heart is injured and their hearts are exchanged instead.) This creates a contract between them, which can make her more powerful than before. In the manga Keita and Akane strongly disbelieve what Kuro is telling them, until Akane grabs Keita's left arm and yanks it around to show that it belongs to Keita, and it comes off. Kuro tells them that during this process he must stay close to her, as the host body, until the arm is completely fused, or it will rot and fall off; and that because of the swap her power is temporarily diminished, by 50%. Once they are synchronized she will have 200% as much power. In the anime Kuro warns Keita that they need to be together at all times because her heart will become necrotic if it is away from the main body.\n\nAs Kuro stays with Keita and gets acquainted with him while meeting with other Tera Guardians and their human masters, they are targeted by the strongest Tera Guardian clan of the East, the Shishigami (Lion God) Clan in an attempt to kidnap Akane and bring about the destruction of the coexistence balance, which Tera Guardians are supposed to protect. Meanwhile, Keita is determined to find out why his mother died after seeing her double as a young boy and to find out who is responsible for trying to destroy the coexistence balance on Earth.","torrent":{"xt":"urn:btih:456c9e68871504633041ac88196b929eecc0253f","amp;dn":"%5BNuke%5DKurokami_01-23_%5B1280x720%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"456c9e68871504633041ac88196b929eecc0253f","infoHashBuffer":{"type":"Buffer","data":[69,108,158,104,135,21,4,99,48,65,172,136,25,107,146,158,236,192,37,63]},"announce":[],"urlList":[]}}