{"title":"Dark Currents - Best Worst Movie Ever Made","uid":7210745,"size":460384400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a66389e8bb11e1c44a868e98fcb5da36e940668&amp;dn=Dark+Currents+-+Best+Worst+Movie+Ever+Made&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TerranRedneck","files":-1,"time":1335231077,"description":"Dark Currents is probably the best worst movie ever to be released on VHS. It is a must-see for any fans of movies so incredibly shitty that they are reaaaaaal good. It chronicles the adventures of several residents of the state of Maine as they encounter occult forces protecting the &quot;Legendary Golden Boulder&quot; \n\nYour friends might say they have seen the worst movie in existence... they are lying unless they are talking about Dark Currents. Written, directed, edited and starring only rednecks... it is truly a sight to behold. Mere words cannot express just how shitty-awesome this flick turned out. Troll 2, The Room, Birdemic... they all pale in comparison. \n\nNo fan of B-Movies can miss this film... B-Movie is being a bit generous... D-Movie perhaps. \n\nIt was only released on VHS in the mid 1990s in Maine so this copy is from a rip of a well watched tape... the quality isn't exactly highrez HD, but being filmed and edited originally on a camcorder kinda brought down the production values right out the gate. \n\n\nEnjoy!","torrent":{"xt":"urn:btih:4a66389e8bb11e1c44a868e98fcb5da36e940668","amp;dn":"Dark+Currents+-+Best+Worst+Movie+Ever+Made","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a66389e8bb11e1c44a868e98fcb5da36e940668","infoHashBuffer":{"type":"Buffer","data":[74,102,56,158,139,177,30,28,68,168,104,233,143,203,93,163,110,148,6,104]},"announce":[],"urlList":[]}}