{"title":"Laurel en Hardy - Flying Deuces 1939 (NLsubs) TBS","uid":6538577,"size":4115303733,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4e09a3cbbfd48d0738b4725b5d6a20f5bfc397d5&amp;dn=Laurel+en+Hardy+-+Flying+Deuces+1939+%28NLsubs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1310597183,"description":"\n\n\nLaurel en Hardy - Flying Deuces  1939\n\nVerenigde Staten\nKomedie\n69 minuten\n\ngeregisseerd door A. Edward Sutherland\nmet Stan Laurel, Oliver Hardy en Jean Parker\n\n\nNederlands:\n\n\nEen zalige komedie van het beste komische duo allertijden, waarin Ollie verliefd is op een meisje (Jean Parker) en \nmaar meteen besluit (op advies van Stan) haar ten huwelijk te vragen, niet wetende dat zij reeds is vergeven. \nOvermand door liefdesverdriet ziet Ollie geen andere uitweg dan zich samen met zijn vriend Stan te verdrinken in de Seine, voordat ze Parijs weer verlaten. \nEen hoge pief van het Vreemdelingenlegioen, notabene de verloofde van het meisje in kwestie, raadt hun aan zich bij hun legioen aan te sluiten,\nzodat Ollie het meisje van zijn dromen wel snel zal vergeten. Zo gezegd, zo gedaan. Het harde werk en het karige loon doen snel hun werk en Ollie is het meisje in no-time vergeten, \nwaarna ze het legioen op eigen houtje verlaten. Maar dit staat gelijk aan desertie en hierop staat de doodstraf! \nIn een ultieme poging hieraan te ontsnappen volgt een hilarische vlucht met een vliegtuig. \nHoogtepunten zijn zonder meer de muzikale intermezzo's met als uitschieter het liedje &quot;Shine On Harvest Moon&quot; (inclusief leuk dansje!), \nmaar ook de 'harp'-solo van Stan op de beddenspiraal tovert ongetwijfeld een brede glimlach op ieders gezicht. \nJames Finlayson is ook weer van de partij als welhaast vaste derde man, ditmaal als gevangenbewaarder. &quot;The Flying Deuces&quot; was ÃƒÂ©ÃƒÂ©n van hun laatste echt goede komedies. \nNadat ze hun samenwerking stopten met producent Hal Roach (door onenigheid over geldzaken), die hen groot had gemaakt, \nstapten ze over naar de grote studio's van MGM en 20th Century Fox en moesten ze het stellen met middelmatige scenario's, waardoor hun carriÃƒÂ¨re snel bergafwaarts ging en in het slop raakte.\nNiettemin is deze film net zo onsterfelijk als het duo zelf!\n\nEngels:\n\nOliver is heartbroken when he finds that Georgette, the inkeeper's daughter he's fallen in love with, is already married to dashing Foreign Legion officer Francois. \nTo forget her, he joins the Legion, taking Stanley with him. Their bumbling eventually gets them charged with desertion and sentenced to a firing squad. \nThey manage to escape in a stolen airplane, but crash after a wild ride\n\n\nDe originele zwart/wit versie \n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Nee\nAudio         : Engels\nExtra's       : Nee\nOndertitels   : Nederlands \nCover &amp; label : Ja\nGenre         : Comedy\n\n\n &lt;a href=&quot;\nhttp://www.laurel-and-hardy.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.laurel-and-hardy.com/&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0031322/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0031322/&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/4587&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/4587&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:4e09a3cbbfd48d0738b4725b5d6a20f5bfc397d5","amp;dn":"Laurel+en+Hardy+-+Flying+Deuces+1939+%28NLsubs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e09a3cbbfd48d0738b4725b5d6a20f5bfc397d5","infoHashBuffer":{"type":"Buffer","data":[78,9,163,203,191,212,141,7,56,180,114,91,93,106,32,245,191,195,151,213]},"announce":[],"urlList":[]}}