{"title":"The I Of The Dragon","uid":6670095,"size":792521103,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4ed1d2b3c5f56302dfc86eb95f2746294b3e4817&amp;dn=The+I+Of+The+Dragon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marco699","files":6,"time":1315841662,"description":"The Eye of the Dragon is a role-playing video game where the player plays as a dragon. It was published by Strategy First and developed by Primal Software.\n\n\nPlayable dragons:\n\nAnnoth - Annoth is one of the dragons destined to save the world from evil and is colored red with a mix of other colors in the game. Annoth is a powerful and strong dragon who can breathe fire and is the dragon able to achieve the missile type attack fastest. Because of its strong power, Annoth does not favor using magic.\n\nBarroth - The second of the dragons destined to save the world from evil and is colored blue mixed with red in the game. Barroth is a fast and magic using dragon who can breathe cold air causing the enemies to freeze. Barroth is the only dragon who is able to use lots of spells and regenerate mana in short amount of time. Since Barroth only uses magic, it is a more advanced dragon to use.\n\nMorrogh - Morrogh is the final dragon destined to save the world from evil and is colored black mixed with some brown in the game. Morrogh is a fast regenerating and dark magic using dragon who can release toxic air into the ground which is used to poison and kill enemies. Morrogh is the only dragon who is compatible with all skills (except for speed). Since Morrogh is fast on regenerating its health back and can use some basic spells, Morrogh is slow with ability advancement.\n\nGame features:\n\nBuild Towns - I of the Dragon features the ability to build towns. After defeating each major enemy in each sector, there is the option to build a town. Towns are randomly constructed cities with an altar in the middle.\n\nUpgrade Towns - The upgrade town feature in the game is only available once you are in possession of the artifact found in one of the Trixter lairs. It can only be used when a town exists, has enough energy to be upgraded and hasn\\'t reached its maximum level. Further levels of towns increase its defensive potential, creates larger walls, more soldiers, etc.\n\nSpells - Each dragon in the game can use spells, some more efficient than others. This spells range from summoning deadly beasts to raising large mountains and volcanoes.\n\nOrbs - Orbs are magical spheres which glow red, green or blue. Each gives a different effect in character development. For example, green spheres provide more spell slots. Orbs are gathered by destroying lairs (monster spawn bases).\n\n\ntrailer: ","torrent":{"xt":"urn:btih:4ed1d2b3c5f56302dfc86eb95f2746294b3e4817","amp;dn":"The+I+Of+The+Dragon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ed1d2b3c5f56302dfc86eb95f2746294b3e4817","infoHashBuffer":{"type":"Buffer","data":[78,209,210,179,197,245,99,2,223,200,110,185,95,39,70,41,75,62,72,23]},"announce":[],"urlList":[]}}