{"title":"Road Rash [PC][sneak_shot]","uid":6537687,"size":44566497,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:506adc8c6d6b1e73c71dff0872601ce40a3df100&amp;dn=Road+Rash+%5BPC%5D%5Bsneak_shot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sneak_shot","files":341,"time":1310566955,"description":"presenting s n e a k _ s h o t\n\n\n\nrelease date :21:07:1992\n\n\ndiscription:\n\n\n\n\nRoad Rash is the name of a motorcycle-racing video game series by Electronic Arts, in which the player participates in violent illegal street races. The game was originally released for the Sega Mega Drive/Genesis, but was ported to several other systems. Six different games were released from 1991 to 1999, and a 2004 licensed port for the Game Boy Advance was released. Road Rash and two of its sequels later appeared on the EA Replay collection for the PSP.\n\nThe game's title is based on the slang term for the severe friction burns that can occur in a motorcycling fall where skin comes into contact with the ground at high speed.\n\n\nPresented in a third-person view similar to Hang-On, the player competes in illegal road races and must finish in the top 3 places in every race in order to proceed to the next level. As levels progress, the opponents ride faster, fight harder and the tracks are longer and more dangerous. Placing in each race gives a certain amount of money which increases considerably as levels progress. This money allows the player to buy faster bikes which are needed to stay competitive. The game is over if the player can't pay for the repairs when their motorcycle is wrecked, or can't pay the fine for being arrested.\n\n\n\n\nseed comment n enjoy...!!!","torrent":{"xt":"urn:btih:506adc8c6d6b1e73c71dff0872601ce40a3df100","amp;dn":"Road+Rash+%5BPC%5D%5Bsneak_shot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"506adc8c6d6b1e73c71dff0872601ce40a3df100","infoHashBuffer":{"type":"Buffer","data":[80,106,220,140,109,107,30,115,199,29,255,8,114,96,28,228,10,61,241,0]},"announce":[],"urlList":[]}}