{"title":"Orrible Full 2 DVDRIP All Menus and extras ISO","uid":6674812,"size":8788635648,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:53f6ae097b63c95e29a090c9aa7487c94b7d5357&amp;dn=Orrible+Full+2+DVDRIP+All+Menus+and+extras+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"orrible","files":3,"time":1315991470,"description":"OK, so it got panned by the critics. That\\\\\\'s no reason to have the big hate campaign against it. I absoloutly loved this series, and thing that it was a stand out piece of British comedy history. The 2 main characters were great, with Ricky Grover totally making every scene his own. The supporting characters were also great, Tim the barmans war storys had me in stitches. I recently bought the DVD and the commentary is fantastic, Johnny Vaughan doing what he does best, just talking away! If people had given this a chance instead of listening to the \\\\\\'experts\\\\\\', the 2nd series Johnny mentions on the DVD might have been made. \n\nI have seen most of the episodes and I loved every single one. I would put this up in the ali-g league. Johnny is fantastic and his fat friend is also very good: \\\\\\&quot;this is my world!!\\\\\\&quot; he he. I promise you that I am not Germaine Greer type reviewer which means that if you watch this you will truly be entertained! Nuff said!\n\n\n--------------------------------------------------------------------------------\nI\\\\\\'d like to add that i also Really enjoyed this series, I\\\\\\'d even put it in my top FIVE list of Fav sit-coms of all time. So, why was a programme that was far far funnier than Only Fools and Horses given the push after 6 eps? Well In an age of \\\\\\&quot;Sex and the City\\\\\\&quot; and \\\\\\&quot;Friends\\\\\\&quot; and \\\\\\&quot;Will and Grace\\\\\\&quot;, in a age were the women of this planet seem to control popular culture, nobody seems to want to watch a male buddy comedy which had no women as the main stars. Shame really. What else is there for the men of this world to watch on TV these days if they don\\\\\\'t like sport? If you\\\\\\'ve not had the pleasure of seeing this fine show, and your a fan of \\\\\\&quot;only fools\\\\\\&quot;, \\\\\\&quot;Porridge\\\\\\&quot; and other British male \\\\\\'Buddy\\\\\\' sitcoms check this one out. \n","torrent":{"xt":"urn:btih:53f6ae097b63c95e29a090c9aa7487c94b7d5357","amp;dn":"Orrible+Full+2+DVDRIP+All+Menus+and+extras+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f6ae097b63c95e29a090c9aa7487c94b7d5357","infoHashBuffer":{"type":"Buffer","data":[83,246,174,9,123,99,201,94,41,160,144,201,170,116,135,201,75,125,83,87]},"announce":[],"urlList":[]}}