{"title":"XUS PCLock v4.1.68","uid":7232442,"size":1327053,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:569480c326a87df19d559bb204b6bc08e0aadc7a&amp;dn=XUS+PCLock+v4.1.68&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1335832560,"description":"XUS PC Lock offers a new and fun way for you to lock your computer. Before using XUS PC Lock, you have to define your lock pattern. The next time you will see the lock screen, You trace your mouse in the pattern you drew before and your computer will unlock. Any other pattern and in any other order will not unlock the computer. XUS PC Lock can lock the whole computer. This is the most feature rich lock computer application available today with lots of customization options.\n\nXUS PC Lock is the ultimate customizable lock computer application allowing you to pick custom images for the lock screen. XUS PC Lock can autolock the computer when windows startup and computer inactivity. XUS PC Lock allows you to set an alert mode when the incorrect pattern is entered a maximum times.\n\nFeatures:\n* Many autolock options such as startup and computer inactivity \n* Custom background image, and lots of customization options for the look of the lock screen \n* Turn off monitor automatically \n* Show Time and Date on lock screen \n* Alert if the incorrect pattern is entered a maximum times. Completely customizable. \n* The funnest, most customizable way to lock your computer!\n\nHome Page: www.edesksoft.com","torrent":{"xt":"urn:btih:569480c326a87df19d559bb204b6bc08e0aadc7a","amp;dn":"XUS+PCLock+v4.1.68","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"569480c326a87df19d559bb204b6bc08e0aadc7a","infoHashBuffer":{"type":"Buffer","data":[86,148,128,195,38,168,125,241,157,85,155,178,4,182,188,8,224,170,220,122]},"announce":[],"urlList":[]}}