{"title":"Young Harlots Naughty Tutorials [DVDRip]","uid":7274151,"size":1466015744,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:59e3d715deacde854c58b29ca1cdd2a7fed1aafc&amp;dn=Young+Harlots+Naughty+Tutorials+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"chkm8te","files":2,"time":1337218568,"description":"Welcome to the most disobedient school in England! This is where  innocence is abolished and young whores are willing please their tutors  in arse stretching classes and lesbian encounters: This is Young Harlots  Naughty Tutorials! \n\nSex toy salesman Mr D breaks down close by the Young Harlots academy so  not wanting to miss out on a quick sale this crafty salesman blags his  way in during a sex education lesson leaving his sex toys behind to be  sampled.  Naughty nurse Shay Hendrix is soon stuffing an array of sex  toys into sexy minx Brooklyn Lee and cutie Ruth Medina; juicing up their  tight holes before the strap-on fuck fest lesbian frenzy unfolds  leaving them truly satisfied.\nMr D stumbles upon the curvaceous Victoria Blaze smoking on the couch,  Victoria inquirers about his briefcase and her eyes soon light up as he  revels its contents; Mr D also gets a surprise as this sultry harlot  shows off her tongue skills, sucking away on large black dildo! Soon  panties are down and Mr DÂ’s pulsating cock is riding its way up into her  wet slit.  This is one ass and pussy hardcore scene that will have you  begging for more.\n\nGorgeous Linet Slag slowly plays with her pert tits foaming them up in  the bath teasing herself and her headmaster.  He fills her eager ass  with a butt plug getting it ready to fill it with his throbbing hard  cock, but first LinetÂ’s ripe luscious lips give him a good suck before  Linet gets fucked hard and covered in white creamy spunk.  This scene  will have you reaching for your cock in no time!\nNaughty school girls Victoria Blaze and Kristine Crystalis get caught  fooling around with their new sex toys. Their perverted headmaster  demands that they re-in act what they have been doing and steps in with a  helping hand and pulsating cock which breaks into a no holes barred  threesome.\n\nThe perverted headmaster and his two professors finally catch up with Mr  D, they decide to give him the benefit of the doubt as they encourage  him to perform a full demonstration and luckily naughty slut Kristine  Crystalis volunteers for the job.  Fingers start to probe juicing up  Kristine holes getting her prepared to take two cocks which she laps up  in this explosive double penetration scene.\n\n\nStarring: Victoria Blaze, Linet Slag, Brooklyn Lee, Shay Hendrix, Ruth Medina, Kristina Crystalis.\n\nScreens: &lt;a href=&quot;\nhttp://ximg.me/viewer.php?file=62qzogh0f5s0yy8ihshf.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ximg.me/viewer.php?file=62qzogh0f5s0yy8ihshf.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ximg.me/viewer.php?file=omsfdf571uteg2hv8msd.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ximg.me/viewer.php?file=omsfdf571uteg2hv8msd.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ximg.me/viewer.php?file=1f7gfwicxdyf2opx6bs8.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ximg.me/viewer.php?file=1f7gfwicxdyf2opx6bs8.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:59e3d715deacde854c58b29ca1cdd2a7fed1aafc","amp;dn":"Young+Harlots+Naughty+Tutorials+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59e3d715deacde854c58b29ca1cdd2a7fed1aafc","infoHashBuffer":{"type":"Buffer","data":[89,227,215,21,222,172,222,133,76,88,178,156,161,205,210,167,254,209,170,252]},"announce":[],"urlList":[]}}