{"title":"Target: Tinos by Jeffrey Siger (ePub and MOBI retail)","uid":7347338,"size":3075312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59e91f44d9b9cf13ab71b80b3c56e6c4b70e189b&amp;dn=Target%3A+Tinos+by+Jeffrey+Siger+%28ePub+and+MOBI+retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TxJag","files":5,"time":1339471351,"description":"In an isolated olive grove on the idyllic Aegean island of Tinos, revered by pilgrims around the world as the Lourdes of Greece, the remains of two bodies charred beyond recognition are discovered chained together amid bits and pieces of an incinerated Greek flag. An enraged press screams out for justice for the unknown victims, until the dead are identified as gypsies and the story simply falls off the face of the earth. Is it a gypsy clan war, a hate crime, or something else? With no one seeming to care, the government has no interest in resurrecting unwanted media attention by a search for answers to such ethnically charged questions and orders the investigation closed. But Andreas Kaldis, feared head of Greece's special crimes division, has other plans. He presses on in his inimitable, impolitic style to unravel a mystery that yields more dead, a modern secret society rooted in two-hundred-year-old ways, and a nagging suspicion that his answers lay in the sudden influx of non-Greeks and gypsies to Tinos. It is there, on Tinos, Andreas learns of priceless hoards of gold, silver, art, and precious gems quietly amassed over centuries out of the offerings of grateful pilgrims. He has found a motive for murder and an irresistible inspiration for robbery. All that is left for Andreas to do is find the killers before more die, stop the robbery of the century, and get married in the process.\n\nBook 4 in the Andreas Kaldis series.","torrent":{"xt":"urn:btih:59e91f44d9b9cf13ab71b80b3c56e6c4b70e189b","amp;dn":"Target%3A+Tinos+by+Jeffrey+Siger+%28ePub+and+MOBI+retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59e91f44d9b9cf13ab71b80b3c56e6c4b70e189b","infoHashBuffer":{"type":"Buffer","data":[89,233,31,68,217,185,207,19,171,113,184,11,60,86,230,196,183,14,24,155]},"announce":[],"urlList":[]}}