{"title":"pelicanhpc-v2.6.iso","uid":6667411,"size":729808896,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:5c3e605d0354648a5c65e0cd97bc74cb10108fa4&amp;dn=pelicanhpc-v2.6.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne2","files":1,"time":1315699545,"description":"PelicanHPC is an iso-hybrid (CD or USB) image that let's you set up a high performance computing cluster in a few minutes. A Pelican cluster allows you to do parallel computing using MPI. You can run Pelican on a single multiple core machine to use all cores to solve a problem, or you can network multiple computers together to make a cluster. The frontend node (either a real computer or a virtual machine) boots from the image. The compute nodes boot by PXE, using the frontend node as the server. All of the nodes of the cluster get their filesystems from the same image, so it is guaranteed that all nodes run the the same software. Packages can be added to all nodes using apt-get, thanks to aufs. The bootable image is created by running a single script, which takes advantage of the Debian Live infrastructure.  It is very easy to create a custom version with new packages by adding package names to the script and then running it. PelicanHPC is creates a fairly bare-bones cluster, with few applications other than those relevant to the author's research and teaching. To use PelicanHPC for serious work in other disciplines, it will be necessary to create a customized version. The tutorial explains how to do this. It is not very difficult. Two examples of specialized distros that add to the PelicanHPC base are MOLA and birgHPC. These are very good examples of how it is intended for the make_pelican script to be used. \n...\n09 Sept. 2011. version 2.6 is available. make_pelican uses a new and simpler method to add non-Debian software. This latest image was made using the new method, and the image contains the updated tutorial which explains the new system. &lt;a href=&quot;\nhttp://pareto.uab.es/mcreel/PelicanHPC/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pareto.uab.es/mcreel/PelicanHPC/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://pelicanhpc.788819.n4.nabble.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pelicanhpc.788819.n4.nabble.com/&lt;/a&gt; (forum)\n\nmd5sum : eff7b3206ea0f9247a0af1451480d726  pelicanhpc-v2.6.iso","torrent":{"xt":"urn:btih:5c3e605d0354648a5c65e0cd97bc74cb10108fa4","amp;dn":"pelicanhpc-v2.6.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c3e605d0354648a5c65e0cd97bc74cb10108fa4","infoHashBuffer":{"type":"Buffer","data":[92,62,96,93,3,84,100,138,92,101,224,205,151,188,116,203,16,16,143,164]},"announce":[],"urlList":[]}}