{"title":"Dungeon Explorer PC [Hyperdrive25].exe","uid":6559547,"size":43794412,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5c698261a663f52821786bbb3f78ac47f0fe5476&amp;dn=Dungeon+Explorer+PC+%5BHyperdrive25%5D.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Hyperdrive25","files":-1,"time":1311411943,"description":"         Dungeon Explorer: Warriors of Ancient Arts PC [Hyperdrive25]\n         ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\nDungeon Explorer: Warriors of Ancient Arts is a video game developed by Hudson Soft available for both the Sony PlayStation Portable and the Nintendo DS handheld game consoles.\n\nDungeon Explorer: Warriors of Ancient Arts is an action RPG game similar in style to Phantasy Star Online. It features wireless connectivity to allow multiple players to connect to each other. It also allows for online play using Nintendo Wi-Fi Connection on the Nintendo DS.\n\nThe Sony PSP version features 3 races and 6 beginning classes that the player can select from at the beginning. After a certain point, the character has the option of changing classes while not in the dungeons, each of which retains its own rankings (Rank E all the way up to Rank S.) There are also 6 advanced classes which require a combination of two of the basic classes; one at rank B and the other at rank A. These advanced classes include the abilities of the previous two classes, plus new abilities of their own as well as unique weapons that can be wielded. All of these abilities are acquired as the characters level up their weapon ranks as well as their job ranks, and two of these can be equipped and changed on the fly.\n\nThe Nintendo DS version contains also 3 races with 3 warriors each. Once selected, players choose points they distribute on their character. The type of arts they are given is done in the Artrium in the Lost Forest.\n\nThe bulk of the storyline for the PSP version takes place in various dungeons, as the title implies. Each dungeon is unlocked after various quests are completed by acquiring &quot;plates&quot; and can be leveled up by inserting jewels in said plates. Each level is more challenging than the previous one and can be selected at any given time. At one point Dungeon level progression is stopped until an item called a Sirius Jewel is acquired, a reusable item that unlocks further dungeon empowerment. Specific levels have specific challenges in them, such as Level 6 of a dungeon are considered blind; without the usage of a specific item, the mini-map is blanked out with only the character icons visible.\n\nThe jewels have multiple purposes in addition to powering up dungeons, they can be consolidated, used in alchemy or installed onto weapons are armor. These jewels are elemental in nature and match each element of the dungeons, which follow a planetary theme (Neptune, Saturn, Jupiter, etc) In addition, each element has a status ailment associated with it.\n\nHow To Install &amp; Play:\n----------------------\nDouble-click the setup file.\n\nOkay, after setup is completed, start menu items and uninstaller has been created,\nas well as a desktop shortcut.\n\nDouble-click Dungeon Explorer Launcher, and in the file tab click on Open ROM.\n\n(The game is in the C:\\Program Files\\Dungeon Explorer PC [Hyperdrive25]\\Roms directory).\n\n**You can change the 3D Settings between Software Rasterizer or OpenGL (whichever works best with your graphics card).**\n___________________________________________________________________________________\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n\n\n","torrent":{"xt":"urn:btih:5c698261a663f52821786bbb3f78ac47f0fe5476","amp;dn":"Dungeon+Explorer+PC+%5BHyperdrive25%5D.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c698261a663f52821786bbb3f78ac47f0fe5476","infoHashBuffer":{"type":"Buffer","data":[92,105,130,97,166,99,245,40,33,120,107,187,63,120,172,71,240,254,84,118]},"announce":[],"urlList":[]}}