{"title":"Robin Hood - The Legend of Sherwood","uid":7370007,"size":659336379,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5c7f7ee34cf88818817844be361b41aeff812bf2&amp;dn=Robin+Hood+-+The+Legend+of+Sherwood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dimigeor","files":37,"time":1340206696,"description":"Robin Hood: The Legend of Sherwood is a 2002 stealth-based real-time strategy video game. It is similar to games such as Desperados: Wanted Dead or Alive and the Commandos series. In the game, the player controls up to five characters in a setting based on the stories of the protagonist, Robin Hood. The player can also control Robin Hood's Merry Men, including Little John, Friar Tuck, Will Scarlet, Will Stutely, and Maid Marian. Robin and his crew must evade the cruel Sheriff of Nottingham and his henchmen and stop the machinations of the vile usurper to England's throne, Prince John. However, Robin must avoid killing enemies as much as possible, or he will not be able to recruit as many new Merry Men.\n\n\nGameplay:\n\nWhile the merry men can kill or wound enemy soldiers, their resources are limited to a certain extent, with main characters having more than minor miscellaneous ones. In addition, in every town, the player can give money to beggars, who, when given coins and purses, help by providing hints and tips. Common folk sometimes offer help as well (although this happens very rarely). On the other hand, there are two types of folk, who flee at the sight of a merry man, and alert nearby enemy soldiers. One is a woman, who wears a red apron; the other, a man, who wears a red-and-blue shirt. The greed of enemy soldiers is also limited, with money purses not affecting sergeants, while ale does affect them. Sometimes, money can be found in knights, cavalry units, sergeants, and more rarely, normal soldiers.\n\n\nSystem requirements:\n\nWindows\nWindows 98/Me/2000/XP\nPentium II 233 MHz\n64 MB RAM\nGraphics card with 4MB RAM\nDirectX compatible sound card.\n900 MB hard disk space\n4x CD-ROM drive\nDirectX 8.1 or higher\n\nMac\nMac OS X 10.2+\nG3/G4 300 MHz\n128 MB RAM\n8MB Graphic Card.\n\n\nInstallation:\nSimple execute &quot;setup&quot; or &quot;autorun&quot; file, install the game and fix the &quot;Robin Hood.exe&quot; file by replacing it with the file including (crack), the update is not necessary.","torrent":{"xt":"urn:btih:5c7f7ee34cf88818817844be361b41aeff812bf2","amp;dn":"Robin+Hood+-+The+Legend+of+Sherwood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7f7ee34cf88818817844be361b41aeff812bf2","infoHashBuffer":{"type":"Buffer","data":[92,127,126,227,76,248,136,24,129,120,68,190,54,27,65,174,255,129,43,242]},"announce":[],"urlList":[]}}