{"title":"Safe With Me - Volume 1 - Pirate Edition","uid":6674091,"size":1171826,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e1e616ed403ac342811c213f05be247f3469b73&amp;dn=Safe+With+Me+-+Volume+1+-+Pirate+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shainar","files":1,"time":1315974793,"description":"Tyler Campbell has fallen in love with Susanna Lombardi and is determined to make her his. He becomes obsessed with learning the secrets of the women he's fallen in love with. Where does she go on her mysterious trips? What's the source of her seemingly endless supply of money? Why does her house have so many locked doors? \n\nExcerpt:  \n\n\n&quot;Your turn,&quot; I said as I reached down to help her stand up beside me. &quot;First, I need you out of those clothes.&quot;\n\nShe showed me that sexy smile I already loved so much. &quot;Whatever you want,&quot; she moaned, then took my hand and rose to her feet. I pulled her pants and panties all the way down to the floor and helped her step out of them.\n\nSusie looked beautiful standing before me. I swear, I had never been attracted to her body type before. It was the most beautiful thing I'd ever seen. I studied her, trying to burn her image into my memory. Susie's body was full and silky, and looked even better naked than I had imagined.\n\nI put my arms around her back as I leaned down to overtake her mouth with mine. I fiercely pressed my hard body to hers, reveling in the luxurious feel of her softness against me. Her breasts felt like pillows; her stomach cushioned my hard c**k. I wanted to take her away to a deserted island and devote myself to learning everything I could about her body for a few years.\n\nI felt her hands on my ass pulling me closer. She cupped my firm muscles as she moaned and breathed harder into my mouth. My d**k pressed harder into her stomach until I couldn't take it anymore.\n\n&quot;Sit on the couch,&quot; I whispered.\n\nWithout a word, she sat down. I knelt down on the floor in front of her and gently placed a hand on each of her knees, spreading them apart. I was about to reach for the condom when I caught a glimpse of the soft folds between her thighs. I knew I needed to taste her. I put my hands under her knees to guide her legs even further apart. Then I stopped to gaze at her for a moment, admiring her naked body, trying again to burn another picture of her into my memory. She half smiled at me with a dreamy look in her eyes.\n\nI loved how those big tits complimented her pretty pink p***y, and the way her long blond hair framed her beautiful face as it fell around her shoulders, onto her chest. I was once again reminded of a scene from a trashy magazine featuring large-breasted women with their legs spread open. She was a guilty pleasure come to life.\n\nI bent my head down and gave her one good, long lick from the bottom of her p***y up to her cl**. She moaned and put her hands on the back of my head.\n\n&quot;Woman, you are so wet,&quot; I said, just before my mouth began its assault on her.\n\nI took my time with her at first, licking every inch of her, my tongue lingering to enjoy her taste. Every time I had done this with a woman in the past, the room was dark. But Susie had the lights on, confident and unashamed. It turned me on to be able to see her p***y while I was licking it.\n\nI sucked on her lips for a while before I moved up to her cl**. Her moans got louder as my tongue moved in fast circles around it.\n\n&quot;Damn it! I need you to f**k me, now!&quot; she demanded. I could hear pain in her voice. \n\nI desperately wanted to f**k her, but not yet. I longed to get her off with my mouth before we went any further. I wanted to taste her and feel her wetness dripping all over me as I brought her to orgasm.","torrent":{"xt":"urn:btih:5e1e616ed403ac342811c213f05be247f3469b73","amp;dn":"Safe+With+Me+-+Volume+1+-+Pirate+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e1e616ed403ac342811c213f05be247f3469b73","infoHashBuffer":{"type":"Buffer","data":[94,30,97,110,212,3,172,52,40,17,194,19,240,91,226,71,243,70,155,115]},"announce":[],"urlList":[]}}