{"title":"Earth Defense Force - Insect Armageddon. PAL. XBox 360","uid":6684819,"size":7839554944,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:6144dc17c8700a558ed29c10431f11a7ad0735a6&amp;dn=Earth+Defense+Force+-+Insect+Armageddon.+PAL.+XBox+360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"negotiator2k","files":4,"time":1316362016,"description":"The bugs are back in Earth Defense Force: Insect Armageddon, the most concentrated insect invasion the world has yet to encounter. Mankind faces the end of human civilization at the hands (or claws) of thousands of gigantic bugs unless the elite Earth Defense Force can stop them! \n\nEarth Defense Force: Insect Armageddon is a completely new video game developed by Vicious Cycle that expands the Earth Defense Force 2017 universe (Japanese Title &quot;Earth Defense Force 3&quot; developed by SANDLOT) and continues to follow the rich history of fun and addictive gameplay that makes the franchise a cult classic. Insect Armageddon is set in New Detroit and features a Campaign mode that lets up to three players team up online to battle the insects and aliens across the completely destructible city. \n\nThe nonstop action gameplay in Insect Armageddon is the fastest and deadliest in the series. To arm their EDF soldiers, players must cash in points to collect over 150 unique weapons and four upgradeable armor sets. In addition, the game also features a six-player Survival mode that pits a human squad against a nonstop onslaught of the largest enemies the aliens have to offer. New Detroit's giant bug problem is unavoidable, and mankind's last hope lies with the Earth Defense Force to defend the world from the insect swarm, even if it means blowing up the entire city as part of the extermination process.","torrent":{"xt":"urn:btih:6144dc17c8700a558ed29c10431f11a7ad0735a6","amp;dn":"Earth+Defense+Force+-+Insect+Armageddon.+PAL.+XBox+360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6144dc17c8700a558ed29c10431f11a7ad0735a6","infoHashBuffer":{"type":"Buffer","data":[97,68,220,23,200,112,10,85,142,210,156,16,67,31,17,167,173,7,53,166]},"announce":[],"urlList":[]}}