{"title":"I Love You, Man(2009)DVDRip.AC3(ENG)-DROCK","uid":7288126,"size":732530688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:636ecf1a6153b7e28e9016021970c813e86a6407&amp;dn=I+Love+You%2C+Man%282009%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1337644015,"description":"Engaged to the woman of his dreams yet uncomfortable with the prospect of not having a best man for his upcoming wedding, a successful real estate agent with no male friends schedules a series of &quot;man dates&quot; in hopes of finding a suitable candidate for the big day. Peter Klaven (Paul Rudd) is just like most other guys, only when it comes to making friends he's always been a bit withdrawn. After proposing to his girlfriend, Zooey (Rashida Jones), however, Peter quickly realizes that he doesn't even have any friends close enough to qualify for the role of best man. And what better method to find the perfect best man than to spend some time getting to know the most qualified candidate for the position? While most of Peter's &quot;man dates&quot; are incredibly awkward from the very beginning, the desperate bridegroom is surprised to hit it off with Sydney Fife (Jason Segel) on their very first meeting. Sydney is charming, personable, and opinionated, and before long he and Peter have become inseparable. But this isn't exactly what Zooey had in mind, because the closer that Peter grows to his new &quot;bro,&quot; the further he drifts from the woman who will soon be his wife. Now, with the wedding closing in and the drama heating up, Peter begins to ponder a means of staying good friends with Sydney while still remaining true to the woman he loves.\n\nRipped with Autogk\n\nLength: 1 Hour 45 Minutes\n\nFile Type: AVI\n\nFrame Width: 624\n\nFrame Height: 328\n\nFrame Rate: 30fps\n\nAudio\n\nBit Rate: 109kbps","torrent":{"xt":"urn:btih:636ecf1a6153b7e28e9016021970c813e86a6407","amp;dn":"I+Love+You%2C+Man%282009%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"636ecf1a6153b7e28e9016021970c813e86a6407","infoHashBuffer":{"type":"Buffer","data":[99,110,207,26,97,83,183,226,142,144,22,2,25,112,200,19,232,106,100,7]},"announce":[],"urlList":[]}}