{"title":"Tessel.HyperDoc.v4.90.913.0-Lz0","uid":6558907,"size":52036852,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:642800ed01dab1f962e3cbafa6b1fdb6eb92bc14&amp;dn=Tessel.HyperDoc.v4.90.913.0-Lz0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1311389539,"description":"Tessel HyperDoc 4.90.913.0\n\nHyperDoc is a graphical subsystem for active integration of composite documents, down to graphical entity level, equally well with newly built and with legacy database applications.\n\nHyperDoc is a tool, which allows you to present hierarchical views of business objects from a database and associate graphical information with business objects. To a business object you can attach full-size raster drawings, vector drawings, maps, photographs. Additionally it is possible to link a business object with its graphical representation, e.g. room can be represented by a polygon, computer by an appropriate icon. Graphical entities representing business objects support graphical navigation through database, visualization of objects' state, selecting business objects by geographical queries.\n\nMain area of HyperDoc application is adding active documents to database applications that are being used these days to manage almost everything: towns planning, inventory control, facilities management, security systems, manufacturing and distribution. All of those must deal with documents, most of them would benefit from having well integrated access to full size drawings and maps.\n\nHyperDoc can be integrated with existing database applications in order to add graphical information. Of course, HyperDoc can be used as the foundation for, or component of, newly constructed database applications. Key HyperDoc features are the following:\n\n- easy definition of hierarchical views,\n- management of application security,\n- customizable document types,\n- graphical navigation through database and documents,\n- built-in visualization of selection sets,\n- multi-user documents redlining,\n- document versions,\n- excellent printing,\n- API to customize HyperDoc functions and events.\n\nHyperDoc is currently available in English, Swedish, Finnish, Polish, Czech and Norwegian. Read HyperDoc read_me for more information.\n\nHome page - http://www.tessel.se/\n\n\n\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n\n\n*** When using TPB please read these important notes: \n-----------------------------------------------------\n\n01. AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they're \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don't use them.\n\n02. To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03. If AV software removed a clean crack usually it can be restored \n    (if it's not in Quarantine then look at History or something similar).\n\n04. To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/6487418&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/6487418&lt;/a&gt;\n\n05. Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06. Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07. Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08. Clicking on unknown links can coz malware being silently installed on a pc!\n\n09. Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10. Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n11. In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12. In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13. Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n14. Comments are welcome, unlike ranting, trolling, whining, etc.\n\n15. No Promises ... No Debts!\n\n\nFor reporting bad or suspicious torrents:     &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor requests:    &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=31&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=31&lt;/a&gt;\n\nFor visiting my 1000+ torrents:     &lt;a href=&quot;\nhttp://thepiratebay.se/user/Anacondaz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Anacondaz/&lt;/a&gt;\n\n\n\n-----------------------------------------------------------------------------------\n\n\nTo the &quot;United Reliable The Pirate Bay Users&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intentionally \nposting fake comments &amp; files. Their meaning is just trying to spread \nconfusion and to frustrate TPB and it's users. \nLess downloaders = less seeders = less download speed etc = not good! \n\nIt's in the benefit of TPB and all reliable users to warn each other about people \nwho intentionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intentionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and TPB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable The Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\t\t\n","torrent":{"xt":"urn:btih:642800ed01dab1f962e3cbafa6b1fdb6eb92bc14","amp;dn":"Tessel.HyperDoc.v4.90.913.0-Lz0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"642800ed01dab1f962e3cbafa6b1fdb6eb92bc14","infoHashBuffer":{"type":"Buffer","data":[100,40,0,237,1,218,177,249,98,227,203,175,166,177,253,182,235,146,188,20]},"announce":[],"urlList":[]}}