{"title":"Kink.com The upperfloor--------14806 - Lilla Katt  Nerine Mech","uid":6685271,"size":926755341,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:648a9ce6b2d706bd52a209a2f0b59376ad974da3&amp;dn=Kink.com+The+upperfloor--------14806+-+Lilla+Katt++Nerine+Mech&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":141,"time":1316377990,"description":"From Kink.com   ( The Upperfloor )  + Pics\n\nKink.com The upperfloor\\14806 - Lilla Katt  Nerine Mechanique  Iona Grace  Krysta Kaos Skin Diamond.\n\nTrainee ash has been through all five grueling days of training. The Pope has decided that instead of giving her away to another Master he will keep her as his personal slave. Ash must prove her commitment in a test that has never been used by the House before: permanent marking. \n\nAsh has her lithe body strung up like meat for an entire party of guests to peruse and fondle. Then come the house slaves, inspecting every inch of slave ash with their tongues and hands until she is panting. Finally the men of the House give her a good whipping to tenderize her before a sexual test.\n\nEnter Derrick Pierce and Bobby Bends. These two men throw Ash around like a rag doll and use her holes until she is so overwhelmed she forgets how to fuck properly. To punish her for losing herself, Ash is dragged off their cocks and made to watch while the house slaves satisfy themselves by serving well-trained blowjobs to the male guests. Derrick and Bobby use almost every submissive slut in the room except ash. Once the men have given their loads to other girls and ash has been thoroughly humiliated, she is presented to the tattoo artist to be permanently marked with a crest of the Pope. She tearfully accepts her test and the tattoo needle seals her position as personal slave to the Pope. \n\n\n\nScreens &lt;a href=&quot; http://www.theupperfloor.com/site/shoot.jsp?shootId=14806&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.theupperfloor.com/site/shoot.jsp?shootId=14806&lt;/a&gt;\n\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:648a9ce6b2d706bd52a209a2f0b59376ad974da3","amp;dn":"Kink.com+The+upperfloor--------14806+-+Lilla+Katt++Nerine+Mech","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"648a9ce6b2d706bd52a209a2f0b59376ad974da3","infoHashBuffer":{"type":"Buffer","data":[100,138,156,230,178,215,6,189,82,162,9,162,240,181,147,118,173,151,77,163]},"announce":[],"urlList":[]}}