{"title":"Encyclopedia of Ocean Science(6Vols){BBS}","uid":6673955,"size":375849636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64ea22ea433aa7290e8f170616f1c85bc8e71a14&amp;dn=Encyclopedia+of+Ocean+Science%286Vols%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315969001,"description":"Superb job of building a hierarchical system of cross-referencing. ... a good addition to any university library, and should certainly be part of the holdings of graduate institutions in the marine science community.&quot;\n-OCEANOGRAPHY\n&quot;... Comprehensive, up-to-date, well illustrated, and well written. ... If you are studying oceanography, or teaching it, do gain access to this set of volumes. You will come to treasure it as a great source of information. ... The main task of the editors, of course, is to define the range of the encyclopedic treatment and the level of the writing, and to find the best possible scientists for producing the entries. These tasks were pursued with resounding success. ... Again, thanks to the editors of Encyclopedia of Ocean Sciences for pulling this through, and congratulations on producing an outstanding reference work.&quot;\n-EOS, Tranactions, American Geophysical Union\n&quot;Destined to become a classic in oceanographic studies, this work achieves its intention to be the most comprehensive, current work in its field. The signed articles, by leading experts in the field, are extensive, well written, and highly informative. Topics covered range from the study of atmospheric input of pollution to the effects of waves on beaches. Many of the articles will not be found in briefer general encyclopedias on this topic. Entries are well indexed and cross-referenced; many list additional citations for further reading. The volumes are well illustrated with graphs, charts, formulas, drawings, and pictures. This will be an extremely useful reference tool for students, educators, or researchers looking for information in oceanographic studies. Highly recommended for all libraries.&quot;\n-CHOICE\n&quot;...A tremendous work of 6 volumes covering a broad range of topics directly and indirectly related to ocean sciences.&quot;\n-E-STREAMS\nNamed by Library Journal as a &quot;2001 Best Reference Source.&quot;\n&quot;This work is, by any measure, the definitive encyclopedia of all the marine sciences. It is edited by international experts, and the dozens of contributors are among the world's best in their fields. ...A good investment for any library with a strong science collection.&quot;\n-AMERICAN REFERENCE BOOKS\nBook Description\nThe definitive resource on all aspects of ocean sciences\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 3399 pages\n    * Publisher: Academic Press; 1st edition (September 20, 2001)\n    * Language: English\n    * ISBN-10: 012227430X\n    * ISBN-13: 978-0122274305","torrent":{"xt":"urn:btih:64ea22ea433aa7290e8f170616f1c85bc8e71a14","amp;dn":"Encyclopedia+of+Ocean+Science%286Vols%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64ea22ea433aa7290e8f170616f1c85bc8e71a14","infoHashBuffer":{"type":"Buffer","data":[100,234,34,234,67,58,167,41,14,143,23,6,22,241,200,91,200,231,26,20]},"announce":[],"urlList":[]}}