{"title":"Sticky Password Pro 5.0.7.252+Serial","uid":7296111,"size":8877622,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:65606859953fa86b9216522be0fae6e16a2f5130&amp;dn=Sticky+Password+Pro+5.0.7.252%2BSerial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"spirebyte","files":2,"time":1337889407,"description":"Sticky Password stores and protects all your personal data (such as passwords, user names, number of IM clients, contact details, telephone numbers, etc.). Sticky Password sticks passwords and accounts with Microsoft Windows applications and Web pages for which they are used. All information is encrypted passwords stored in the database to which access is protected by a master password. Personal data are readily available if the database password is unlocked. After starting a web page or program, Sticky Password automatically enters a password, user name and other personal data. So, you just have to remember one password to remember the rest.\n\nBy default, Sticky Password is loaded at startup. The component is built into the program, which lets you manage your personal data directly from the program.\n\nSticky Password keeps track of programs pazuezurolyami and prevents interception and theft of personal information. This component checks applications that use passwords or require a password from other programs, and then asking you to allow or disallow a suspicious action.\n\nSticky Password security allows you to store, and other information. This could be your passport details, number of different documents, or license keys for your software, configure the Internet - everything is stored securely on Sticky Password.\n &lt;a href=&quot;\nhttp://img651.imageshack.us/img651/8398/2452012204619.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img651.imageshack.us/img651/8398/2452012204619.png&lt;/a&gt;\n\nIn addition, Sticky Password allows you to:\n\nRetain and use your passwords;\nSearch for user accounts, passwords, user names and other personal information in the password database;\nGenerate strong passwords when registering new accounts;\nStore all your passwords on removable media;\nTo recover the password database from a backup;\nProtect passwords from unauthorized access.\nOS: Windows XP, Vista and Windows 7.\n\nChanges in version 5.0.7.252:\n\nAdded compatibility with Firefox on 13 and 14 and Thunderbird 13 and 14\nAdded compatibility with SeaMonkey 2.11\nAdded compatibility with Google Chrome 19 and 20","torrent":{"xt":"urn:btih:65606859953fa86b9216522be0fae6e16a2f5130","amp;dn":"Sticky+Password+Pro+5.0.7.252%2BSerial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65606859953fa86b9216522be0fae6e16a2f5130","infoHashBuffer":{"type":"Buffer","data":[101,96,104,89,149,63,168,107,146,22,82,43,224,250,230,225,106,47,81,48]},"announce":[],"urlList":[]}}