{"title":"Lenon Honor - Transcending Psycho-Sexual Mind Control (2011)","uid":6678986,"size":192332701,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:65ceaefa8d58c64fdf374f8d9983ba61b66e8a89&amp;dn=Lenon+Honor+-+Transcending+Psycho-Sexual+Mind+Control+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"naba888","files":8,"time":1316127804,"description":"Lenon Honor - Transcending Psycho-Sexual Mind Control (2011)\n\n&quot;My name is Lenon Honor and this is the 4th lecture in my 7 hour lecture series titled &quot;Raising up Masculinity, Honoring the Penis, and Embracing Manhood as a Sacred Institution&quot;. There are 5 lectures in the series.&quot;\n\nThis torrent contains &quot;Lecture 4&quot;.\n\nLecture 1: &quot;Raising up Masculinity&quot;\n\n- Knowing your true value as a man\n- Manhood as a sacred institution\n\nLecture 2: &quot;The Healing of Fathers and Sons&quot;\n\n- Breaking the cycles of abandonment\n- Strategies for healing and forgiveness\n- 5 things that every man can do to forgive his father\n\nLecture 3: The Penis and our Sacred Creative Power&quot;\n\n- Reconstructing the value and power of the penis\n- Sex as an act of Creation\n- The Importance of being responsible for all that we create\n\nLecture 4: Male Sexuality and Psycho-Sexual Mind Control\n\n- Transcending media programing concerning male sexuality\n\nLecture 5: To be announced\n\nsource:\n\ndata: duration - 60 min. approx.\n\ncomment: Lenon my be one of the Monarch-children but his insights are highly valuable anyway. Sex obviously plays an important role in society. If you want to control a society then you have to control how people feel about sex, what beliefs they associate with it, what sexual role-models they have, and how they interact with each other in the sexual context. Do I have to tell you that the so called gender issues have been engineered by the elite and their opinion-defining media outlets? If you want to break up families as the smallest social units then you have to redefine how men and women see each other and how their lives are being defined by their sexuality. Think of the gay agenda: Gay couples don't produce any children which nicely plays into the elite's agenda of population reduction. Nothing happens by chance in this system. Most of the so called grassroots movements have been engineered right from the top. It has to look as if it had come up from the basis but that's the look of it only - in truth nothing is what it appears to be in this world. Those who reject the elite's methods of social engineering are being portrayed by their media either as outdated die-hards, as racists or as political extremists in order to discredit them and prevent decent people from taking their convictions seriously. &quot;Pressure from above pressure from below&quot; - But even the pressure from below has been engineered from above. The decent people seeing through these methods of manipulation are being squashed between an authoritarian elite at the top defining the false values of &quot;political correctness&quot; and a highly mind controlled mass of people at the bottom. Masonic-communism has always been the best tool to smash the Christian middle class, the very class that has been the only guarantee for the survival of Constitutional rights. But if you want to destroy people's rights then you do it in the name of the people.\n\ntags: psychology, sex, sexuality, mind control, monarch, mk-ultra, man, male, identity, psychotherapy, gender, indoctrination, social, engineering, penis","torrent":{"xt":"urn:btih:65ceaefa8d58c64fdf374f8d9983ba61b66e8a89","amp;dn":"Lenon+Honor+-+Transcending+Psycho-Sexual+Mind+Control+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65ceaefa8d58c64fdf374f8d9983ba61b66e8a89","infoHashBuffer":{"type":"Buffer","data":[101,206,174,250,141,88,198,79,223,55,79,141,153,131,186,97,182,110,138,137]},"announce":[],"urlList":[]}}