{"title":"Fat Ciity [1972] John Huston","uid":6683847,"size":730782302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:68082337a10b835739c3dd0783e5dd3b360f3da7&amp;dn=Fat+Ciity+%5B1972%5D+John+Huston&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1316325599,"description":" &lt;a href=&quot;http://bayimg.com/DaKGjaAdB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/DaKGjaAdB&lt;/a&gt;\n\nFat City (1972) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068575/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068575/&lt;/a&gt;\n\nFat City (1972) is an American neo-noir boxing drama film directed by John Huston. The picture stars Stacy Keach, Jeff Bridges, and Susan Tyrrell.\n\nThe movie, one of John Huston's later films, is based on the boxing novel Fat City (1969) by Leonard Gardner, who also wrote the screenplay.\n\nTyrrell received an Oscar nomination as the alcoholic, world weary Oma.\n\nFew studio-era directors' careers survived the freewheeling 1970s, a time when successful filmmakers were more likely to be recent college graduates than weathered craftsmen. But John Huston made some exceptionally challenging films during the me-decade, and would continue to do so until the end of his life. Fat City (1972), which stars Stacy Keach and Jeff Bridges as a couple of down-and-out boxers, is one of the more uncompromising movies of the period. It isn't mentioned in the same breath as such Huston classics as The Treasure of the Sierra Madre (1948) or The African Queen (1951), but this gritty little movie is definitely not the work of an obsolete director.\n\nFat City stars Stacy Keach as Billy Tully, an alcoholic boxer who's desperately trying for a small-time comeback in the sleepy-bordering-on-depressing town of Stockton, California. Tully's sidekick is Ernie Munger (Jeff Bridges), a nave younger man who, quite unwisely, is also pursuing a career in the ring (his first, very brief bout, is a comic highlight of the film.) Billy and Ernie are joined in their pursuit of the tarnished brass ring by Oma (Susan Tyrrell), another barfly who sets up house with Billy. The narrative, as is the case with so many great films from the period -- think Badlands (1973) and Taxi Driver (1976) is more concerned with how these variously fractured souls deal with their environment, rather than adhering to a strict three-act structure.\n\nHuston knew a thing or two about the fight game- for a brief time during his youth, he was a semi-professional boxer in Los Angeles. He once claimed in an interview that he attended Lincoln Heights High School because of its superior boxing program, even though it was in a decidedly rough part of town. Reputedly three world champions (he doesn't name them, so who knows if it's true) eventually graduated from the school. &quot;I remember there was a place (in the area) called Madison Square Gardens and it was on Central Avenue, which was a black community. They used to make up posters for the fights - make up weights. The fighters would go round the night of the fight and pick out names...If you had red hair, you'd be Red O'Reilly, something like that. I remember fighting there one night under two different names!&quot; Huston even cast a few of his boxing buddies from the old days as supporting players in Fat City.\n\nBoth Keach and Bridges told writer Lawrence Grobel that what you're seeing during Fat City's fight scenes is often very real. Keach said that, after carefully staging a bout beforehand, Huston apparently had a change of heart and shouted, &quot;All right boys, now we're just going to have two minutes of boxing. Just go out there and fight!&quot; Keach was rightfully terrified. &quot;Every time I hit this guy,&quot; he said, &quot;he couldn't help it, his left hand would come out and he really got me good. That shot is in the film. There's nothing fake about it, when I go down to the mat, it's real!&quot; Bridges simply got popped so many times, he started to bleed from a nasty cut on his head.\n\nIn the end, it was all worthwhile. Fat City received rave reviews across the board in most cases. The Los Angeles Times called it &quot;one of (Huston's) best films in years, and one of the best he has ever done: a lean, compassionate, detailed, raucous, sad, strong look at some losers and survivors on the side streets of small-city Middle America.&quot; All of the actors received praise, and Tyrrell was even nominated for an Oscar for Best Supporting Actress.\n\nHuston, as much as anyone, was surprised when Fat City became a commercial success- he hadn't had a real hit in a while. &quot;I believed very much in the film,&quot; he said, &quot;but would have been happy if it was well received by a selective audience.&quot; He didn't feel the characters were too depressing to be popular, either. &quot;Personally, I admire the down-and-outers depicted in the film, people who have the heroism to take it on the chin in life as well as in the ring.&quot;\n\nWatch Fat City and marvel at an old filmmaking heavyweight as he enters the final rounds of his illustrious career with his killer instinct intact.\n\nLike the novel, the film was set in Stockton, California and shot mostly on location there. All of the original skid row area depicted in the novel was demolished (West End Redevelopment) from 1965-69. Most of the skid row scenes were filmed in the outer fringe of the original skid row area, but would have been torn down a year after Fat City was filmed for the construction of the Crosstown Freeway aka &quot;Ort Lofthus Freeway&quot;.\n\nThe drama is featured in the documentary Visions Of Light: The Art Of Cinematography (1992) for Conrad L. Hall's use of lighting.\n\nThe melancholy &quot;Help Me Make It Through the Night&quot; is sung by Kris Kristofferson at the beginning and end of the movie.\n\nVincent Canby, film critic for The New York Times, liked the film and John Huston's direction. He wrote, &quot;This is grim material but Fat City is too full of life to be as truly dire as it sounds. Ernie and Tully, along with Oma (Susan Tyrrell), the sherry-drinking barfly Tully shacks up with for a while, the small-time fight managers, the other boxers and assorted countermen, upholsterers, and lettuce pickers whom the film encounters en route, are presented with such stunning and sometimes comic accuracy that Fat City transcends its own apparent gloom.&quot;\n\nRoger Ebert made the case for it as one of John Huston's best films. He also appreciated the performances. Ebert wrote, &quot;[Huston] treats [the story] with a level, unsentimental honesty and makes it into one of his best films...[and] the movie's edges are filled with small, perfect character performances.&quot;\n\nFilm critic Dennis Schwartz also liked the film and wrote, &quot;The downbeat sports drama is a marvelous understated character study of the marginalized leading desperate lives, where they have left themselves no palpable way out. The stunning photography by Conrad Hall keeps things looking realistic.&quot;\n\nIn 2009, the film enjoyed a week-long revival screening at New York City's Film Forum.\n\nThe film is one of the few films that garnered a 100% fresh rating on Rotten Tomatoes, based on seventeen reviews.\n\n\nProducer: Ray Stark, John Huston\nDirector: John Huston\nScreenplay: Leonard Gardner (based on his novel)\nCinematography: Conrad Hall\nEditing: Margaret Booth\nMusic: Marvin Hamlisch\nProduction Design: Richard Sylbert\nSpecial Effects: Paul Stewart\nSet Design: Morris Hoffman\nCostume Design: Dorothy Jeakins\nPrinciple Cast: Stacy Keach (Billy Tully), Jeff Bridges (Ernie Munger), Susan Tyrrell (Oma), Candy Clark (Faye), Nicholas Colasanto (Ruben), Art Aragon (Babe), Curtis Cokes (Earl), Sixto Rodriguez (Lucero), Billy Walker (Wes), Wayne Mahan (Buford), Ruben Navarro (Fuentes).\nC-100m.\n","torrent":{"xt":"urn:btih:68082337a10b835739c3dd0783e5dd3b360f3da7","amp;dn":"Fat+Ciity+%5B1972%5D+John+Huston","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68082337a10b835739c3dd0783e5dd3b360f3da7","infoHashBuffer":{"type":"Buffer","data":[104,8,35,55,161,11,131,87,57,195,221,7,131,229,221,59,54,15,61,167]},"announce":[],"urlList":[]}}