{"title":"National Geographic Chanel Wild Russia  4,5 en6 NL Subs Engels a","uid":6539795,"size":3196833151,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6bcd52a565413c8acb3a5eec0f589470bf332a6c&amp;dn=National+Geographic+Chanel+Wild+Russia++4%2C5+en6+NL+Subs+Engels+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1310604248,"description":"National Geographic Chanel Wild Russia  4,5 en6 NL Subs Engels audio\n\nOntdek de betoverende schoonheid van de natuur in Rusland.\n\nRusland bezit ÃƒÂ©ÃƒÂ©n van de grootste wildernissen ter wereld. Van dodelijke roofdieren \nals de ijsbeer en de Amoertijger tot de bijzondere Siberische salamander, die \njarenlang in bevroren ijs kan overleven. De nieuwe zesdelige serie 'Wild Russia' \nlaat de natie in al haar natuurlijke pracht zien. Het diverse landschap van Rusland \nwordt gekenmerkt door gebieden met ijs en vulkanen, dorre woestijn, hoge bergen en \nsubtropische temperaturen. Met prachtige cinematografie word je op een adembenemende \nreis door Rusland genomen.\n\nOVERZICHT AFLEVERINGEN:\n\nWild Russia: Siberia 1\nSiberiÃƒÂ« is rijk aan opmerkelijke wilde dieren, zoals salamanders, dromedarissen en \nzelfs muskusherten, die geliefd zijn vanwege hun geurstof.\n\nWild Russia: Kamchatka 2\nActieve vulkanen vormen het landschap van het schiereiland Kamtsjatka, waar arenden \nen beren genieten van de rijkdom van het Koerilenmeer.\n\nWild Russia: The Great Divide 3\nGa mee naar de Russische Kaukasus en geniet van het overweldigende landschap van \nbesneeuwde heuvels, dorre woestijnen en bloeiende alpine weiden.Wild Russia:\n\nKamchatka Wild Russia: Arctic 4\nDe wilde dieren hebben het niet gemakkelijk in het Russische poolgebied, vanwege de \nextreme temperaturen en de immer hongerige roofdieren.\n\nWild Russia: The Secret Forest 5\nDit is het sprookjesachtige Ussuriland-woud. Er leven allerlei fascinerende dieren, \nzoals twee zeer zeldzame en bedreigde soorten wilde katten.\n\nWild Russia: Primeval Valleys 6\nTrek door de majestueuze oerbossen van de Oeral, een streek waar niet alleen \nreusachtige herten gedijen, maar ook allerlei kleinere dieren.\n\nDiscover the enchanting beauty of nature in  Russia.\nRussia has one of the largest wilderness in the world. Of lethal predators like the \npolar bear and the Amur tiger salamander to the special Siberian, who spent years in \na frozen ice can survive. The new six-part series &quot;Wild Russia&quot; leave the nation in \nall its natural splendor. The diverse landscape of Russia is characterized by areas \nwith ice and volcanoes, barren deserts, high mountains and subtropical temperatures. \nWith beautiful cinematography, you are on a breathtaking journey taken by Russia.\n\nEPISODE:\n\nWild Russia: Siberia 1\nSiberia is rich in remarkable wildlife such as salamanders, camels and even musk \ndeer, which are popular for their fragrance.\n\nWild Russia: Kamchatka 2\nActive volcanoes forming the landscape of the Kamchatka Peninsula, where eagles and \nbears enjoy the richness of the Kuril Lake.\n\nWild Russia: The Great Divide 3\nGo along to the Russian Caucasus and enjoy the stunning scenery of snow-covered \nhills, barren deserts and lush alpine weiden.Wild Russia:\n\nKamchatka Wild Russia: Arctic 4\nThe wild animals do not have it easy in the Russian Arctic, because of the extreme \ntemperatures and the ever hungry predators.\n\nWild Russia: The Secret Forest 5\nThis is the fairytale forest Ussuriland. There live many fascinating animals, \nincluding two very rare and endangered species of wild cats.\n\nWild Russia: Primeval Valleys 6\nTravel through the majestic forests of the Urals, a region where deer thrive not \nonly huge but also many smaller animals.\n\n\nSpotinformatie\n\nFilm Specificaties:\n\n- Video: 1920*1280\n- Audio: English (AC3 DD5.1)\n- Subs: Nederlands\n- Container: x264 MKV\n- Lengte: 47 minuten per aflevering.\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\n","torrent":{"xt":"urn:btih:6bcd52a565413c8acb3a5eec0f589470bf332a6c","amp;dn":"National+Geographic+Chanel+Wild+Russia++4%2C5+en6+NL+Subs+Engels+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bcd52a565413c8acb3a5eec0f589470bf332a6c","infoHashBuffer":{"type":"Buffer","data":[107,205,82,165,101,65,60,138,203,58,94,236,15,88,148,112,191,51,42,108]},"announce":[],"urlList":[]}}