{"title":"Smart Money (1931) FULL DVD (ISO)","uid":7214681,"size":5051645998,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6c57624eb50d65223aa1a0ff86790c9c1770da3a&amp;dn=Smart+Money+%281931%29+FULL+DVD+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Auge","files":-1,"time":1335342422,"description":"Smart Money (1931) FULL DVD (ISO)\n\n*** \nI use a Transfer Cap and upload 7 gigs a day. This is why I upload a new torrent every other day or so. I do this to keep my IP off my back as they have initiated a monthly limit. It usually takes me two days to fully seed a torrent so please be patient. \n***\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n\n1931\n81 minutes\nBlack &amp; White \n1.33:1\nSpoken Language: English \nSubtitles: English, French \n\n(DVD-9)\n\nDirector: \nAlfred E. Green\n\nCast: \nEdward G. Robinson, James Cagney, Margaret Livingston, Ralf Harolde, Noel Francis, Evalyn Knapp, Maurice Black, Billy House, Paul Porcasi\n\nDisc Features:\n* Commentary by film historians Alain Silver and James Ursini\n* Vintage newsreel\n* Musical short George Jessel and His Russian Art Choir\n* The Smart Set-Up\n* Classic cartoon Big Man from the North\n\nSYNOPSIS:  \nEdward G. Robinson and James Cagney were teamed up for the only time in their careers in Smart Money. Robinson has the larger part of a small-town barber who fancies himself a big-time gambler. He travels to the Big City carrying ten grand from backers at home with his younger brother (Cagney), who comes along as his bodyguard. Unfortunately Robinson has a weakness for beautiful blondes, which means trouble with a capital T. Watch closely in the first reel for an unbilled appearance by Boris Karloff as a dope pusher. Smart Money was Oscar nominated for Best Original Screenplay.\n\n*** \nI upload my torrents to The Pirate Bay and Demonoid, if you would like to upload one of my torrent files to another tracker feel free, all I ask is that you upload the same torrent file you downloaded by clicking on one of my links so that more seeders/peers are in the swarm.  \n***\n","torrent":{"xt":"urn:btih:6c57624eb50d65223aa1a0ff86790c9c1770da3a","amp;dn":"Smart+Money+%281931%29+FULL+DVD+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c57624eb50d65223aa1a0ff86790c9c1770da3a","infoHashBuffer":{"type":"Buffer","data":[108,87,98,78,181,13,101,34,58,161,160,255,134,121,12,156,23,112,218,58]},"announce":[],"urlList":[]}}