{"title":"Big.And.Real.XXX.DVDRip.XviD-Pr0nStarS","uid":7216499,"size":1471988245,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6cb1c193a123d2b42f881a8914b296e1cd225b00&amp;dn=Big.And.Real.XXX.DVDRip.XviD-Pr0nStarS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"tom2211","files":-1,"time":1335394426,"description":"2011 DVDRip\n\nDominno, Rita, Carmen Croft, Zita\n\n\nSuave French porn stud/director David Perry has a special treat for fans of large, all-natural funbags. For Big and Real, his third release in the Buttman Magazine Choice line, the veteran sex machine has assembled a showcase of the bounciest, most mouth-watering hooters on the European continent. These wobbly, squeezable jugs come out swinging, with nary a trace of silicon! First, the director has his way with fleshy blonde BBW Kristal Swift's pendulous knockers. She's spilling out of a tiny bikini, jiggling her chest, fondling and sucking her own boobs. Kristal masturbates for the camera, then swallows David's hard cock. This plush slut rides his dick and wraps her tits around his shaft, finally taking a load of semen on her heaving chest. Next, top-heavy Zita is a zaftig cutie-pie who shows off her massive breasts and phat ass, then smears cream all over her shiny globes. Dave squirts whipped cream on her cleavage as she slurps his boner and tit-wanks him to climax. Tattooed Dominno rocks a tiny #FF0000 bikini and uses her impressive assets to satisfy Mike Angelo, who cums on her huge, soft boobies. Thick, womanly Rita teases Dave with her bobbing udders and massive, round, solid ass. Rita sucks his dick and delivers an epic titfuck that leaves her fine mammaries coated with jism. And sultry, exotic sexpot Carmen Croft has a set of cushiony pillows that really coax the cum out of Italian stud Claudio Pedro. These beautiful tits are big, real and real big! 2 hours 42 mins and ten sec","torrent":{"xt":"urn:btih:6cb1c193a123d2b42f881a8914b296e1cd225b00","amp;dn":"Big.And.Real.XXX.DVDRip.XviD-Pr0nStarS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cb1c193a123d2b42f881a8914b296e1cd225b00","infoHashBuffer":{"type":"Buffer","data":[108,177,193,147,161,35,210,180,47,136,26,137,20,178,150,225,205,34,91,0]},"announce":[],"urlList":[]}}