{"title":"Tips and Traps for Hiring a Contractor{BBS}","uid":6668368,"size":3278665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d651c64f3fe3a70580f7f4b6007b4551d3365db&amp;dn=Tips+and+Traps+for+Hiring+a+Contractor%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315784459,"description":"Don't get ripped off when hiring a contractor! Do get the results you want, at a fair price! You can avoid being a victim of unscrupulous contractors with this homeowner-empowering guide from one of the most respected figures in construction. R. Dodge Woodson, a 30-year contracting veteran and the author of many books in the field, makes it simple to learn: how to sort the competent professionals from the con artists who want your business; how to get the best possible deal on the work you want done; and, how to work successfully with contractors through every stage, from planning to final payment. In addition, by using the insider's information in this book, you can make expert decisions on quality, materials, and costs. Packed with features designed to make it easy for homeowners to use, this guide helps you: screen and hire honest, skilled home improvement professionals; spot and eliminate 'bad apples' before you sign anything; make the bidding process work for you; negotiate effectively; get all the necessary details in writing; estimate costs, with easy-to-use charts on labor and materials; understand plans and specifications; choose materials to be used in your addition, remodeling job, or maintenance project; understand the tradeoffs in site, design, planning, and maintenance options; make sound on-the-spot decisions; keep your contractor on the straight and narrow - on time and on budget; and, create a punch list. It is filled with dollar saving tools for the homeowner. Sample checklists, forms, and contracts make it easier to handle every aspect of your home improvement projects. Highlighted tips and traps help you avoid money pits. Even if you have no prior experience with construction, remodeling, or professional home maintenance, this book can help you get your jobs done right - at the right cost!\nFrom the Back Cover\nDON'T GET RIPPED OFF WHEN HIRING A CONTRACTOR! DO GET THE RESULTS YOU WANT, AT A FAIR PRICE!\n\nYou can avoid being a victim of unscrupulous contractors with this homeowner-empowering guide from one of the most respected figures in construction. R. Dodge Woodson, a 30-year contracting veteran and the author of many books in the field, makes it simple to learn how to sort the competent professionals from the con artists who want your business; how to get the best possible deal on the work you want done; and how to work successfully with contractors through every stage, from planning to final payment\n\nIn addition, by using the insider's information in this book, you can make expert decisions on quality, materials, and costs. Packed with features designed to make it easy for homeowners to use, this guide helps you--\n\n    * Screen and hire honest, skilled home improvement professionals\n    * Spot and eliminate &quot;bad apples&quot; BEFORE you sign anything\n    * Make the bidding process work for you\n    * Negotiate effectively\n    * Get all the necessary details in writing\n    * Estimate costs, with easy-to-use charts on labor and materials\n    * Understand plans and specifications\n    * Choose materials to be used in your addition, remodeling job, or maintenance project\n    * Understand the tradeoffs in site, design, planning, and maintenance options\n    * Make sound on-the-spot decisions\n    * Keep your contractor on the straight and narrow -- on time and on budget\n    * Create a punch list \n\nFILLED WITH DOLLAR SAVING TOOLS FOR THE HOMEOWNER\nSample checklists, forms, and contracts make it easier to handle every aspect of your home improvement projects. Highlighted tips and traps help you avoid money pits. Even if you have no prior experience with construction, remodeling, or professional home maintenance, this book can help you get your jobs done right -- at the right cost!\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 224 pages\n    * Publisher: McGraw-Hill Professional; 1 edition (April 6, 2005)\n    * Language: English\n    * ISBN-10: 0071445846\n    * ISBN-13: 978-0071445849","torrent":{"xt":"urn:btih:6d651c64f3fe3a70580f7f4b6007b4551d3365db","amp;dn":"Tips+and+Traps+for+Hiring+a+Contractor%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d651c64f3fe3a70580f7f4b6007b4551d3365db","infoHashBuffer":{"type":"Buffer","data":[109,101,28,100,243,254,58,112,88,15,127,75,96,7,180,85,29,51,101,219]},"announce":[],"urlList":[]}}