{"title":"Peep Show - Complete Series 1-5","uid":7228989,"size":7324156535,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6e1297fe9be7c7de0a1031267d500b703468fef6&amp;dn=Peep+Show+-+Complete+Series+1-5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":31,"time":1335775338,"description":"Peep Show is a British sitcom starring David Mitchell and Robert Webb. The television programme is written by Jesse Armstrong and Sam Bain, with additional material by Mitchell and Webb amongst others. It has been broadcast on Channel 4 since 2003. The show's seventh series (broadcast late 2010) makes it the longest-running sitcom in Channel 4 history. On 17 December 2010 it was confirmed that the show had been renewed for both an 8th and 9th series, but that they would not be aired until at least mid-2012 due to the writers being busy with other projects. Stylistically, the show uses point of view shots with the thoughts of main characters Mark and Jeremy audible as voiceovers.\n\nPeep Show follows the lives of two men in their thirties, Mark Corrigan (Mitchell), employed as a loan manager, and Jeremy Usborne (Webb), an unemployed musician. The pair met at the fictional Dartmouth University, and now share a flat in Croydon, South London. Mark is initially a loan manager at the fictional JLB Credit, later becoming a waiter. He is financially secure, but awkward and socially inept, with a pessimistic and critical attitude. Jeremy, having split up with his girlfriend Big Suze prior to the first episode, now lives in Mark's spare room. He usually has a much more optimistic and energetic outlook on the world than Mark, yet his self-proclaimed talent as a musician is yet to be recognised, and he is not as popular or attractive as he would like to think himself, although he is more successful with the opposite sex than Mark.","torrent":{"xt":"urn:btih:6e1297fe9be7c7de0a1031267d500b703468fef6","amp;dn":"Peep+Show+-+Complete+Series+1-5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e1297fe9be7c7de0a1031267d500b703468fef6","infoHashBuffer":{"type":"Buffer","data":[110,18,151,254,155,231,199,222,10,16,49,38,125,80,11,112,52,104,254,246]},"announce":[],"urlList":[]}}