{"title":"Uncle John Turner Texas Blues(blues)(mp3@320)[rogercc]","uid":6544799,"size":88727255,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e44b2fbb48bf036f4eef3ba6578910cbe87c98c&amp;dn=Uncle+John+Turner+Texas+Blues%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":14,"time":1310811825,"description":"Uncle John Turner  Texas Blues \nLabel: Great Blues Recordings\nCD Released:2007\nFormat: Mp3@320\n\nLegendary Texas Blues Drummer &amp; Vocalist &quot;Uncle&quot; John Turner is joined by his old band mate Johnny Winter for some blistering interpretations of old songs from Texas and Louisiana\n\nUncle John Turner was born and raised in Port Arthur, Texas. He first played drums with Jerry LaCroix. Unc met the Winter brothers and performed with them a few times as a substitute. In 1968, Unc convinced Johnny to try a full blown blues band and sent for his friend Tommy Shannon to play bass. This group quickly got natonal recognition and began making records and shortly after that played Woodstock, with Edgar Winter as the fourth member.\nBy late 1970, they had split up and Uncle John and Tommy moved to Austin and formed a band called Krackerjack, which had Stevie Ray Vaughan as one of the major guitarists, along with Jesse Taylor, John Stahely, and Robin Syler.\nUnc then moved to Houston for a while and made records with Isaac Payton Sweat, Ezra Charles, and Joey Long and played and recorded the next four years with Alan Haynes.\nAfter this, Johnny Winter, Tommy Shannon, and Uncle John did some recording on Johnny's Third Degree album.\nUncle John then joined Paul Orta and made three albums with him before he and Appa Perry began the Blues Power project, which was Uncle John and Appa and different artists, including Alan Haynes, Mike Keller, Matt Farrell, Matthew Robinson, John McVey, Mark Goodwin, Erin &quot;Icewater&quot; James, Eve Monsees, Gary Clark Jr., Shawn Pittman, Nick Gibson, and others.\nUncle John has jammed with B. B. King, Jimi Hendrix, Freddie King, Muddy Waters, Junior Wells, Lightnin' Hopkins, Johnny Copeland, Albert Collins, James Montgomery, Paul Nelson. and many more. Unc has also recorded with Walter &quot;Shakey&quot; Horton, Willie Dixon, Albert Collins, Nuno Mindelis (the Blues King of Brazil), BenoÃƒÂ®t Blue Boy (the godfather of French blues), Lazy Lester, and many more.\n\n\nTracklist\n\n1 Roll, Roll, Roll \n2 Just a Little Bit \n3 Divorce Court\n4 Drivin' Wheel \n5 You're Humbugging Me \n6 I Got It Made \n7 They Call Me Lazy \n8 Allons Dancez\n 9 Shoulder Holster \n10 Hey Senorita \n11 T Bone Intentions \n12 I-10 Hurricane Blues \n13 Oooh Poo Pa Doo\n","torrent":{"xt":"urn:btih:6e44b2fbb48bf036f4eef3ba6578910cbe87c98c","amp;dn":"Uncle+John+Turner+Texas+Blues%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e44b2fbb48bf036f4eef3ba6578910cbe87c98c","infoHashBuffer":{"type":"Buffer","data":[110,68,178,251,180,139,240,54,244,238,243,186,101,120,145,12,190,135,201,140]},"announce":[],"urlList":[]}}