{"title":"Celeron Dude Uploader v6.3.5.","uid":7277887,"size":1584796,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6f2d924641e12b7d6bf97504312f618b06c7ebaf&amp;dn=Celeron+Dude+Uploader+v6.3.5.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gucci17","files":1,"time":1337349345,"description":"Uploader v6\n\nThis script allows you to run a &quot;file hosting&quot; service on your web server. For a demonstration of the script and of the latest version, visit CDUpload.com.\nFeatures\n\nThis is a short list of important features. The full feature list for the latest version is available here. For a demo of these features in action, check out CDUpload.com.\n\n    User registration with individual account space and bandwidth allocation/limit. Each account has its own seperate storage space. You can manage them with the web based admin tools.\n    Bandwidth tracking and limiting (requires mod_rewrite which means Apache)\n    IIS servers with ISAPI_Rewrite will need to port the rewrite rules. The syntaxes are VERY similar to each other so if you can do it you can ignore this requirement.\n    Batch file uploading, either by selection or by Zip file (requires gzip in PHP).\n    Version 6.1 requires the additional Zip extension. Version 6.2 and after do not. Versions prior to 6.1 does not support batch uploading through Zip files.\n    Image galleries, or photo folder, with thumbnails and slideshows. The GD graphics library (version 2) extension for PHP is required for thumbnail creation. Photo folder feature is only available in version 6.2 and up. Slideshow feature is only available in version 6.3 and up.\n    Fully skinnable via template files. Two basic template sets are included.\n","torrent":{"xt":"urn:btih:6f2d924641e12b7d6bf97504312f618b06c7ebaf","amp;dn":"Celeron+Dude+Uploader+v6.3.5.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f2d924641e12b7d6bf97504312f618b06c7ebaf","infoHashBuffer":{"type":"Buffer","data":[111,45,146,70,65,225,43,125,107,249,117,4,49,47,97,139,6,199,235,175]},"announce":[],"urlList":[]}}