{"title":"Seether-Holding_Onto_Strings_Better_Left_To_Fray-(Retail)-2011-H","uid":6673246,"size":106903878,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6f5deb02a89aab88d0e463b7c2e6e3aec46d6725&amp;dn=Seether-Holding_Onto_Strings_Better_Left_To_Fray-%28Retail%29-2011-H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"raidy","files":19,"time":1315944064,"description":"HAPPY HACKER INDUSTRIES [HHI]\n\nRELEASE INFO\n\nArtist......: Seether\nAlbum.......: Holding onto strings better left to fray\nGrabber     : EAC\nEncoder.....: LAME v3.90.3\nRelease Date: May-17-2011\nRip Date....: Sep-11-2011\nGenre.......: Rock\nQuality     : VBRkbps / 44.1kHz / Joint-Stereo\nPlaytime    : 61:32 min\nRipper      : Happy Hacker Industries [HHI]\nCD Songs    : 16\nLabel.......: Wind-Up\nReleaseNotes:\n\nHolding onto Strings Better Left to Fray further expands on the dynamic musical growth curve heard on Seether's 2007 release, Finding Beauty in Negative Spaces, while maintaining a sonic imprint that is undeniably Seether. There are many reasons to be excited. Not only does Seether branch out stylistically on the album s first single, &quot;Country Song&quot; which blends a buoyant, aurally addictive hook with the band's signature searing guitar work but the singer's striking new vocal approach is audible from the album's exhilarating lead track, &quot;No Resolution.&quot; Morgan explains, &quot;On this album, I didn't scream very much, because that's not\nwhat I wanted to do. For some of the songs, the sentiment behind the lyric wasn't angry, therefore to sing it in an angry way didn't make any sense to me. The gritty stuff is easy to do, but it also feels really great to convey emotionally, through my voice, what I'm trying to say, instead of just being a one trick pony.&quot; The result is a collection of compelling vocal performances that conjure an appealing blend of two of Morgan's chief influences, Kurt\nCobain and Tool's Maynard James Keenan. \n\nRecorded at Blackbird Studios in Nashville, Seether definitely had an all-star player on its team for Holding Onto Strings Better Left to Fray in the form of producer Brendan O'Brien (Rage Against the Machine, AC/DC, Pearl Jam). Seether fans identify the band with songs that are not only sonically heavy but which also carry a lyrical emotional heft. Rest assured that those qualities are still intact on Holding Onto Strings Better Left to Fray. &quot;Down&quot; providing a fantastic showcase for John Humphrey's Bonham-esque drumming along with &quot;Desire for Need&quot; (on which Morgan falls back on the aggressive vocal delivery) prove that Seether have not strayed too far from what fans recognize as the band's aural identity. &quot;Master of\nDisaster&quot; also retains the original Seether imprint while introducing new musical elements, which the band set out to do with each song, &quot;so people wouldn t know what to expect,&quot; Morgan interjects. &quot;When we make a new album, it has to be superior to the previous one; otherwise we re wasting everyone's time.\n\nWe rip the descriptions from sites like cduniverse, allmusic and amazon.\nHHI presents no opinion on the artists work; only the quality of the rip. :)\n\nTrack Listing....:\n01.Fur cue                                              [03:48]\n02.No resolution                                        [03:08]\n03.Here and now                                         [03:56]\n04.Country song                                         [03:50]\n05.Master of disaster                                   [04:19]\n06.Tonight                                              [03:44]\n07.Pass slowly                                          [03:28]\n08.Fade out                                             [03:54]\n09.Roses                                                [04:18]\n10.Down                                                 [03:57]\n11.Desire for need                                      [03:34]\n12.Forsaken                                             [04:21]\n13.Dead seeds                                           [04:03]\n14.Yeah                                                 [04:29]\n15.Nobody                                               [03:08]\n16.Effigy                                               [03:35]\n____\n\n61:32 min\n101,9 MB\n\nGREETS\n\nEveryone that has supported us over the years.  You know who you are.\nShouts to the crew at http://www.bidnshop.com If you wanna save some of that hard earned cash you've got and still buy some nice things, check them out. Bidding starts at a penny! The PIN code is: 1985 [Ed's Notes]","torrent":{"xt":"urn:btih:6f5deb02a89aab88d0e463b7c2e6e3aec46d6725","amp;dn":"Seether-Holding_Onto_Strings_Better_Left_To_Fray-%28Retail%29-2011-H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f5deb02a89aab88d0e463b7c2e6e3aec46d6725","infoHashBuffer":{"type":"Buffer","data":[111,93,235,2,168,154,171,136,208,228,99,183,194,230,227,174,196,109,103,37]},"announce":[],"urlList":[]}}