{"title":"Fable: The Lost Chapters","uid":6681645,"size":57311963,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6fccf2252ac1b5c3c89fed2958dfb09601b94d00&amp;dn=Fable%3A+The+Lost+Chapters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SkyMason","files":7,"time":1316216593,"description":"Based on the best selling award winning Xbox title &quot;Fable&quot;, &quot;Fable: The Lost Chapters&quot; is now fully optimized for the Windows platform complete with expanded content, greater customization, new quests and enhanced graphics. In this groundbreaking role-playing adventure game from Lionhead Studios, your every action determines your character's skills, appearance and morality. Your character's life story is created from childhood through to adulthood and on to old age. Grow from an inexperienced child into the most powerful being in the world, spoken of by all and immortalized in legend. As additional story and side quests await, choose the path of righteousness, or dedicate your life to evil, and see yourself transform into a reflection of your actions and decisions. Age leaves you wizened and battle leaves you scarred as you explore the world of Albion and the plethora of expanded and enhanced content.\n\nWith experience comes advancement and physical change, whether it be expanding muscles, a keen eye and nimble form, or the buzz of magical energies around your finger tips. As you develop your alter ego, the world reacts to you and your actions. People comment on your successes and failures, your appearance, and your behavior. &quot;Fable: The Lost Chapters&quot; offers Windows gamers even more character customization choices that will impact your appearance. The denizens of Albion's many opinions are expressed through applause, mockery, trepidation, panic, and even flirtation if they feel so inclined. Each person you aid, each flower you crush, each creature you slay, will change this world forever. In &quot;Fable: The Lost Chapters&quot;, gamers decide: &quot;Who will I be?&quot;\nDetails\n\nPublisher: Microsoft Game Studios\nDeveloper: Lionhead Studios\nFormat: CD-ROM for the MicrosoftÃ‚Â® Windows XP operating systems\nESRB Rating: Mature (17+)\nBBFC Rating: 15\nAvailability: Fall 2005","torrent":{"xt":"urn:btih:6fccf2252ac1b5c3c89fed2958dfb09601b94d00","amp;dn":"Fable%3A+The+Lost+Chapters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fccf2252ac1b5c3c89fed2958dfb09601b94d00","infoHashBuffer":{"type":"Buffer","data":[111,204,242,37,42,193,181,195,200,159,237,41,88,223,176,150,1,185,77,0]},"announce":[],"urlList":[]}}