{"title":"Indian Ocean   (BBC 2012 - Part 3)","uid":7288089,"size":747795153,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7172fb9d2b4a2a64efa213ad06ca9986052dabfb&amp;dn=Indian+Ocean+++%28BBC+2012+-+Part+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lucybabe","files":4,"time":1337642965,"description":"\nBBC Indian Ocean With Simon Reeve 3 of 6\nKenya And The Horn Of Africa 2012\n\n &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/p00rdjvn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/p00rdjvn&lt;/a&gt;\n\nThe third leg of Simon ReeveÃ†s journey is the most dangerous, as he travels to\nMogadishu, the war-torn capital of Somalia. But he starts off in the south of\nKenya and travels up the Indian Ocean coast to Mombasa, then on to the\nbeautiful Tana Delta, where he meets villagers facing eviction from the area,\nwhich the government is turning over to sugar cane production for bio-fuels.\nHeading north to the stunning and remote island of Kiwayu, Simon meets women\nwho make a living from making handicrafts from the mountains of plastic\npollution that fetches up on their beach. It is evidence of one of the greatest\nthreats to the Indian Ocean and all the world's oceans - the millions of tons\nof plastic waste washing around in our seas. But Kiwayu is also the site of the\ntragic murder of British tourist David Tebbutt and the kidnapping of his wife\nJudith by Somali pirates. Next Simon heads to the source of the piracy epidemic\nthat plagues the Indian Ocean - Somalia. In war torn Mogadishu Simon travels\nwith Ugandan soldiers from the African peace keeping force AMISOM. After years\nof anarchy and violence, the soldiers are the latest attempt to bring peace and\nstability to the country. On the frontline, with bullets flying around, Simon\nlearns that the peace keepers are actually fighting a bloody war with al\nShabaab, a violent Islamist militia linked to al Qaeda. But lacking even\nhelicopters, AMISOM are struggling to overcome their opponents in a country\nthat is at the epicentre of piracy and, increasingly, a source of international\nterrorism. Neighbouring Somaliland could not be more different. The &quot;country&quot;\ndeclared its independence in 1991 but is not recognised by the rest of the\nworld. However it is stable and democratic, and is home to thousands of Somalis\nfleeing fighting and famine. Simon joins a group of young refugees from a camp\non a trip to see the sea for the very first time. It is a moving ending to a\ndramatic Indian Ocean journey.\n\n-------------------------------------------------------------------------------\nA short sample is included for evaluation.\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:7172fb9d2b4a2a64efa213ad06ca9986052dabfb","amp;dn":"Indian+Ocean+++%28BBC+2012+-+Part+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7172fb9d2b4a2a64efa213ad06ca9986052dabfb","infoHashBuffer":{"type":"Buffer","data":[113,114,251,157,43,74,42,100,239,162,19,173,6,202,153,134,5,45,171,251]},"announce":[],"urlList":[]}}