{"title":"Memphis Shakedown - More Jug Band Classics (4CD, JSP)","uid":7392054,"size":278000045,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71fbe825fb87859b737e69e1999f41a7f5d3004d&amp;dn=Memphis+Shakedown+-+More+Jug+Band+Classics+%284CD%2C+JSP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mudmashers","files":107,"time":1340809901,"description":"Memphis Shakedown: More Jug Band Classics [JSP] (4CDvbr)\n\nLike most JSP box sets, Memphis Shakedown is an affordably priced grab bag of vintage music presented with enough care and attention to detail that interested parties may dive directly in and experience more proof that history can be entertaining, invigorating, and deeply rewarding. The focus here is bluesy jug, mouth harp, kazoo, washboard, mandolin, and guitar-driven entertainment as it materialized on phonograph records in and around Memphis, TN, during the years 1929-1939. Featured are ukulele handler Charlie Burse &amp; His Memphis Mudcats; Jed Davenport of the Beale Street Jug Band; mouth organist Noah Lewis (best known as a member of Cannon's Jug Stompers), performing solo and leading his own jug band; Kaiser Clifton; Memphis Minnie; the Beale Street Rounders; the Delta Boys; Jack Kelly &amp; His South Memphis Jug Band; the well-known Memphis Jug Band and their star vocalist, Minnie Wallace; and five recordings released under one of the group's aliases, the Picaninny Jug Band. Memphis Shakedown was released on the heels of JSP's equally expansive and worthwhile four-CD set Memphis Jug Band with Gus Cannon's Jug Stompers, and works well as a sequel to that anthology. For those who thrive on this kind of music, obtaining both boxes would be a very sensible move. (arwulf arwulf)","torrent":{"xt":"urn:btih:71fbe825fb87859b737e69e1999f41a7f5d3004d","amp;dn":"Memphis+Shakedown+-+More+Jug+Band+Classics+%284CD%2C+JSP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71fbe825fb87859b737e69e1999f41a7f5d3004d","infoHashBuffer":{"type":"Buffer","data":[113,251,232,37,251,135,133,155,115,126,105,225,153,159,65,167,245,211,0,77]},"announce":[],"urlList":[]}}