{"title":"Your First Powerboat{BBS}","uid":6663553,"size":6668079,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:738e3ac9b73258cd78ae53c4b1a14f2283708c24&amp;dn=Your+First+Powerboat%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315604578,"description":"Navigate the hazards of boat ownership with absolute confidence Next to your house, your boat may well be the biggest investment you ever make. Buying and owning a boat involves one baffling decision after another. Yet informed, impartial guidance is almost impossible to find--until now, that is. This essential manual provides a method to the madness of boat buying and ownership, plotting a straight course through an ocean of confusion while it answers such questions as: Why fractional ownership often makes sense How to avoid buying a boat you'll never use How to identify the Goldilocks boat--not too big, not too small How to choose a powering option How to negotiate the best deal on any boat-new or used How to be your own surveyor, and why even a new boat may need a professional survey Why you should finance your boat even if you have the cash, and where to find the best loans How to calculate the total cost of ownership before you buy!\nAbout the Author\n\nBob Armstrong is a respected boating author and journalist, a U.S. Coast Guard-licensed Master, and a boat captain since 1962. He is the author of the bestselling Getting Started in Powerboating. Armstrong works as a charter-yacht captain and consults on boat purchasing decisions for individuals and businesses. He has worked as a boat surveyor, a buyer's and seller's agent, and an expert marine witness.\nProduct Details\n\n   \n  \n    * Print Length: 240 pages\n    * Page Numbers Source ISBN: 007149673\n    * Publisher: McGraw-Hill; 1 edition (July 21, 2008)","torrent":{"xt":"urn:btih:738e3ac9b73258cd78ae53c4b1a14f2283708c24","amp;dn":"Your+First+Powerboat%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"738e3ac9b73258cd78ae53c4b1a14f2283708c24","infoHashBuffer":{"type":"Buffer","data":[115,142,58,201,183,50,88,205,120,174,83,196,177,161,79,34,131,112,140,36]},"announce":[],"urlList":[]}}