{"title":"Internet Optimizer v1.56.01","uid":6543827,"size":491165,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:73dec4ffb3c645bb7d96ce5c8448e626f3436f5b&amp;dn=Internet+Optimizer+v1.56.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"efreed09","files":2,"time":1310786728,"description":"The Internet Optimizer is a free, easy Windows program that provides an intuitive interface for tuning and optimizing your Internet connection. There is no installation required, just download and run.\n\nThe program can aid both the novice and the advanced user in tweaking related TCP/IP parameters in the Windows Registry, making it easy to tune your system to the type of Internet connection used. The tool uses advanced algorithms, and the bandwidth*delay product to find the best TCP Window for your specific connection speed. It provides for easy tuning of all related TCP/IP parameters, such as MTU, RWIN, and even advanced ones like QoS and ToS/Diffserv prioritization. The program works with all current versions of Windows, and includes additional tools, such as testing average latency over multiple hosts, and finding the largest possible packet size (MTU).\n\nThe Internet Optimizer is targeted towards broadband internet connections, however it can be helpful with tuning any internet connection type, from dialup to Gigabit+ :) \n\n\nPlease seed!","torrent":{"xt":"urn:btih:73dec4ffb3c645bb7d96ce5c8448e626f3436f5b","amp;dn":"Internet+Optimizer+v1.56.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73dec4ffb3c645bb7d96ce5c8448e626f3436f5b","infoHashBuffer":{"type":"Buffer","data":[115,222,196,255,179,198,69,187,125,150,206,92,132,72,230,38,243,67,111,91]},"announce":[],"urlList":[]}}