{"title":"Hustlers in Stockholm, magic tricks on the street","uid":6682707,"size":320666543,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:74dda6ab5c350fd572e910453d1129b231b9ad89&amp;dn=Hustlers+in+Stockholm%2C+magic+tricks+on+the+street&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1316265089,"description":"Dobblarna, med sin fingerfÃƒÂ¤rdigt fÃƒÂ¶rflyttade papperskula mellan tre tÃƒÂ¤ndsticksaskar, fortsÃƒÂ¤tter sin bedrÃƒÂ¤gliga verksamhet ÃƒÂ¥r ut och ÃƒÂ¥r in och lurar av godtrogna turister mÃƒÂ¥nga tusentals kronor om dagen.\n\nGodtrogna mÃƒÂ¤nniskor luras pÃƒÂ¥ tusentals kronor av dobblare som bedriver illegalt spel lÃƒÂ¤ngs turiststrÃƒÂ¥ken i Stockholm.\n\n&quot;One, two, three... Eins, zwei, drei... Where is the ball? One two three...&quot; Med snabba handrÃƒÂ¶relser fÃƒÂ¶rflyttar mannen en liten papperskula mellan tre uppochnedvÃƒÂ¤nda tÃƒÂ¤ndsticksaskar pÃƒÂ¥ en liten tygmatta direkt pÃƒÂ¥ gatan. PÃƒÂ¥ bruten svenska upprepar han:\n\n- Ett, tvÃƒÂ¥, tre... Var ÃƒÂ¤r bollen?\n\nHan ÃƒÂ¤r omgiven av en liten klunga ÃƒÂ¥skÃƒÂ¥dare i hÃƒÂ¶rnet av Tyska brinken och VÃƒÂ¤sterlÃƒÂ¥nggatan i Gamla stan. PlÃƒÂ¶tsligt ÃƒÂ¤r det dags att gissa under vilken av de tre askarna kulan ligger. Det kostar 500 kronor. Gissar man rÃƒÂ¤tt fÃƒÂ¥r man dubbelt tillbaka. Gissar man fel fÃƒÂ¶rlorar man pengarna.\n\nEn av hans kumpaner, som lÃƒÂ¥tsas vara en vanlig fÃƒÂ¶rbipasserande, tar satsar och vinner. Bland medbrottslingarna finns ocksÃƒÂ¥ enstaka kvinnor som ser ut som vanliga turister. De fÃƒÂ¶rlorar en femhundring, men vinner snabbt tillbaka tvÃƒÂ¥.\n\nMed jÃƒÂ¤mna mellanrum fastnar intet ont anande medborgare pÃƒÂ¥ kroken. Det ser sÃƒÂ¥ lÃƒÂ¤tt ut. \n\n\n\n\nThese games have actually been around in some form for hundreds of years, but they still rope people in today. Both games are based on the same basic idea: Keep your eye on the target, while the dealer -- called the tosser in this sort of game -- mixes it up with two duplicates.\n\nIn three card monte, the tosser uses playing cards, typically the red queen and two black cards. The cards are creased down the middle, so they form a shingle shape. The tosser shows the player all three cards, face-up, and then drops them face down on a table. He or she slides the cards around on the table, switching their positions rapidly. The player tries to track the position of the queen as the tosser moves it around. When the tosser stops, the player makes a bet and guesses the position of the queen.\nthree card monte\n\nIn the shell game, the tosser lays three half shells or cups face down on the table and slips a ball or pea underneath one. Then he or she slides the shells around while the player tries to track the shell with the pea. As in three card monte, the player makes a bet (say $20) and guesses where the ball is.\n\nSo is there any way to win these games? In most cases, no -- the games are rigged so you can't win. In many shell games, the ball isn't under any of the shells! There are a few different ways of doing this. In one of the most common approaches, the tosser covers the table with pieces of newspaper. Then, when the game is in play, he or she lifts the shell as it slides over the edge of one newspaper sheet. The ball rolls under the newspaper sheet, and the tosser keeps shuffling. There is no winning shell!\n\nIn the classic three-card monte scam, the red queen does stay on the table, but the tosser leads the player away from it. When the tosser shows the cards, he or she holds a black card in one hand and a black card and the red queen in the other hand. This black card is held between the thumb and middle finger, and the queen is held in front of it, between the thumb and the ring finger. Since the queen is in front, the player assumes the tosser drops it first. But in fact, the tosser releases the black card first, while moving his or her hand to the side. This moves the queen out of the way, so the black card can fall straight down. The tosser does this so quickly that the spectators never notice. So, from the very beginning, everybody is tracking the wrong card.\nUp Next\n\nIn most cases, this sleight of hand is actually the simplest part of the scam. Most card and shell games are very elaborate operations involving several crew members. In addition to the tosser, the scam depends on a lookout to keep an eye out for the police, a roper to bring in potential players and one or more shills to get people to play. The shill blends in as part of the crowd -- in fact, the shill will appear to be the opposite of the tosser. If the tosser is wearing a dirty T-shirt and a baseball cap, the shill might be dressed in a suit, carrying a briefcase. The shills job is to act as a player or an involved spectator.\n\nBefore others join the game, the tosser lets one of the shills win a couple of times. The tosser doesn't switch the cards (or ditch the ball), so the game looks easy to any spectators. When people see the shill winning so easily (or losing by making a dumb choice), they want to play themselves. Another shill might fold a corner of the queen card while the tosser is looking away. This boosts the players' confidence because they think they're pulling one over on the tosser. But when the tosser picks the cards up, he or she subtly unbends the fold in the queen and folds the corner of one of the black cards.\n\nEven armed with all this knowledge, you still can't beat this game. If you see the card switch, track the right card and put down money on the actual queen, one of the shills will just put down a higher bet on another card, and the tosser will decree &quot;one bet at a time.&quot; Or a shill might bump into the table, &quot;accidentally&quot; knocking it over, voiding the game. Or the tosser might suddenly spot the police, and pack the game up. So in most cases, there really is no way to win these games -- the crew is only out to take money, never to give any of it up. ","torrent":{"xt":"urn:btih:74dda6ab5c350fd572e910453d1129b231b9ad89","amp;dn":"Hustlers+in+Stockholm%2C+magic+tricks+on+the+street","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74dda6ab5c350fd572e910453d1129b231b9ad89","infoHashBuffer":{"type":"Buffer","data":[116,221,166,171,92,53,15,213,114,233,16,69,61,17,41,178,49,185,173,137]},"announce":[],"urlList":[]}}