{"title":"Hawaiian Dictionary: Hawaiian-English, English-Hawaiian","uid":6538144,"size":13644368,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:776039027b1c76499bf851006b3bec7103a80007&amp;dn=Hawaiian+Dictionary%3A+Hawaiian-English%2C+English-Hawaiian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_F1_","files":-1,"time":1310579478,"description":"Hawaiian Dictionary: Hawaiian-English, English-Hawaiian\n Publisher: Univ of Hawaii Pr | 1986 | ISBN: 0824807030 | English | PDF | 3695 pages | 13.01 Mb\nFor many years Hawaiian Dictionary has been the definitive and authoritative work on the Hawaiian language. Now this indispensable reference volume has been enlarged and completely revised. More than 3,000 new entries have been added to the Hawaiian-English section bringing the total number of entries to almost 30,000, and making it the largest and most complete of any Polynesian dictionary. Other additions and changes in this section include: a method of showing stress groups to facilitate pronunciation of Hawaiian words with more than three syllables; indication of parts of speech; current scientific names of plants; use of metric measurements; additional reconstructions; classical origins of loan words; and many added cross-references to enhance understanding of the numerous nuances of Hawaiian words.\n\n The English-Hawaiian section, a complement and supplement to the Hawaiian-English section, contains more than 12,500 entries and can serve as an index to hidden riches in the Hawaiian language. This new edition is more than a dictionary. Containing folklore, poetry, and ethnology, it will benefit Hawaiian studies for years to come.\n\nReview\n &quot;This standard work of reference... continues offering the happy blend of grammar and lexicon.&quot; -- American Reference Books Annual","torrent":{"xt":"urn:btih:776039027b1c76499bf851006b3bec7103a80007","amp;dn":"Hawaiian+Dictionary%3A+Hawaiian-English%2C+English-Hawaiian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"776039027b1c76499bf851006b3bec7103a80007","infoHashBuffer":{"type":"Buffer","data":[119,96,57,2,123,28,118,73,155,248,81,0,107,59,236,113,3,168,0,7]},"announce":[],"urlList":[]}}