{"title":"Democracy Now - 15 jul 2011","uid":6542595,"size":451304903,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:780e680369e56d00c12c7ae2b7d6bcbb3a683601&amp;dn=Democracy+Now+-+15+jul+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1310747324,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jul 15, 2011\n\n- Top Murdoch Aide Resigns in Phone-Hacking Scandal\n- FBI Confirms News Corp. Investigation\n- Protesters Rally Outside Murdoch's NYC Home\n- Libya Denies Claims of Tripoli Bombing Plan\n- Kenya Opens New Camp for Somali Refugees\n- U.S. Drone Strike Kills 6 in Yemen\n- Arab League to Back Palestinian Statehood Campaign\n- Israel Kills West Bank Resident, Strikes Gaza\n- Clinton Foundation to Review Haiti Trailers Following ExposÃƒÂ©\n- Pentagon Declares Internet a Theater of War\n- Group: Fake CIA Program Endangers Relief Programs\n- California Enacts LGBT Education Law\n- Kenyan Peace Activist Dekha Ibrahim Abdi Dies in Car Accident\n\n\nSpecial reports\n\n- U.S. Debt Default Looms as Talks Stall on Deficit Reduction: &quot;We Are Playing With Fire&quot;\n\nDiscussion on a deficit reduction deal has stalled after five consecutive days of negotiations between Republicans and Democrats. In order to borrow beyond August 2, the United States must raise its $14.3 trillion debt ceiling. This week, Standard &amp; Poor's became the second of the major credit rating agencies to place U.S. debt under review, citing an increasing risk of a payment default. Republicans are pushing for massive spending cuts, many of which Obama has agreed to, even as Democrats say they want to raise taxes on corporations and wealthy households. We speak with Jeff Madrick, director of policy research at the Schwartz Center for Economic Policy Analysis at The New School and author of &quot;Age of Greed: The Triumph of Finance and the Decline of America, 1970 to the Present.&quot;\n\n\n- ALEC Exposed: State Legislative Bills Drafted by Secretive Corporate-Lawmaker Coalition\n\nThis week the Center for Media and Democracy released 800 model bills, legislation that is straight out of the corporate playbook and drafted by the American Legislative Exchange Council. The group's membership includes both state lawmakers and corporate executives who gather behind closed doors to discuss and vote on draft legislation. ALEC has come under increasing scrutiny in recent months for its role in crafting bills to attack worker rights, to roll back environmental regulations, privatize education, deregulate major industries and pass voter ID laws. Thanks to ALEC, at least a dozen states have recently adopted a nearly identical resolution asking Congress to compel the U.S. Environmental Protection Agency to stop regulating carbon emissions. We are joined by Lisa Graves, executive director of the Center for Media Democracy.\n\n\n- Protests Grow in Solidarity With California Prisoners As Hunger Strikes Enters 3rd Week\n\nThousands of inmates in at least 13 prisons across California's troubled prison system have been on hunger strike for almost two weeks. Many are protesting in in solidarity with inmates held in Pelican Bay State Prison, California's first super-maximum security prison, over what prisoners say are cruel and unusual conditions in &quot;Secure Housing Units.&quot; We play an audio statement from one of the Pelican Bay prisoners, and speak to three guests: Dorsey Nunn, co-founder of &quot;All of Us or None&quot; and executive director of Legal Services for Prisoners with Children, and one of the mediators between the prisoners on hunger strike and the California Department of Corrections; Molly Porzig, a member of the Prisoner Hunger Strike Solidarity coalition and a spokesperson for Critical Resistance; and Desiree Lozoya, the niece of an inmate participating in the Pelican Bay Hunger Strike, who visited him last weekend.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:780e680369e56d00c12c7ae2b7d6bcbb3a683601","amp;dn":"Democracy+Now+-+15+jul+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"780e680369e56d00c12c7ae2b7d6bcbb3a683601","infoHashBuffer":{"type":"Buffer","data":[120,14,104,3,105,229,109,0,193,44,122,226,183,214,188,187,58,104,54,1]},"announce":[],"urlList":[]}}