{"title":"Electric Relays: Principles and Applications (Electrical and Com","uid":6667998,"size":30238730,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79da5583637492dea44bb59aad7b0be51064acc2&amp;dn=Electric+Relays%3A+Principles+and+Applications+%28Electrical+and+Com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tirantsh","files":1,"time":1315766964,"description":"Author(s): Vladimir Gurevich\nPublisher: CRC Press\nDate: 2005-12-15\nFormat: pdf\nLanguage: English\nISBN10: 0849341884\nPages: 704\nISBN13: 9780849341885\n\nProduct Description: Electric relays pervade the electronics that dominate our world. They exist in many forms, fulfill many roles, and each have their own behavioral nuances and peculiarities. To date, there exists no comprehensive reference surveying the broad spectrum of electric relays, save one-Electric Relays: Principles and Applications. This ambitious work is not only unique in its scope, but also in its practical approach that focuses on the operational and functional aspects rather than on theory and mathematics.\n\nAccomplished engineer Dr. Vladimir Gurevich builds the presentation from first principles, unfolding the concepts and constructions via discussion of their historical development from the earliest ideas to modern technologies. He uses a show-not-tell approach that employs nearly 1300 illustrations and reveals valuable insight based on his extensive experience in the field. The book begins with the basic principles of relay construction and the major functional parts, such as contact and magnetic systems. Then, it devotes individual chapters to the various types of relays. The author describes the principles of function and construction for each type as well as features of several relays belonging to a type that operate on different principles.\n\nRemarkably thorough and uniquely practical, Electric Relays: Principles and Applications serves as the perfect introduction to the plethora of electric relays and offers a quick-reference guide for the experienced engineer.","torrent":{"xt":"urn:btih:79da5583637492dea44bb59aad7b0be51064acc2","amp;dn":"Electric+Relays%3A+Principles+and+Applications+%28Electrical+and+Com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79da5583637492dea44bb59aad7b0be51064acc2","infoHashBuffer":{"type":"Buffer","data":[121,218,85,131,99,116,146,222,164,75,181,154,173,123,11,229,16,100,172,194]},"announce":[],"urlList":[]}}