{"title":"Grune.Karl.Die.StraÃÅ¸e[1923]1cd","uid":6673271,"size":683429946,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a17712b6a1619ec331121fabecf29fcea1b7f60&amp;dn=Grune.Karl.Die.Stra%26Atilde%3B%C5%B8e%5B1923%5D1cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"oscarmendes","files":5,"time":1315944836,"description":"This film inaugurated a few &quot;street films&quot; in Weimer Germany, including, notably, 'The Joyless Street' ('Die Freundlose Gasse,' 1925). Additionally, horrific and expressionistic street scenes feature prominently in many films of this era. The street in this film is quite remarkable. Apparently, the action, automobiles and all, takes place entirely within studio sets, giving the filmmakers control over the lighting. And, the lighting is great, with nighttime-like scenes full of shadows and darkly lit corners. Staircases also feature prominently in this film, as they do in many German films of the time.\n\n'The Street' is simply about a man, who leaves his wife and humdrum life to seek the excitement of a Parisian street. He spends most of the story chasing after a prostitute thief, which eventually leads him to prison and despair. He then returns to his previous life. Siegfried Kracauer, in &quot;From Carlgari to Hitler: A Psychological History of the German Film,&quot; says the film is about going from rebellion to submission--foretelling the German people's submission to the Nazi regime. 'The Street' is also another of Carl Meyer's &quot;instinct films,&quot; as Kracauer calls them, which also includes 'Backstairs' ('Hintertreppe,' 1921) and, most notably, 'The Last Laugh' ('Der Letzte Mann,' 1924). The characters in these films act instinctively, which affords their stories to transcend intertitles. As with the other films, there are few intertitles in 'The Street.'\n\nThe lack of many intertitles enhances the visual qualities of the picture. Moreover, the street itself seems to take on a life of its own. It enters the film by tempting the man with a shadow play on his ceiling. And, as fellow commenter hhole mentioned, an optometrist's shop sign makes it seem as though the street is watching the man. 'The Street' is impressively photographed and innovative for its expressionistic visuals and embodiment of the street.","torrent":{"xt":"urn:btih:7a17712b6a1619ec331121fabecf29fcea1b7f60","amp;dn":"Grune.Karl.Die.Stra%26Atilde%3B%C5%B8e%5B1923%5D1cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a17712b6a1619ec331121fabecf29fcea1b7f60","infoHashBuffer":{"type":"Buffer","data":[122,23,113,43,106,22,25,236,51,17,33,250,190,207,41,252,234,27,127,96]},"announce":[],"urlList":[]}}