{"title":"(Blues) Mike Onesko Blues Band - Smokehouse Sessions","uid":6675235,"size":161510634,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a83d389a5f80456ad9e2abef3e698783a83a1e7&amp;dn=%28Blues%29+Mike+Onesko+Blues+Band+-+Smokehouse+Sessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1316000659,"description":"mp3   320kbps\n\n\nLabel: Horizon\nStyles: Blues-rock\nArt: Front\n\n[2:29] 1. Black Betty\n[5:22] 2. Slow and Steady\n[4:26] 3. Who's Been Talkin'\n[4:17] 4. Dirty Double Dealer\n[2:49] 5. Big Fat Mama\n[4:09] 6. Sloroads\n[8:23] 7. The Glide\n[4:15] 8. Rock My Baby\n[7:58] 9. Who Knows Jam\n[6:06] 10. You Don't Love Me\n[7:44] 11. Little Red Rooster\n[4:57] 12. Da Blues\n[4:09] 13. Crossroads\n\n\nStill in his teens, guitar-star-wannabe Mike Onesko left Cleveland for the greener pastures of San Francisco. After gigging around town in a local trio, he eventually caught the ear of producer Mike Farney, founder of Shrapnel Records, who brought him into the Blindside Blues Band. After three well-received albums Blindside disbanded, and several groups later, Onesko resurrected the band in 1996, under the new moniker Mike Onesko's Blindside Blues Band and released To the Station. The following year, Mike Onesko's Guitar Army fired off Armageddon.\n\nNow sporting the name Mike Onesko Blues Band, the guitar hero is back with his latest CD Smokehouse Sessions. The name change says it all, for this is Onesko's bluesiest album to date, which a glance through the track list confirms. &quot;Little Red Rooster,&quot; &quot;Blues for Billy,&quot; Howlin' Wolf's &quot;Who's Been Talking,&quot; and the highest flying standard of them all &quot;Crossroads.&quot; That latter classic is so loved that the Blues Band covers it twice, once in its full electric glory, and a second in lovely acoustic fashion. But there's still plenty of rockier numbers, like Ram Jam's hit &quot;Black Betty&quot; and &quot;Rock Me Baby.&quot; Onesko's early influences ranged from Deep Purple to Led Zeppelin, Cream to Uriah Heep, but the Beatles also had an impact, and it's the (relative) simplicity of their initial takes on R&amp;B that provides inspiration here. Certainly not in Smokehouse's sound, which still moves mightily through heavy rock, but in the straightforward and direct arrangements. Once again, Onesko reaffirms his guitar hero status, ably assisted by the equally masterful musicianship of the other three members of his band. ","torrent":{"xt":"urn:btih:7a83d389a5f80456ad9e2abef3e698783a83a1e7","amp;dn":"%28Blues%29+Mike+Onesko+Blues+Band+-+Smokehouse+Sessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a83d389a5f80456ad9e2abef3e698783a83a1e7","infoHashBuffer":{"type":"Buffer","data":[122,131,211,137,165,248,4,86,173,158,42,190,243,230,152,120,58,131,161,231]},"announce":[],"urlList":[]}}