{"title":"Wild Flag - Wild Flag (2011) [FLAC] politux","uid":6683252,"size":300944757,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7acde0a38912cec3ad79dcbb5129fb1d61093d83&amp;dn=Wild+Flag+-+Wild+Flag+%282011%29+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1316288973,"description":"Is it possible to have a supergroup without any posturing? In Wild Flags case, the answer is a resounding yes. This meeting of Sleater-Kinneys Carrie Brownstein and Janet Weiss, Heliums Mary Timony, and the Minders, Rebecca Cole came with high expectations, and on their self-titled debut, Wild Flag not only lives up to them, but challenges them, too. Women havent rocked out like this since the 90s heyday of the members previous bands, and nearly every track here is filled with ovaries-to-the wall guitar work as well as Weiss formidable drumming. Yet Wild Flag doesnt feel retro in the slightest; this collaboration is more interesting than straightforward reunions of any of the bands involved, and offers an inspired balance of everyones strengths. Weiss, Brownstein, and Cole straighten out some of the more obscure curlicues of Timonys songs, particularly on Black Tiles, where her mysticism is toned down to a psychedelic haze, and on Something Came Over Me, which may very well be the most direct and explosive shes ever sounded. Likewise, Timony throws some curves into Weiss and Brownsteins angles on Future Crimes and Boom, preventing them from feeling too much like Sleater-Kinney songs. Wild Flag acknowledges the past but doesnt live there, and some of the best moments dont sound much like what the bandmembers have done before. The terrific opening track Romance is poppy, muscular, and way more immediate than any of the bands 90s projects, while Short Version mixes a powerful riff that echoes Guns N Roses Sweet Child O Mine with Krautrock-ish rhythm, sweet backing harmonies and barbed vocals. Most importantly, the band sounds like its having contagious fun making music, and songs like Glass Tambourine and Electric Band reflect that in their lyrics. On the other hand, Racehorse proves that words are secondary when a bands chemistry is as palpable as this is. Wild Flag isnt just an exciting debut and one of 2011s most dynamic rock records, it proves that a group is truly super when the personalities involved work together and have fun.\n \nReleased: Sept 13, 2011\nGenre: Rock\nStyle: Alternative\nSource: CD\nCodec: FLAC\nChannels: Stereo\nSample Rate: 44,100 Hz\nBit Rate: ~1,000 kbps\nBits per Sample: 16\nCovers: Front\n \nTracks:\n \n 1. Romance\n 2. Something Came Over Me\n 3. Boom\n 4. Glass Tambourine\n 5. Endless Talk\n 6. Short Version\n 7. Electric Band\n 8. Future Crimes\n 9. Racehorse\n 10. Black Tiles\n \nMore info:\n  &lt;a href=&quot;\nhttp://allmusic.com/album/wild-flag-r2233454/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/album/wild-flag-r2233454/review&lt;/a&gt;","torrent":{"xt":"urn:btih:7acde0a38912cec3ad79dcbb5129fb1d61093d83","amp;dn":"Wild+Flag+-+Wild+Flag+%282011%29+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7acde0a38912cec3ad79dcbb5129fb1d61093d83","infoHashBuffer":{"type":"Buffer","data":[122,205,224,163,137,18,206,195,173,121,220,187,81,41,251,29,97,9,61,131]},"announce":[],"urlList":[]}}