{"title":"Cases in Controversy - The 14th Amendment","uid":6666349,"size":4510143274,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7c70c70827b18fbd0478d2e12cf631fbebe88fb4&amp;dn=Cases+in+Controversy+-+The+14th+Amendment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rambam1776","files":-1,"time":1315700049,"description":"Exploring the ramifications of the U.S. Constitution's 14th Amendment, which gives equal rights to all people, this program offers insight from historical and legal experts and covers numerous related Supreme Court cases. Ranging from 1873 to 1973, the cases include Brown v. Board of Education, Plessy v. Ferguson, Roe v. Wade, Shelley v. Kraemer, Strauder v. West Virginia, Missouri ex rel. Gaines v. Canada and more.\n\n\n\nProduct Details\nDirectors: Monte Babington\nFormat: Closed-captioned, Color, DVD, NTSC\nLanguage: English\nRegion: Region 1 (U.S. and Canada only. Read more about DVD formats.)\nAspect Ratio: 1.33:1\nNumber of discs: 1\nRated: G (General Audience)\nStudio: Jumby Bay Studios\nDVD Release Date: December 1, 2003\n &lt;a href=&quot;\nhttp://bayimg.com/nAkCnaadA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/nAkCnaadA&lt;/a&gt;\n\nEditorial Reviews\nCases in Controversy is the uplifting story of the 14th amendment, which led the Supreme Court to proclaim that &quot;Separate but Equal&quot; is inherently unequal.\nUsing the actual Supreme Court decisions, interviews with legal educators and professionals, and historical reenactments, Cases in Controversy examines the cases that shaped the 14th Amendment.\n\nCases in Controversy includes in-depth analysis and insight from a variety of legal and history experts. Cases in Controversy provides students with a solid foundation and understanding of the legal challenges and hurdles facing the United States after the Civil War.\n\nHighlights 14 cases from 1873 to 1973 include: Brown v. Board, Plessy v. Ferguson, Roe v. Wade, Shelly v. Kraemer, Strauder v. West Virginia, Missour v. Canada, and more.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Fourteenth_Amendment_to_the_United_States_Constitution&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Fourteenth_Amendment_to_the_United_States_Constitution&lt;/a&gt;\n\nThe Fourteenth Amendment (Amendment XIV) to the United States Constitution was adopted on July 9, 1868, as one of the Reconstruction Amendments.\n\nIts Citizenship Clause provides a broad definition of citizenship that overruled the Dred Scott v. Sandford ruling by the Supreme Court (1857) that held that blacks could not be citizens of the United States.[1]\n\nIts Due Process Clause prohibits state and local governments from depriving persons of life, liberty, or property without certain steps being taken to ensure fairness. This clause has been used to make most of the Bill of Rights applicable to the states, as well as to recognize substantive and procedural rights.\n\nIts Equal Protection Clause requires each state to provide equal protection under the law to all people within its jurisdiction. This clause was the basis for Brown v. Board of Education (1954), the Supreme Court decision which precipitated the dismantling of racial segregation in the United States. In Reed v. Reed (1971), the Supreme Court for the first time ruled that laws arbitrarily requiring sex discrimination violated the Equal Protection Clause.\n\nThe amendment also includes a number of clauses dealing with the Confederacy and its officials.","torrent":{"xt":"urn:btih:7c70c70827b18fbd0478d2e12cf631fbebe88fb4","amp;dn":"Cases+in+Controversy+-+The+14th+Amendment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c70c70827b18fbd0478d2e12cf631fbebe88fb4","infoHashBuffer":{"type":"Buffer","data":[124,112,199,8,39,177,143,189,4,120,210,225,44,246,49,251,235,232,143,180]},"announce":[],"urlList":[]}}