{"title":"Xilisoft Video Converter Ultimate 7.3.1 build 20120625 + Patch-B","uid":7395762,"size":39904381,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7dc9f73bf7bd5bbb0de186d080eb981a8c1a2128&amp;dn=Xilisoft+Video+Converter+Ultimate+7.3.1+build+20120625+%2B+Patch-B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrriser007","files":-1,"time":1340911807,"description":"Xilisoft Video Converter is powerful, versatile video conversion software which converts between all popular video formats such as convert AVI to MPEG, WMV to AVI, WMV to MPEG or H.264/AVC video, convert AVI files to iPod formats, etc. No other programs like Xilisoft Video Converter supports so comprehensive video formats including AVI, MPEG, WMV, DivX, MP4, H.264/MPEG-4 AVC, RM, MOV, XviD, 3GP, FLV, VOB (the video format used in DVD), DAT (the video format used in VCD, SVCD), etc. In addition, the video converter provides an easy way to convert video file to popular audio file, like MP2, MP3, WMA, WAV, RA, M4A, AAC, AC3, OGG, etc. The video converter also supports APE, CUE decoding and audio CD ripping.\n\nto MPEG, WMV to MPEG, WMV to AVI, MKV to AVI, MKV to MPEG, are very easy and fast with the best quality. Free download Xilisoft Video Converter to have a wonderful experience right now!\n\nMain Functions:\n* Act as 3GP Video Converter, iPod Video Converter, PSP Video Converter, Zune Video Converter, AVI MPEG Converter, MP4 Video Converter, MOV Converter, MKV to MPEG converter, etc.;\n* Convert between all popular video formats including AVI, MPEG, WMV, DivX, MP4, H.264/MPEG-4 AVC, RM, MOV, XviD, 3GP, FLV, help you on how to convert AVI to MPEG, convert MKV to AVI, convert MKV to MPEG;\n* Convert videos to popular audio files, including MP2, MP3, WMA, WAV, RA, M4A, AAC, AC3, and OGG, and convert between these audio formats;\n* Extract pictures from video and output them as JPG, PNG, GIF, BMP, SWF;\n* Convert pictures to video formats like AVI, FLV, SWF, MOV, 3GP, WMV, etc.","torrent":{"xt":"urn:btih:7dc9f73bf7bd5bbb0de186d080eb981a8c1a2128","amp;dn":"Xilisoft+Video+Converter+Ultimate+7.3.1+build+20120625+%2B+Patch-B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dc9f73bf7bd5bbb0de186d080eb981a8c1a2128","infoHashBuffer":{"type":"Buffer","data":[125,201,247,59,247,189,91,187,13,225,134,208,128,235,152,26,140,26,33,40]},"announce":[],"urlList":[]}}