{"title":"Charlie St. Cloud(2010)DVDRip.AC3(ENG)-DROCK","uid":7276522,"size":734023680,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7fa38d59619ccb3f2435e070ee1999674f559011&amp;dn=Charlie+St.+Cloud%282010%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1337299589,"description":"A young man forms a unique connection to the afterlife after surviving the tragic car accident that claimed his younger brother in this supernatural drama starring Zac Efron, based on the best-selling book by author Ben Sherwood. Charlie St. Cloud (Efron) is an experienced sailor from the Pacific Northwest who has just earned a scholarship that will take him far from home. The light of his mother's life, Charlie and his little brother, Sam (Charlie Tahan), are driving late at night when they're involved in a deadly car accident that kills Sam and leaves Charlie forever changed. In the aftermath of the accident, Charlie is wracked with guilt, convinced that if he had just been more careful behind the wheel, Sam would still be alive today. When Charlie begins seeing visions of his younger brother that are just as real as if Sam is actually standing before him, his friends and neighbors all start to think he's losing his mind. Shortly thereafter, Charlie's former high-school classmate Tess (Amanda Crew) returns to town unannounced, and together the two old acquaintances forge the foundation of a meaningful romance. But before Charlie can move on with his life he'll have to first let go of his past, and bid his beloved brother Sam one final, heartfelt farewell.\n\nRipped with Autogk\n\nLength: 1 Hour 39 Minutes\n\nFile Type: AVI\n\nFrame Width: 688\n\nFrame Height: 272\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 128kbps","torrent":{"xt":"urn:btih:7fa38d59619ccb3f2435e070ee1999674f559011","amp;dn":"Charlie+St.+Cloud%282010%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa38d59619ccb3f2435e070ee1999674f559011","infoHashBuffer":{"type":"Buffer","data":[127,163,141,89,97,156,203,63,36,53,224,112,238,25,153,103,79,85,144,17]},"announce":[],"urlList":[]}}