{"title":"Inception (2010) - BRRip 720p - PrinceNahin","uid":7366711,"size":1152559000,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:848344a328c3c2af29c238172fc27a5d4db4c967&amp;dn=Inception+%282010%29+-+BRRip+720p+-+PrinceNahin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PrinceNahin","files":-1,"time":1340126326,"description":"Inception is a 2010 British-American science fiction action heist film which was written, co-produced, and directed by Christopher Nolan. The film features an international ensemble cast including Leonardo DiCaprio, Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Ellen Page, Tom Hardy, Cillian Murphy, Dileep Rao, Tom Berenger, and Michael Caine. DiCaprio plays Dom Cobb, a specialized corporate spy and thief whose work consists of secretly extracting valuable commercial information from the unconscious minds of his targets while they dream. Wanted for murder and unable to visit his children, Cobb is offered a chance to regain his old life as payment for a task considered to be impossible: &quot;Inception&quot;, the implantation of an original idea into a target's subconscious.[5]\n\nIn 2001, Nolan wrote an 80-page treatment about &quot;dream stealers&quot;, and presented the idea to Warner Bros. in a story envisioned as a horror film inspired by lucid dreaming.[6] Feeling he needed to have more experience with large-scale film production, Nolan retired the project and instead worked on Batman Begins (2005), The Prestige (2006), and The Dark Knight (2008).[7] He spent six months polishing the script before Warner Bros. purchased it in February 2009.[8] Inception was filmed in six countries and four continents, beginning in Tokyo on June 19, 2009, and finishing in Canada on November 22, 2009.[9]\n\nIts official budget was US$160 million, a cost which was split between Warner Bros and Legendary Pictures.[3] Nolan's reputation and success with The Dark Knight helped secure the film's $100 million in advertising expenditure,[3] with most of the publicity involving viral marketing. Inception premiered in London on July 8, 2010, and was released in both conventional and IMAX theaters on July 16, 2010.[10][11] A box office success, Inception has grossed over $800 million worldwide and is thus currently one of the highest-grossing films of all time.[4] The home video market also had strong results, with $68 million in DVD sales.\n\nInception has received wide critical acclaim and numerous critics have praised its originality, cast, score, and visual effects.[12] It won Academy Awards for Best Visual Effects, Best Sound Editing, Best Sound Mixing, and Best Cinematography, and was also nominated for four more: Best Picture, Best Original Screenplay, Best Original Score, and Best Art Direction.","torrent":{"xt":"urn:btih:848344a328c3c2af29c238172fc27a5d4db4c967","amp;dn":"Inception+%282010%29+-+BRRip+720p+-+PrinceNahin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"848344a328c3c2af29c238172fc27a5d4db4c967","infoHashBuffer":{"type":"Buffer","data":[132,131,68,163,40,195,194,175,41,194,56,23,47,194,122,93,77,180,201,103]},"announce":[],"urlList":[]}}