{"title":"Rev. Gary Davis &amp; The Guitar Evangelists Vol.2 (4CD-JSP)","uid":7312008,"size":722537768,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:85ad4772b58e34368a81be1036e0826fc42d42d5&amp;dn=Rev.+Gary+Davis+%26amp%3B+The+Guitar+Evangelists+Vol.2+%284CD-JSP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mudmashers","files":109,"time":1338378825,"description":"Rev. Gary Davis and the Guitar Evangelists, Vol. 2 [JSP] (4CD320kb)\n\nDuring the Depression era of the 1930s and on into the '50s, street musicians were a commonplace of Black American life. In rural areas entertainers tended to follow a path determined by the seasons - they arranged to be around just as the crops came in and work and money became abundant. In the cities they would also chase the dollar, playing in open-air markets, outside taverns, anywhere they could find a receptive and generous audience. Many of these artists restricted their repertoires to the religious material that found a wide audience in days when the hope of heaven was all that sustained many. These singers, most of whom accompanied themselves on the guitar, usually had any combination of three reasons for being on the corner singing for pennies: they might be blind, with no other way of scraping a living; they might be escaping (or tired of seeking) more arduous work; they might be true evangelists on a God-given mission. \n\nThe 101 tracks on this 4CD set feature Blind Rev Gary Davis, Blind Joe Amos, Blind Joe Taggart, Blind Willie Davis, Blind Gussie Nesbit, Brother Willie Eason, Sister Matthews, Sister O M Terrell, Mother McCollum, Rev Charles White, Two Gospel Keys, Elizabeth Phillips, Eddie Head &amp; His Family, Henry Green and Bull City Red.","torrent":{"xt":"urn:btih:85ad4772b58e34368a81be1036e0826fc42d42d5","amp;dn":"Rev.+Gary+Davis+%26amp%3B+The+Guitar+Evangelists+Vol.2+%284CD-JSP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85ad4772b58e34368a81be1036e0826fc42d42d5","infoHashBuffer":{"type":"Buffer","data":[133,173,71,114,181,142,52,54,138,129,190,16,54,224,130,111,196,45,66,213]},"announce":[],"urlList":[]}}