{"title":"Battery V2.8","uid":7395947,"size":5321654,"categoryP":"applications","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:8665a64a183d1f543fd30dd11d319216f77611ef&amp;dn=Battery+V2.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mysayooni","files":1,"time":1340916670,"description":"Battery is a small but elegant utility app that helps you to monitor the current battery percentage on your iPhone, iPod Touch or iPad. With Battery, you'll always be notified if your battery is full enough to watch a movie or play a game in a long trip. \n\nNo other battery app has such a gorgeous and sleek interface as Battery has. We are trying to keep the UI as simple as possible, but no simpler. So we are constantly working on Battery, adding new features and improving user interface.\n\n1% ACCURACY\nPrecise battery level display in 1% increments.\n\nPIXEL-PERFECT GRAPHICS + RETINA DISPLAY SUPPORT\nEnjoy the pixel-perfect graphics of the Battery app. Retina display support and rich animations make Battery the most beautiful app on the market. \n\nTIME TO FULL CHARGE\nBattery app shows the charge status(charging/topping charge/fully charged) and time remaining to full charge.\n\nFULL CHARGE ALARM\nYou can enable the &quot;Full Charge&quot; alarm feature by tapping bell button in the lower-right corner of the screen. Alarm sound can be customized in the &quot;Alarm sound&quot; option in the settings menu. You can choose one of eight loud sounds for the notification. \n\nBATTERY HEALTH\nAccording to the official data for the iPhone battery given proper maintenance, after 400 charge-discharge cycles, 80% of the original battery capacity can be retained. To estimate the battery life accurately, you can adjust the battery health percentage slider in the Settings menu.\n\nBATTERY TIPS\nWe have collected the most useful tips to help you keep your battery healthy and to maximize your battery life.\n\nBattery automatically determines your device type and displays the time remaining of:\n- Audio playback\n- Video playback\n- Gaming time\n- Internet over Wi-Fi\n- Internet over 3G\n- Talk time on 2G\n- Stand by mode\n\n\nPLEASE NOTE:\n\nWorks on iPhone, iPod Touch and iPad with iOS 4 and greater.\nThe estimated times are estimates only, results may vary.\n","torrent":{"xt":"urn:btih:8665a64a183d1f543fd30dd11d319216f77611ef","amp;dn":"Battery+V2.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8665a64a183d1f543fd30dd11d319216f77611ef","infoHashBuffer":{"type":"Buffer","data":[134,101,166,74,24,61,31,84,63,211,13,209,29,49,146,22,247,118,17,239]},"announce":[],"urlList":[]}}