{"title":"Infidels: A History of the Conflict Between Christendom and Isla","uid":6663292,"size":3348927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8751a53cd3cc9a45b6c1cbb7fadcf2c857ad19ca&amp;dn=Infidels%3A+A+History+of+the+Conflict+Between+Christendom+and+Isla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1315595269,"description":"-epub version\n\nHere is the first panoptic history of the long struggle between the Christian West and Islam. In this dazzlingly written, acutely nuanced account, Andrew Wheatcroft tracks a deep fault line of animosity between civilizations. He begins with a stunning account of the Battle of Lepanto in 1571, then turns to the main zones of conflict: Spain, from which the descendants of the Moors were eventually expelled; the Middle East, where Crusaders and Muslims clashed for years; and the Balkans, where distant memories spurred atrocities even into the twentieth century. Throughout, Wheatcroft delves beneath stereotypes, looking incisively at how images, ideas, language, and technology (from the printing press to the Internet), as well as politics, religion, and conquest, have allowed each side to demonize the other, revive old grievances, and fuel across centuries a seemingly unquenchable enmity. Finally, Wheatcroft tells how this fraught history led to our present maelstrom. We cannot, he argues, come to terms with today's perplexing animosities without confronting this dark past.\n\n2003","torrent":{"xt":"urn:btih:8751a53cd3cc9a45b6c1cbb7fadcf2c857ad19ca","amp;dn":"Infidels%3A+A+History+of+the+Conflict+Between+Christendom+and+Isla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8751a53cd3cc9a45b6c1cbb7fadcf2c857ad19ca","infoHashBuffer":{"type":"Buffer","data":[135,81,165,60,211,204,154,69,182,193,203,183,250,220,242,200,87,173,25,202]},"announce":[],"urlList":[]}}