{"title":"History Ch Mega Disasters Collection Two 05of12 Glacier Meltdown","uid":6682631,"size":671895552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8916eb7cc5f6c35fb764639aa1ff68dba7c69dbf&amp;dn=History+Ch+Mega+Disasters+Collection+Two+05of12+Glacier+Meltdown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MVGroup","files":-1,"time":1316218945,"description":"Mega Disasters: Collection Two\n\nHistory Documentary hosted by JV Martin, published by History Channel in 2008 - English narration\n\n\nInformation\n------------------------------\n\nMega Disasters: Collection Two\nWhat would happen if a major catastrophe struck the United States? Using past natural disasters as an example, this detailed - and disturbing - collection from HISTORY examines tsunamis, earthquakes, volcanic eruptions, hurricanes and even an asteroid impact, to see what disasters could be coming our way. The same geological forces that ripped apart the ancient world still roil beneath the surface today. Will history repeat itself? History: Mega Disasters examines it all - quakes, droughts, freezes and eruptions. They've happened before; will they happen again?\n\n\n1)  Part 1: Krakatoas Revenge \nIn 1883, Krakatoa, the most famous and feared volcano on Earth, erupted. Gigantic explosions blew the volcano to bits, triggering massive lava flows that generated huge tsunamis. Nearly 37,000 died the greatest death toll from a volcanic eruption in history. It could happen again. Leading experts speculate on the impact of a similar mega eruption today. Would the resulting colossal ash cloud cause a worldwide catastrophe? Would we survive?\n\n2)  Part 2: Comet Storm \n13,000 years ago, a large comet exploded over eastern Canada, unleashing a mass of burning fragments that ignited a mega-storm of fire spreading for thousands of miles. Nearly every living thing on the North American continent was destroyed, including an ancient civilization known as the Clovis. With Comet Storm, revisit the moment of impact and the epic aftermath of this major event with mesmerizing 3-D computer animations. See the level of destruction a similar event would wreak on our modern world. And cross your fingers.\n\n3)  Part 3: Hawaii Apocalypse \nMauna Loa, Hawaii's spectacular and sacred volcano, has slumbered for over 25 years. Its last appreciable eruption was in 1984, but it hasn't really blown its top since 1950 and, before that, in 1868. Back then just a few villages and farms were destroyed, but today it would be an entirely different story. Some of the most exclusive and expensive real estate in the world now crowds her flanks. An entire city, Hilo, is built on lava flows from previous eruptions. Experts agree that Mauna Loa could be on the verge of erupting far more spectacularly than she ever has in recorded history. Using state-of-the-art computer animation, take a look at how an event similar to the 1868 eruption would impact Hawaii.\n\n4)  Part 4: Methane Explosion \nProduced naturally by many biological processes (digestion, decay, etc.) and collected naturally in natural gas fields and undersea basins, methane has proven to be a useful source of energy. Yet it is conceivable that this noxious, naturally-occurring gas has the capacity to destroy modern civilization. Theories suggest that gigantic eruptions of methane gas from deep in the ocean have occurred regularly throughout history. Mega Disasters reconstructs just what such a horrifying event would be like. Even a small explosion in the mid-Pacific would create wave after wave of tsunamis, wiping out Hawaii and much of the West Coast. Hellish clouds of methane and water would burn across the skies, floods would annihilate inland regions, and most plant life would be destroyed.\n\n5)  Part 5: Glacier Meltdown \nProlonged droughts could ravage the interior of the western U.S., leading to catastrophic water shortages. Could we be facing a replay of the Dust Bowl?\n\n6)  Part 6: British Superflood \nCould the island nation of Great Britain have once been connected to Europe by land? Listen to a new theory and evidence which suggests that the English Channel was created by one of the largest floods ever\n\n7)  Part 7: Alien Infection \nCould an alien infection cause an epidemic on earth? Some experts believe that spacecraft returning from Mars could bring back a harmful sample or comet dust falling into our atmosphere could cause pandemics.\n\n8)  Part 8: New York Earhquake \nTake a look at the effects an earthquake would have on New York and its infrastructure--and the havoc it could wreak on the city.\n\n9)  Part 9: Mega Drought \nRecent warming trends in seawater and air temperature point to a possible mega drought in the next thirty to fifty years. Could we be facing a replay of the Dust Bowl of the 1930s on an even bigger scale?\n\n10)  Part 10: Super Swarms \nThe locust is one of the most destructive and dreaded life forms on Earth. American pioneers faced the largest swarm of locusts ever recorded. The 1,800 mile long and 110 mile wide cloud of insects ate their way through the heartland and blocked the sun for five days. Famine ensued, and thousands faced starvation. According to recent studies, the possibility of such a swarm returning to the United States is very likely. The destruction would be unimaginable.\n\n11)  Part 11: Oil Apocalypse \nThe oil that our world runs on won't last forever. The gap between supply and demand is ever increasing. Will alternative energy save us or is it already too late? What would happen to the world as we know it when our oil dependent industries come to a grinding halt? A worldwide depression is a certainty but a power struggle for the basic necessities of life would be complete chaos.\n\n12)  Part 12: LA Killer Quake \nIt has been a century since the infamous 1906 San Francisco earthquake and Californians live with the knowledge that it's only a matter of time before they're hit again. Los Angeles is the second most populous city in America. If an earthquake hit directly beneath downtown LA, scientists believe that tens of thousands would be killed. Just how would the city respond to a 7.5 magnitude quake?\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img52.imageshack.us/img52/5920/megadisasterscollection.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img52.imageshack.us/img52/5920/megadisasterscollection.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img20.imageshack.us/img20/9352/megadisasterscollectione.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img20.imageshack.us/img20/9352/megadisasterscollectione.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img18.imageshack.us/img18/5920/megadisasterscollection.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img18.imageshack.us/img18/5920/megadisasterscollection.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img21.imageshack.us/img21/5920/megadisasterscollection.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img21.imageshack.us/img21/5920/megadisasterscollection.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img854.imageshack.us/img854/9914/megadisasterscollectionk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img854.imageshack.us/img854/9914/megadisasterscollectionk.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img855.imageshack.us/img855/9352/megadisasterscollectione.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img855.imageshack.us/img855/9352/megadisasterscollectione.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img37.imageshack.us/img37/5920/megadisasterscollection.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img37.imageshack.us/img37/5920/megadisasterscollection.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img5.imageshack.us/img5/5920/megadisasterscollection.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img5.imageshack.us/img5/5920/megadisasterscollection.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img833.imageshack.us/img833/5920/megadisasterscollection.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img833.imageshack.us/img833/5920/megadisasterscollection.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD ISO MPEG-4\n * Video Bitrate: 1855 kbps\n * Video Resolution: 720 x 400\n * Video Aspect Ratio: 1.800 (16.9)\n * Frames Per Second: 25\n * Audio Codec: 0x2000 (Dolby AC3)\n * Audio Bitrate: 128 kb/s AC3 48000 Hz\n * Audio Streams: 2ch\n * Audio Languages: English\n * RunTime per Part 45.mins\n * Number of Parts: 12\n * Part Size: 640 MB\n * Source: DVD\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Mega_Disasters&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Mega_Disasters&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Mega%20Disasters%3A%20Collection%20One&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Mega%20Disasters%3A%20Collection%20One&lt;/a&gt;\n\n3)  ed2k Links \n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3AHarry65&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3AHarry65&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=Mega_Disasters%3A_Collection_Two&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=Mega_Disasters%3A_Collection_Two&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8916eb7cc5f6c35fb764639aa1ff68dba7c69dbf","amp;dn":"History+Ch+Mega+Disasters+Collection+Two+05of12+Glacier+Meltdown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8916eb7cc5f6c35fb764639aa1ff68dba7c69dbf","infoHashBuffer":{"type":"Buffer","data":[137,22,235,124,197,246,195,95,183,100,99,154,161,255,104,219,167,198,157,191]},"announce":[],"urlList":[]}}