{"title":"Sing-Sing - Sing-Sing and I (2006)","uid":7265822,"size":79543091,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8a9ff362a11745b5e0740746a100484cfee1a44d&amp;dn=Sing-Sing+-+Sing-Sing+and+I+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ouateit","files":-1,"time":1336884981,"description":"From Wikipedia, the free encyclopedia:\n\nSing-Sing were an English indie pop/dream pop band formed in 1997 in London. It consisted of vocalist Lisa O'Neill and guitarist/vocalist Emma Anderson, formerly of Lush. They worked with a variety of musicians to achieve a unique and eclectic sound which nodded to 60's girl groups, electronica and folk. The band released 2 albums and a variety of singles on Bella Union, Sanctuary Records and Poptones and finally on their own self created label, Aerial. They toured the States twice in 2002 taking in both SXSW in Austin and CMJ in New York. Both the band's albums were produced by Mark Van Hoen but they have also collaborated with the Mad Professor (remixed I'll Be in a Lovers Rock style), Robin Guthrie of Cocteau Twins, cellist and string-arranger Audrey Riley, Tim Keegan (Departure Lounge vocalist) and 4AD artist Vinny Miller . Live musicians for touring included 'Shifty' aka Michael Scrivens (bass), Poppy Gonzalez (keyboards), Miguel Morland (drums 1998-2000), Jenny Jones (trumpet and keyboards) and Darren Groucutt (drums 2000-2002) and Dominic del Torto (guitarist and backing vocalist 2005-2006)\n\nAt the end of December 2007, they announced via their mailing list and website that they had decided to disband:\n\n    &quot;After 10 mostly very happy but sometimes very difficult years we have decided to 'call it a day' (i.e. end) with Sing-Sing. In 2006 Emma moved to Brighton, East Sussex where she is involved in music publicity and last year Lisa wed her long-term partner Run Wrake, moved to the Kent countryside and is enjoying her newly found freedom as a mum and freelance graphic designer. Even Mark van Hoen, our erstwhile producer, is moving to the USA later in 2008.&quot;\n\n\nSing-Sing And I:\n\n1. Lover\t\n2. Come, Sing Me a Song\n3. Mister Kadali\n4. A Modern Girl\n5. Ruby\n6. I Do\n7. Going Out Tonight\n8. Unseen\n9. The Time Has Come\n10. When I Was Made\n11. A Kind of Love\n\n\nAlbum downloaded from Amazon.  Quality greater than 225kbps.","torrent":{"xt":"urn:btih:8a9ff362a11745b5e0740746a100484cfee1a44d","amp;dn":"Sing-Sing+-+Sing-Sing+and+I+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a9ff362a11745b5e0740746a100484cfee1a44d","infoHashBuffer":{"type":"Buffer","data":[138,159,243,98,161,23,69,181,224,116,7,70,161,0,72,76,254,225,164,77]},"announce":[],"urlList":[]}}