{"title":"Halloween, Alaska - All Night the Calls Came In (2011) [FLAC]","uid":6680875,"size":246057572,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b061e014995b3dd04b4b047923c258c637ef48c&amp;dn=Halloween%2C+Alaska+-+All+Night+the+Calls+Came+In+%282011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1316188769,"description":"Its ironic that Halloween, Alaskas fourth album is meant to be their most spare-sounding, straightforwardly conceived recording to date, because anyone coming to the bands music for the first time would surely consider All Night the Calls Came In to be full of carefully crafted tracks built on artfully arrayed textures. Halloween, Alaska have always been oriented toward a lush, ambient feel, and while theyve apparently striven to pare things down here it seems you just cant take the lushness out of these boys, at least not completely, and thank goodness for that. Whatever additional urgency and visceral quality may be contained here, this is still music to sink ones teeth into. The band hails from Minneapolis, and All Night feels like the product of frozen Minnesotan winter evenings where burrowing further into the deep end of the music is a more attractive option than calling it a night and heading outside. Even if those werent the circumstances under which these cuts were recorded, the album still seems like the perfect soundtrack for such a setting. The band can be seen as a link in an art rock chain that reaches back through Radiohead to Talk Talk, Blue Nile, and the more atmospheric side of Roxy Music; conventional pop song structures arent completely eschewed, but they arent taken as a given either, and electronic textures intermingle freely with traditional rock band instrumentation, to bring home gracefully gliding melodies given voice by singer/keyboardist James Diers. Halloween, Alaska may be a mythical town, but on the strength of All Night the Calls Came In, its one youll want to visit often.\n\nReleased: 2011\nGenre: Rock\nStyle: Alternative\nSource: CD\nCodec: FLAC\nChannels: Stereo\nSample Rate: 44,100 Hz\nBit Rate: ~880 kbps\nBits per Sample: 16\nCovers: Front\n\nTracks:\n \n 1. You Are Not Well\n 2. Dance by Accident\n 3. Analogue\n 4. Empire Waist\n 5. More to Come\n 6. The Jealous Ones\n 7. Dead Air\n 8. 3:1\n 9. Tables\n 10. In Your Sleep\n\nMore info: \n &lt;a href=&quot;\nhttp://allmusic.com/album/all-night-the-calls-came-in-r2255295/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/album/all-night-the-calls-came-in-r2255295/review&lt;/a&gt;","torrent":{"xt":"urn:btih:8b061e014995b3dd04b4b047923c258c637ef48c","amp;dn":"Halloween%2C+Alaska+-+All+Night+the+Calls+Came+In+%282011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b061e014995b3dd04b4b047923c258c637ef48c","infoHashBuffer":{"type":"Buffer","data":[139,6,30,1,73,149,179,221,4,180,176,71,146,60,37,140,99,126,244,140]},"announce":[],"urlList":[]}}