{"title":"Complete Guide To Home Carpentry{BBS}","uid":6681168,"size":19487967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b98cc615fe4eb42bbb8bb8d92ca72af7c4f2f8b&amp;dn=Complete+Guide+To+Home+Carpentry%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1316198453,"description":"The Complete Guide to Home Carpentry combines the most popular carpentry projects with up-to-date information on tools, techniques, and materials required for home projects. Easy-to-use photo-driven pages show readers the most common saw cuts, nailing techniques, router designs, and skills for using dozens of other tools. Projects range from framing a partition wall, building shelves, and installing windows and doors, to hanging cabinets, cutting countertops, and installing trim. Readers even learn how to remove walls for remodeling projects.\n\nThis book contains everything readers need for their projects - both new construction and repairs - in user-friendly detail. Color photos accompany each technique and project. The result is an indispensable resource for any homeowner planning a carpentry project, large or small.\n\nHighlights:\n\n    * Contains hundreds of the indoor and outdoor carpentry projects and techniques most useful to homeowners.\n    * Covers basic framing, window and door installation, and trim detail, plus installing cabinets, countertops, and shelves.\n    * Shows how to use and maintain carpentry tools, such as hand and power saws, routers, drills, sanders, and more.\n    * Competitive titles have fewer than half as many projects and techniques, and little, if any, photography.\n\nAbout the Author\nThe editors of Creative Publishing international have created dozens of best-selling titles in the fields of home repair, home improvement, home decor, and landscaping.\nProduct Details\n\n    * Paperback: 288 pages\n    * Publisher: Creative Publishing international (October 1, 2000)\n    * Language: English\n    * ISBN-10: 0865735778\n    * ISBN-13: 978-0865735774","torrent":{"xt":"urn:btih:8b98cc615fe4eb42bbb8bb8d92ca72af7c4f2f8b","amp;dn":"Complete+Guide+To+Home+Carpentry%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b98cc615fe4eb42bbb8bb8d92ca72af7c4f2f8b","infoHashBuffer":{"type":"Buffer","data":[139,152,204,97,95,228,235,66,187,184,187,141,146,202,114,175,124,79,47,139]},"announce":[],"urlList":[]}}