{"title":"HISTORY OF POP AND ROCK MUSIC - part 304","uid":6533486,"size":1267197348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8bfd6cc3ff4369caae7d4d2b02b708bec09a9f30&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+304&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1310433130,"description":"                        PART  304\n                       \n\n        CREEDENCE CLEARWATER REVIVAL  -  Bootleg  (1969)\n        CREEDENCE CLEARWATER REVIVAL  -  Green river  (1969)\n        CREEDENCE CLEARWATER REVIVAL  -  Looking Out My Back Door (1970)\n        CREEDENCE CLEARWATER REVIVAL  -  Sweet Hitch-Hiker  (1971)\n        JOHN FOGERTY  -  Susie Q  (1998)\n        JOHN FOGERTY  -  The Old Man Down the Road (1998)\n\n\n   \n                 A time to remember \n                     (photo-video)\n\n         HERMAN'S HERMITS  -  Lady Barbara  (1970)\n\n\n\n    &quot;Bootleg&quot; is a songs written by J.C. Fogerty.The song originally appears on the band's 1969 album \n&quot;Bayou Country&quot;.It is the second studio album by Creedence Clearwater Revival, released by Fantasy Records in January 1969, and was the first of three albums CCR released in that year.\n    &quot;Green River&quot;  was written by John Fogerty and was released as a single in July 1969, one month before the album of the same name was released.The song &quot;Green River&quot; was based on a place where Fogerty used to stay on Putah Creek. The title of the song comes from the label of a flavored-syrup bottle, which was called &quot;Green River&quot;.&quot;Green River&quot; was certified gold (500,000 units sold) by the Recording Industry Association of America on December 13, 1990. Country band Alabama recorded a cover version of the song that appears on their 1982 album &quot;Mountain Music&quot;.  \n    &quot;Lookin' out My Back Door&quot; is a song recorded by CCR and written by John Fogerty. It was included on their 1970 album &quot;Cosmo's Factory&quot;, the group's fifth album. The song's lyrics, filled with colorful, dream-like imagery, led some to believe that the song was about drugs. According to the drug theory, the &quot;flying spoon&quot; in the song was a cocaine spoon, and the crazy animal images were an acid trip. Fogerty, however, has stated in interviews that the song was actually written for his then three-year old son, Josh. Fogerty has also said that the reference to a parade passing by was inspired by the Dr. Seuss book, &quot;And to Think That I Saw It on Mulberry Street&quot;.\n    &quot;Sweet Hitch-Hiker&quot; is a song by Creedence Clearwater Revival from their 1972 album &quot;Mardi Gras&quot;. It was first released as a single in 1971 and reached #6 on the Billboard Hot 100. On the Record Retailer UK Singles Chart, it peaked at #36.The song was written by John Fogerty, and it has been described as a &quot;classic John Fogerty stomper&quot; by author Hank Bordowitz. The song mentions the Greasy King, a restaurant in the El Cerrito part of California where the band grew up and are from..  \n    &quot;Susie Q&quot; is a song by Louisiana-born singer and guitarist Dale Hawkins. He wrote the song himself, but when it was released, Stan Lewis, the owner of Jewel/Paula Records, and Eleanor Broadwater, the wife of Nashville DJ Gene Nobles, were also credited as co-writers to give them shares of the royalties.\nThe song has been covered by numerous artists. Perhaps the most famous cover version is by Creedence Clearwater Revival on their debut album released in 1968. This song was one of their first big hits, and was the band's only Top 40 hit that was not written by John Fogerty, peaking at #11, but made the top ten on some charts.\n    &quot;The Old Man Down the Road&quot; is a popular song written and recorded by John Fogerty. It was released in 1985 and became a top 10 hit single, peaking at #10 on the US singles chart, and spending three weeks at the #1 spot on the Billboard Top Rock Tracks chart.\n\n    &quot;Lady Barbara&quot; is a song by  Peter Noone and Herman's Hermits. Single 7 released in Uk in 1970 by Rak.This release entered UK charts on November 14 1970. The total number of weeks this release was in charts was 12 and the highest place ever reached was number 13.\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:8bfd6cc3ff4369caae7d4d2b02b708bec09a9f30","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+304","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bfd6cc3ff4369caae7d4d2b02b708bec09a9f30","infoHashBuffer":{"type":"Buffer","data":[139,253,108,195,255,67,105,202,174,125,77,43,2,183,8,190,192,154,159,48]},"announce":[],"urlList":[]}}