{"title":"DivineBitches-------13116-AshleyFires RomanRivers","uid":6540690,"size":794534003,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8d9c9aafde215f1bef25b140df2c6461f86ed4c5&amp;dn=DivineBitches-------13116-AshleyFires+RomanRivers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":300,"time":1310675521,"description":"From Kink.com   ( DivineBitches )  + Pics\n\n\n\nPantyhose Fetish \n\n[Pan-tee-hohz Fe-tish] \n\n-noun \n\n1.Pantyhose fetishism is a very common fetish involving women's pantyhose. As with many other common fetishes it has been suggested that it first surfaces in early childhood and/or during adolescence. The unique silky sheer aspect is the allure of these items. Many current day males' fetishistic preferences for pantyhose is related to the fact that pantyhose are in virtual direct contact with female genitalia and/or perhaps even more important are the preferred hosiery for most women when skirts and dresses are worn.\n\n\nRoman Rivers is a pantyhose fanatic. The feel of the silky smoothness, the scent of the woman that gets trapped inside the gusset and the thought of his cock rubbing against the sheer fabric is enough to send him right over the edge. Mistress Ashley Fires takes advantage of this vulnerability, ties him up with pantyhose, makes him sniff used pantyhose from the other Divine Bitches, teases his cock with her pantyhose and whips him for getting hard and being such a dirty little pantyhose pervert. Ashley dresses Roman in a pair of her pantyhose, spanks and humiliates him while wearing an ass hook. He's made to sniff the sweaty scent of her delicious asshole through her hose while she gets off and then he's strap-on ass fucked through a ripped hole in the pantyhose. Mistress Ashley is so horny by the humiliation she encases her pantyhose slut in all the Divine Bitches worn pantyhose leaving just his cock out to use for her pleasure. After she takes what she wants her slave is made to cum humiliatingly all over his own encased face!\n\n\n\nScreens &lt;a href=&quot; http://www.divinebitches.com/site/shoot.jsp?shootId=13116&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.divinebitches.com/site/shoot.jsp?shootId=13116&lt;/a&gt;\n\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:8d9c9aafde215f1bef25b140df2c6461f86ed4c5","amp;dn":"DivineBitches-------13116-AshleyFires+RomanRivers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d9c9aafde215f1bef25b140df2c6461f86ed4c5","infoHashBuffer":{"type":"Buffer","data":[141,156,154,175,222,33,95,27,239,37,177,64,223,44,100,97,248,110,212,197]},"announce":[],"urlList":[]}}