{"title":"Ingram Hill...Look Your Best(2010)[FLAC]","uid":6685970,"size":271112599,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f126455730742fdc0031e8b892dbc12dedb82d4&amp;dn=Ingram+Hill...Look+Your+Best%282010%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":14,"time":1316411294,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/dro300/o375/o37515fmcnt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/dro300/o375/o37515fmcnt.jpg&lt;/a&gt;\n\nLook Your Best [2010]Rock Ridge Music / 61299\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 Broken Lover Ingram Hill 3:04 \n2 Lady Grey Ingram Hill 4:15 \n3 As Long as I'm with You Ingram Hill 3:47 \n4 Hey Girl Harris, Ingram Hill 3:56 \n5 Burn Out Your Flame Ingram Hill 3:21 \n6 Come Around Ingram Hill 3:56 \n7 Miss Kennedy Ingram Hill 3:58 \n8 The Hardest Part Chambless, Ingram Hill 3:39 \n9 Ready for the Sun Ingram Hill 4:13 \n10 Wish You'd Stay Ingram Hill 3:26 \n\nHaving lost career momentum and their major-label berth after the disappointing 2007 album Cold in California, Ingram Hill re-enlist producer Rick Beato (who helmed the breakthrough 2004 CD June's Picture Show) and again take dead aim at the Adult Top 40 chart and their young adult female fan base with their third full-length, Look Your Best. Lead guitarist Phil Bogard comes up with riffs that have just enough rock aggression without being off-puttingly hard, and lead singer Justin Moore's tunes have singable choruses. The lyrics, which Moore sings with aching sincerity, stick close to surface emotions, as he muses about the ups and downs of romance while living a life on the road and, at least a couple of times, seems to be complaining about the difficulties of dealing with the music business. But even when his job is getting him down, Moore knows it will be all right &quot;As Long as I'm with You.&quot; It's this sort of straightforward emotional statement that must make the band's female fans swoon, but that's nothing in comparison with the power ballad &quot;Hey Girl,&quot; an ode to feminine self-esteem, in which Moore assures plain Janes everywhere that it's them he's attracted to, not the hotties standing next to them who are trying to catch his eye. The song is designed to have audience members raising their cell phones in the air and waving them back and forth in solidarity. Pandering? Yes. But probably also irresistible. This is a guy who can even make a backstage encounter sound romantic in &quot;Miss Kennedy.&quot; There are, thus, several songs on Look Your Best that are capable of leading Ingram Hill back onto their upward career path with luck, hard work, and some promotion. (The group has eased out drummer Matt Chambless who, even though he plays on every track here, is not pictured on the cover and is credited only as a sideman. Ironically, that makes him the only member of the group, however erstwhile, to actually have his name in the credits. The remaining members seem to want to be known as Phil, Zach [Kirk, the bassist], and Justin, as they are in the acknowledgments, the better to seem even more fan friendly.)\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/06/ingram-hill/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/06/ingram-hill/&lt;/a&gt;","torrent":{"xt":"urn:btih:8f126455730742fdc0031e8b892dbc12dedb82d4","amp;dn":"Ingram+Hill...Look+Your+Best%282010%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f126455730742fdc0031e8b892dbc12dedb82d4","infoHashBuffer":{"type":"Buffer","data":[143,18,100,85,115,7,66,253,192,3,30,139,137,45,188,18,222,219,130,212]},"announce":[],"urlList":[]}}