{"title":"Reims - Kathedrale der Koenige","uid":6679644,"size":559072122,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8f81102a5d5a8591a51d93c63ef8dc572275dbd0&amp;dn=Reims+-+Kathedrale+der+Koenige&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"erbswurst","files":-1,"time":1316155756,"description":"Als Koenigin der franzoesischen Kathedralen wird sie bezeichnet, die Kathedrale von Reims, die zugleich die Kathedrale der Koenige ist - beinahe 1000 Jahre lang werden hier die franzoesischen Koenige gesalbt und gekroent.\n\nDer Film verfolgt zwei Spuren der faszinierenden Geschichte des mittelalterlichen Europas. Zum einen gehen wir den architektonischen Glanzleistungen dieser Epoche nach; keine spaetere Generation wird die unglaublichen Anstrengungen der Gotik wiederholen koennen. Filigrane und zugleich maechtige Bauwerke, die gen Himmel streben und die fuer die Ewigkeit errichtet scheinen. Wie gelang es den Menschen des Mittelalters, ihrem Gott diese Ehrbietung darzubringen? Welche Glaubenswelt spiegeln diese Kirchen wider? Untrennbar mit diesem heiligen Ort verbunden ist die nationale Geschichte Frankreichs: die Monarchen baten hier um die goettliche Legitimierung ihrer Herrschaft.\n\nDoch der Film sucht nicht nur nach den Spuren laengst vergangener Zeiten, sondern fragt auch die Bedeutung der Kathedrale in der Gegenwart. Symbol des Martyriums des franzoesischen Volkes in den schrecklichen Kriegen des 20. Jahrhunderts, fragen wir nach der Beziehung der heutigen Menschen zu diesem Bauwerk. Heute ist es Luftverschmutzung und saurer Regen, der an der Koenigin der Kathedralen nagt. Unsere Bilder dokumentieren den taeglichen Kampf gegen Luftverschmutzung und sauren Regen und zeigen die Restaurierungsanstrengungen, die verschiedenste Menschen unternehmen, um dieses einmalige Bauwerk zu retten.\n\nSchauplaetze der Weltkulturen: Reims\nKathedrale der Koenige\n\nBayerischer Rundfunk 2002\nRegie: Georg Graffe","torrent":{"xt":"urn:btih:8f81102a5d5a8591a51d93c63ef8dc572275dbd0","amp;dn":"Reims+-+Kathedrale+der+Koenige","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f81102a5d5a8591a51d93c63ef8dc572275dbd0","infoHashBuffer":{"type":"Buffer","data":[143,129,16,42,93,90,133,145,165,29,147,198,62,248,220,87,34,117,219,208]},"announce":[],"urlList":[]}}