{"title":"Hoore Hoore","uid":7354998,"size":386220285,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9038103376832bcdca109b64b4f2c10036ce8252&amp;dn=Hoore+Hoore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zaini711","files":-1,"time":1339732169,"description":"Language: Malay\n\nRunning Time: 93 mins\n\nGenre: Romance\n\nDirector: Saw Teong Hin\n\nCast: Harun Salim Bachik, Farah Nazirah, Akim AF7,\n\nThe movie based on the music of the legendary Sudirman.\n\nThis musical tells the story of a girl named Nurul Aiman who possesses a chubby body, less-than-desirable physical features and a naive but kind heart. Despite her looks, she is as much a lady as other girls her age. Her best friends are Lana dan Azadan, whom she has known since childhood and she lives in a backwater village with her mother Lia, her father Hairil and her grandmother Nenda Zaimah. In school, Aiman is friends with a guy named Johari, who is good-looking and smart, and who also secretly harbours feelings for Aiman. At the same time, Lana and the most popular girl in school, Rita, fancy Johari. Despite her beauty, Rita is an egoistic girl who always tries to find trouble with Aiman. With all these complications brewing yet blissfully unaware of them, Aiman's only wish is to win the Beauty Pageant contest held by a magazine. Seeing this an her opportunity to win Johari over and shame Aiman once and for all, Rita decides to enter the contest as well. Will this end well for Aiman?\n\n\nPLEASE DONATE TO KEEP MY SEEDS CONNECTION ALIVE\n\nPaypal\n \n\nPlease visit website HTTP://JIKA1.COM to show support\t","torrent":{"xt":"urn:btih:9038103376832bcdca109b64b4f2c10036ce8252","amp;dn":"Hoore+Hoore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9038103376832bcdca109b64b4f2c10036ce8252","infoHashBuffer":{"type":"Buffer","data":[144,56,16,51,118,131,43,205,202,16,155,100,180,242,193,0,54,206,130,82]},"announce":[],"urlList":[]}}