{"title":"FreedomFest Las Vegas 2008","uid":7305153,"size":13914824797,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:97504320b0913e7e31763b55d7a50e3ff4f00958&amp;dn=FreedomFest+Las+Vegas+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Freedom37","files":-1,"time":1338168721,"description":"ABOUT\n\nFreedomFest is an annual festival where free minds meet to celebrate &quot;great books, great ideas, and great thinkers&quot; in an open-minded society. It is independent, non-partisan, and not affiliated with any organization or think tank. Founded and produced by Mark Skousen since 2002, FreedomFest invites the &quot;best and the brightest&quot; from around the world to talk, strategize, socialize, and celebrate liberty. FreedomFest is open to all and is purely egalitarian, where speakers, attendees, and exhibitors are treated as equals.\n\nSince its inception, FreedomFest has met in Las Vegas, the world's most libertarian city. Where else can you see a great show, eat at a five-star restaurant, visit a museum, enjoy the entertainment, or see the lights and sounds of the world's freest resorts and casinos after a long day of intellectual learning and debate? Who should attend FreedomFest? It's open to anyone who enjoys a wide interest in books, art, music, film, and drama in all topics, including science, philosophy, economics, health, sports, technology, business, religion, law, and politics. FreedomFest attracts people of all walks of life and across the political spectrum to learn, debate and honor great books, great ideas, and great thinkers.\n\n\nSince starting FreedomFest, we've received numerous compliments for creating this unique event, and suggestions on how to improve the next festival. After the first FreedomFest, noted author and philosopher Nathaniel Branden told the audience, &quot;I feel an electricity here I have not felt in years.&quot; And Alex Green, director of the Oxford Club, recently told me, &quot;I still consider FreedomFest the best conference I have ever attended.&quot; And John Mackey, founder and CEO of Whole Foods Market, told me, &quot;I wouldn't miss it for the world.&quot; The producer of C-SPAN Book TV has filmed FreedomFest every year, telling us she loves the format and looks forward to the next festival. We hope you will join it too.\n\n\nWEBSITES\n\nFor more information or to attend the next conference, visit http://freedomfest.com/\n\n\nCSPAN features select video from past FreedomFests: http://www.c-spanvideo.org\n\n\nPURCHASE FREEDOMFEST\n\nCd's &amp; Dvd's from past FreedomFests can be purchased at: http://www.miracleofamerica.com/","torrent":{"xt":"urn:btih:97504320b0913e7e31763b55d7a50e3ff4f00958","amp;dn":"FreedomFest+Las+Vegas+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97504320b0913e7e31763b55d7a50e3ff4f00958","infoHashBuffer":{"type":"Buffer","data":[151,80,67,32,176,145,62,126,49,118,59,85,215,165,14,63,244,240,9,88]},"announce":[],"urlList":[]}}