{"title":"Sandboxie 3.72 Final (x86) {BLOVES}","uid":7360275,"size":2754860,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:97cbb3e55bb3a1c7b286eec9b84d20c20c0f35b1&amp;dn=Sandboxie+3.72+Final+%28x86%29+%7BBLOVES%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BLOVES","files":5,"time":1339938363,"description":"[u][i][b]Sandboxie 3.72 Final (x86) {BLOVES}[/b][/i][/u]\n\n\n[i][b]Sandboxie 3.72 Final (x86) {BLOVES}[/b][/i]\n\n[i]\nSandboxie is a proprietary sandbox-based isolation program developed by Ronen Tzur, for 32-bit Windows NT-based operating systems. It creates a sandbox-like isolated operating environment in which applications can be run or installed without permanently modifying the local or mapped drive. An isolated virtual environment allows controlled testing of untrusted programs and web surfing.Sandboxie runs your programs in an isolated space which prevents them from making permanent changes to other programs and data in your computer. When you run a program on your computer, data flows from the hard disk to the program via read operations. The data is then processed and displayed, and finally flows back from the progam to the hard disk via write operations. Sandboxie changes the rules such that write operations do not make it back to your hard disk.\nThe main function performed by this program - the protection and preservation of your computer in working condition. This is achieved by creating a system of &quot;temporary storage&quot;, similar to the cache. All activities on the Internet by individual users, all the processes to install the software does not use a permanent change of system parameters, and temporary storage Sandboxie. With this you can quite easily do a &quot;rollback&quot;. The program is configured to use any browsers supported email client, but only one - Outlook Express. The target audience of the program Sandboxie is large enough, from the people testing the software to private users who use the Internet, or simply do not want to harm your computer unknown program.\n\nChanges in Sandboxie 3.72 Final:\n- The changes to Sandboxie since version 3.70 focus primarily on improving compatibility with Flash version 11.3.\n- Upgrade Sandboxie to fix audio loss issues and crashes when viewing Flash content in a browser running under Sandboxie.\n- If you use Firefox, please also make sure to upgrade to Firefox version 13.1.\n\n[/i]\n\n","torrent":{"xt":"urn:btih:97cbb3e55bb3a1c7b286eec9b84d20c20c0f35b1","amp;dn":"Sandboxie+3.72+Final+%28x86%29+%7BBLOVES%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97cbb3e55bb3a1c7b286eec9b84d20c20c0f35b1","infoHashBuffer":{"type":"Buffer","data":[151,203,179,229,91,179,161,199,178,134,238,201,184,77,32,194,12,15,53,177]},"announce":[],"urlList":[]}}