{"title":"Thames.Television.Crime.Inc.7of7.The.Old.Mob.and.the.New.XviD.AC","uid":6666226,"size":854847488,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99942d7acbc015eef75d70a2503dee636e75da77&amp;dn=Thames.Television.Crime.Inc.7of7.The.Old.Mob.and.the.New.XviD.AC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DocFreak08","files":-1,"time":1315692345,"description":"\nWith archive film including home movies and FBI surveillance material, the award-winning Crime Inc. tells the true story behind the world's most powerful crime syndicate, the Mob, La Cosa Nostra or The Mafia. \n\nInterviews with mob members turned informants, including former boss Jimmy 'The Weasel' Fratianno, reveal the inner workings of the mafia, from the ritual of becoming a 'made' man and their code of honor, to the harrowing and detailed descriptions of their work, accompanied by equally graphic images and film footage.\n\nCrime Inc. dared to get close to the heart of 'The Family' and the result is frightening and compelling. Forget what you have seen in the movies. The fact is more shocking than the fiction.\n\n\nThe television series Crime Inc was produced in 1984 by the Thames Television, then offered for American syndication. This brilliantly assembled seven-part documentary of the rise of organized crime in America during the Prohibition years lay on the shelf until Geraldo Rivera's 1986 'investigation' of Al Capone's vault turned out to be the highest-rated syndicated special in history. The suddenly renewed interest in past criminal activity enabled D. L. Taffner, Crime Inc's distributor, to secure choice play dates in many American TV markets. \n\nThe project had an advantage over most documentaries in having interviews with modern day villains including ex-Los Angelas crime boss and noted hitman, Jimmy 'The Weasel' Fratianno, and the refined and smooth talking Ray Ferritto...the hitman who blew up Irishman Danny Greene, solving the mob's problems in Cleveland. Crime Inc later ran on the Arts &amp; Entertainment cable service as 'Crime in America'. \n\n\nEpisode 7 : The Old Mob and the New\n\nIn this final episode, the documentary investigates the presence of the Mob in the illicit drug trade. Since the mid-'80s, drug trafficking has reached epidemic proportions in America. The episode portrays how Mafia cartels in both the United States and Latin America are behind much of the drug scene, with its attendant culture of violence and death. The efforts and efficacy of the American government to stem the tide of illegal drugs are examined.\n\n\nTechnical Specs \n----------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2064 kbps\nVideo Resolution: 624x464\nVideo Aspect Ratio: 1.345:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 50:22.120\nNumber Of Parts: 7\nPart Size: 815 MB\nRipped by: DocFreak08 ","torrent":{"xt":"urn:btih:99942d7acbc015eef75d70a2503dee636e75da77","amp;dn":"Thames.Television.Crime.Inc.7of7.The.Old.Mob.and.the.New.XviD.AC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99942d7acbc015eef75d70a2503dee636e75da77","infoHashBuffer":{"type":"Buffer","data":[153,148,45,122,203,192,21,238,247,93,112,162,80,61,238,99,110,117,218,119]},"announce":[],"urlList":[]}}