{"title":"Patriji Dhyana Maha Chakram - 2,Day 3","uid":7369764,"size":4345200739,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9ac34ba4eda07d3f69f379af286878b6d290a88a&amp;dn=Patriji+Dhyana+Maha+Chakram+-+2%2CDay+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"siva159","files":17,"time":1340202198,"description":"About Dhyana Mahachakram:\nDhyana Mahachakram is the annual congregation of lakhs of meditators, pyramid masters and spiritual gurus in one location. This is held during the last 11-days of the calendar year - from Dec 21 to Dec 31.\nEach day begins with a powerful mass meditation session early in the morning for 3-4 hours. With Patiji guiding the meditators with his music, this is a must-participate session - every day - at the event. It is a great sight to see lakhs of meditators sitting under large halls/covered areas, immersed in deep meditation, aided by blissful music. The entire place is filled with wonderful, enlightening energies. Patriji's message, every day, soon after this morning meditation is a highlight of this event. Patriji's words of wisdom are simple, powerful and instantly absorbed by the audience.\nThe rest of the day is filled with several discourses, experience sharing sessions by spiritual masters and music sessions. The day culminates with a grand evening where a spiritual guru along with Patriji shares messages on meditation, vegetarianism, spirituality and well-being. This is followed by a colorful, entertaining cultural programmes.\nDhyana Maha Chakram has become similar to an annual 'pilgrimage' for millions of meditators and a much-awaited event for meditators to learn, share and enjoy the peace and wisdom gained through meditation.\nThe 11-day event is also a logistical wonder - with lakhs of people provided with free accommodation and food. The peaceful, disciplined way the lakhs of meditators conduct themselves at the event is a sign to behold and provides testimony to the oneness realized through meditation.\n\nTotal videos : 5\nTotal Size : 4.04 GB\nVideo Resolution : 720*576\nVideos Length : ~ 4 Hrs\nVideo bit rate : 1856Kbps ; 25 frames/Sec\nVideo Codec : MPEG\nAspect ratio : 4:3\nAudio bitrate : 224Kbps,48kHz,2-Channel\nAudio Codec : MPEG\nFile Format : VOB\nRecommended Player : Vlc\nSource : DVD\nScreen shots added\n\nScreen shots are scaled to low resolution","torrent":{"xt":"urn:btih:9ac34ba4eda07d3f69f379af286878b6d290a88a","amp;dn":"Patriji+Dhyana+Maha+Chakram+-+2%2CDay+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac34ba4eda07d3f69f379af286878b6d290a88a","infoHashBuffer":{"type":"Buffer","data":[154,195,75,164,237,160,125,63,105,243,121,175,40,104,120,182,210,144,168,138]},"announce":[],"urlList":[]}}