{"title":"Chronostorm-HI2U","uid":6677306,"size":966817020,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9ac7142269f86ecee5c2c2f435d96b6c1edcf00e&amp;dn=Chronostorm-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1316079693,"description":"HI2U!\n\n\nChronostorm: Siberian Strike (c) Ulysses Games\n\nRelease date : September 14th, 2011\nProtection   : None\nType         : RTS\nSize         : 20 x 15mb\n\n\nDescription:\n~~~~~~~~~~~~\nChronostorm: Siberian Strike is a dynamic real-time strategy game about the\nhot battles that could happen in the near future at the eastern boarders of\nRussia. In 2015, Chinese army invades Eastern part of Russia, following the\ninterests of the largest corporation called &quot;Way of Dragon&quot;. Using unique\nsecret technologies of time control, they manage to move far inland to\nSiberia. Your need to learn these time control skills and to kick the enemies\nout of the country!\nKey Features:\n\n*  Time control Till now it was an exclusive priority of shooters and action\n   games, and now it came to RTS! You can stop the time in the chosen area or\n   to use in the battle combat units from the past or from the future!\n\n*  Realism. In the game you will see real territories where the battles could\n   happen. You will defend recognizable locations of the Russian East or lead\n   your troops along the Great Wall! Every unit in the game is also designed\n   accurately based on the modern prototypes.\n\n*  Up-to-date graphics and high dynamics. Colorful explosions, flying rocks\n   and pieces of units, roar of artillery and highly detailed models will let\n   you feel the heat and adrenalin of the real battles.\n\n*  Wide choice of tactics. You will have to be smart and cunning using the\n   natural features of different locations and objects, unique abilities of\n   different units and time control options. You can use almost everything\n   around you, and your success depends to a large extent on you tactics!\n\n*  Multiplayer. Play with your friends via LAN or Internet for any of the\n   fighting countries! \n\n\nInstall:\n~~~~~~~\nUnrar, mount/burn image &amp; install. Enjoy.","torrent":{"xt":"urn:btih:9ac7142269f86ecee5c2c2f435d96b6c1edcf00e","amp;dn":"Chronostorm-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac7142269f86ecee5c2c2f435d96b6c1edcf00e","infoHashBuffer":{"type":"Buffer","data":[154,199,20,34,105,248,110,206,229,194,194,244,53,217,107,108,30,220,240,14]},"announce":[],"urlList":[]}}