{"title":"Human Recognition At A Distance In Video (2010)","uid":6542805,"size":14319314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ad2b8671fa9ad0dd66928b6e8000f4ef28e6696&amp;dn=Human+Recognition+At+A+Distance+In+Video+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"theLEAK","files":-1,"time":1310754252,"description":"Most biometric systems employed for human recognition require physical contact with, or close proximity to, a cooperative subject. Far more challenging is the ability to reliably recognize individuals at a distance, when viewed from an arbitrary angle under real-world environmental conditions. Gait and face data are the two biometrics that can be most easily captured from a distance using a video camera.\n\nThis comprehensive and logically organized text/reference addresses the fundamental problems associated with gait and face-based human recognition, from color and infrared video data that are acquired from a distance. It examines both model-free and model-based approaches to gait-based human recognition, including newly developed techniques where the both the model and the data (obtained from multiple cameras) are in 3D. In addition, the work considers new video-based techniques for face profile recognition, and for the super-resolution of facial imagery obtained at different angles. Finally, the book investigates integrated systems that detect and fuse both gait and face biometrics from video data.\n\nTopics and features: discusses a framework for human gait analysis based on Gait Energy Image, a spatio-temporal gait representation; evaluates the discriminating power of model-based gait features using Bayesian statistical analysis; examines methods for human recognition using 3D gait biometrics, and for moving-human detection using both color and thermal image sequences; describes approaches for the integration face profile and gait biometrics, and for super-resolution of frontal and side-view face images; introduces an objective non-reference quality evaluation algorithm for super-resolved images; presents performance comparisons between different biometrics and different fusion methods for integrating gait and super-resolved face from video.\n\nThis unique and authoritative text is an invaluable resource for researchers and graduate students of computer vision, pattern recognition and biometrics. The book will also be of great interest to professional engineers of biometric systems.","torrent":{"xt":"urn:btih:9ad2b8671fa9ad0dd66928b6e8000f4ef28e6696","amp;dn":"Human+Recognition+At+A+Distance+In+Video+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ad2b8671fa9ad0dd66928b6e8000f4ef28e6696","infoHashBuffer":{"type":"Buffer","data":[154,210,184,103,31,169,173,13,214,105,40,182,232,0,15,78,242,142,102,150]},"announce":[],"urlList":[]}}