{"title":"Engine Kid - Angel Wings (1995) [www.nautilus-bt.org]","uid":6682944,"size":87159313,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c253f8bd6d53a6985287f0b55ade08f7737c5a4&amp;dn=Engine+Kid+-+Angel+Wings+%281995%29+%5Bwww.nautilus-bt.org%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PittaSk8","files":16,"time":1316275183,"description":"Engine Kid - Angel Wings (1995) [www.nautilus-bt.org]\n\nJoin [url]http://www.nautilus-bt.org/[/url]\n\n[img]http://i.imgur.com/flEdC.jpg[/img]\n\nStoria del gruppo :\n\nEngine Kid era un trio di Seattle dedito ad una sorta di post-rock ispirato agli Slint. Dopo il debutto con l'EP &quot;Astronaut&quot;, fecero uscire due album: &quot;Bear Catching Fish&quot; (C/Z 1993), con una varietÃƒÂ  di influenze che andava dai Cop Shoot Cop (Bear Catching Fish) ai King Crimson (Bullfight) e ai Dinosaur Jr (Cabin Fever). Il secondo fu &quot;Angel Wings&quot; (Revelation 1995), che invece faceva sfoggio di un duro e intransigente jazz- hardcore (Holes to fight in). Il chitarrista Greg Anderson successivamente formÃƒÂ² i Goatsnake con Greg Rogers e Guy Pinhas degli Obsessed e il cantante dei Wool Pete Stahl. Il primo album omonimo del 1999 su Rise Above e &quot;Flower of Disease&quot; (Southern Lord 2000), vedeva il quartetto alle prese con un doom-gothic-metal piuttosto standardizzato. Nel frattempo Anderson varava un nuovo progetto, Sunn O))), un duo col bassista Stephen O'Malley (presente come chitarrista anche nei Khanate), una sorta di tributo al suono ultra-tenebroso degli Earth. Il mini-album &quot;Sunn&quot; (Hydra Head 1998 - Southern Lord 2005) era soltanto una imitazione, mentre il monumentale &quot;Zero Zero Void&quot; (Rise Above, 2000 - Dirter Promotions, 2003 - Daymare, 2008) nel complesso segnava una certa orginalitÃƒÂ ; quattro lunghe cavalcate per soli chitarra e basso, che riescono addirittura a superare la pesantezza e la lentezza degli Earth. Si tratta di colonne sonore per menti alterate, fatta di riff giganteschi che raggiungono quasi una trascendenza zen. Sebbene molto simili nei metodi ai drones statici e al minimalismo, tutto questo sembra davvero l'esatto opposto della musica ambient. Persino i titoli danno un senso di provocazione: I've Broken Into the Tomb of King S'attiwazza, KO Your Eunuch Tendencies, Show us Your Slime, Rubble Me I'm a 5th Century Stone Buddha. Flight Of The Behemoth (Southern Lord, 2002), ÃƒÂ¨ meno ispirato del precedente; ÃƒÂ¨ come se ne contenesse gli scarti. Si salvano Mocking Solemnity e Death Becomes You, che formano un unico, lungo incubo rievocante il disco precedente. White1 (Southern Lord, 2003), con Rex Ritter (Jessamine) e Joe Preston (Melvins) al fianco di Anderson e O'Malley continua a choccare con i suoi drones ultra-pesanti e i suoi monoliti sinistri (My Wall arriva a 25 minuti di lunghezza). White2 (Southern Lord, 2004) raccoglie 3 lunghi pezzi registrati nelle stesse sessions di White1. Hell-O)))-Ween ÃƒÂ¨ un classico stoner rock. bassAliens ÃƒÂ¨ un rumore avvolgente vicino alla musica cosmica. Decay2 ÃƒÂ¨ un altro incubo doom. Il disco in vinile contiene un quarto pezzo di 18 minuti, Decay. La sensazione ÃƒÂ¨ che le due parti di White siano uscite nell'ordine sbagliato: la seconda sembra veramente la migliore, mentre la prima suonava piÃƒÂ¹ come una raccolta di scarti. Nel frattempo i Goatsnake si erano riformati con il mini album Trampled Under Hoof (SOuthern Lord, 2004). L'EP Imperium (Lyderhorn, 2005) ÃƒÂ¨ un progetto parallelo di Stephen O'Malley. Greg Anderson e Stephen O'Malley sono riusciti a tirar fuori il meglio delle loro credenziali gotiche con Black One (Southern Lord, 2005), il terzo picco della carriera dei Sunn O))). Magmatico e asfissiante, claustrofobico e melmoso, questo disco eleva l'arte del metal glaciale a nuovi livelli di irrazionalitÃƒÂ . Dal passo quasi umano di It Took the Night to Believe alla carneficina di 10 minuti di Orthodox Caveman (col contributo di dissonanze elettroniche di John Wiese), dalla maestosa cover degli Immortal &quot;Cursed Realms&quot; al vortice da incubo di CandleGoat. Ma il vertice del disco e forse dell'intera carriera del duo ÃƒÂ¨ rappresentata dall'orgia gotica di Bathory Erzebet (16 minuti), che implode continuamente in se stessa, come a simulare la caduta in un buco nero.\n\nFonte: [url=http://www.scaruffi.com/vol5/engineki.html]scaruffi[/url]\n\nScheda tecnica :\n\nNome Gruppo : Engine Kid\n\nNome Mini Album : Angel Wings\n\nAnno : 1995\n\nGenere : jazz hardcore\n\nPaese : USA\n\nFormato degli mp3 : 192\n\nFormazione :\n\nGreg Anderson (vocals, guitar)\nBrian Kraft (vocals)\nJoel Phelps (alto saxophone)\nTim Midgett (trumpet)\nBill Herzog (upright bass)\nJade Devitt (drums)\n\nTitoli :\n\n01 Windshield\n02 Holes To Fight In\n03 Nailgun\n04 Anchor\n05 Expressionists\n06 Jumper Cables\t\n07 Stitches\t\n08 Fanbelt\n09 Herbie Hancock\t\n10 Lies Like Knives\n11 OlÃƒÂ©\n\nMediainfo :\n\n[code]\nGeneral\nComplete name                    : Engine Kid - Angel Wings (1995) [www.nautilus-bt.org]\\01 Windshield.mp3\nFormat                           : MPEG Audio\nFile size                        : 4.63 MiB\nDuration                         : 3mn 22s\nOverall bit rate                 : 192 Kbps\nAlbum                            : Angel Wings\nAlbum/Performer                  : Engine Kid\nTrack name                       : Windshield\nTrack name/Position              : 1\nPerformer                        : Engine Kid\nPublisher                        : Revelation\nGenre                            : Alternative\nRecorded date                    : 1995\nComment                          : PittaSk8\n\nAudio\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nMode                             : Joint stereo\nDuration                         : 3mn 22s\nBit rate mode                    : Constant\nBit rate                         : 192 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nCompression mode                 : Lossy\nStream size                      : 4.63 MiB (100%)\n[/code]\n\nJoin [url]http://www.nautilus-bt.org/[/url]\n\n","torrent":{"xt":"urn:btih:9c253f8bd6d53a6985287f0b55ade08f7737c5a4","amp;dn":"Engine+Kid+-+Angel+Wings+%281995%29+%5Bwww.nautilus-bt.org%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c253f8bd6d53a6985287f0b55ade08f7737c5a4","infoHashBuffer":{"type":"Buffer","data":[156,37,63,139,214,213,58,105,133,40,127,11,85,173,224,143,119,55,197,164]},"announce":[],"urlList":[]}}