{"title":"Handbook of Egyptian Religion ~Nozo123~","uid":6680693,"size":5370177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d44bbff184adb49d30facb1e1fb84ad817317ad&amp;dn=Handbook+of+Egyptian+Religion+%7ENozo123%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nozo123","files":1,"time":1316182414,"description":"A HANDBOOK OF EGYPTIAN RELIGION\nBY\nADOLF ERMAN\nWITH 130 ILLUSTRATI0NS\n\n\nTHE volume here translated appeared originally in 1904 as\none of the excellent series of handbooks which, in addition to\ndescriptive catalogues, are provided by the Berlin Museums for\nthe guidance of visitors to their great collections. The handbook\nof the Egyptian Religion seemed especially worthy of a\nwide circulation. It is a survey by the founder of the modern\nschool of Egyptology in Germany, of perhaps the most interesting\nof all the departments of this subject. The Egyptian\nreligion appeals to some because of its endless variety of form,\nand the many phases of superstition and belief that it\nrepresents ; to others because of its early recognition of a high\nmoral principle, its elaborate conceptions of a life after death,\nand its connection with the development of Christianity ; to\nothers again no doubt because it explains pretty things dear to\nthe collector of antiquities, and familiar objects in museums.\nProfessor Erman is the first to present the Egyptian religion\nin historical perspective; and it is surely a merit in, his work\nthat out of his profound knowledge of the Egyptian texts, he\npermits them to tell their own tale almost in their own words,\neither by extracts or by summaries. His pages are particularly\nfree from theory, and no theory is needed to enga, oe our\nattention when the facts and views disclosed are so attractive.\nThe author has written a special preface for the English\nedition, and has modified one or two points in his text as\nregards the degree in which burnt sacrifice was customary. A\nfew of the illustrations that were in the original have been\nomitted, and their places taken by others. Mr. Hilton Price\nhas especialiy to be thanked for his generosity in lending blocks\nemployed in the catalogue of his collection.\nF. LL. GRIFFITH.","torrent":{"xt":"urn:btih:9d44bbff184adb49d30facb1e1fb84ad817317ad","amp;dn":"Handbook+of+Egyptian+Religion+%7ENozo123%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d44bbff184adb49d30facb1e1fb84ad817317ad","infoHashBuffer":{"type":"Buffer","data":[157,68,187,255,24,74,219,73,211,15,172,177,225,251,132,173,129,115,23,173]},"announce":[],"urlList":[]}}