{"title":"PES2011+FIFA2011.RELOADED - by.cloud","uid":6538823,"size":11827541773,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a06d522eaa101000ce66eb76c3ae3202f71a21de&amp;dn=PES2011%2BFIFA2011.RELOADED+-+by.cloud&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cloudaxcer","files":125,"time":1310610087,"description":"images links:\n\n-pes2011:\n &lt;a href=&quot;\nhttp://i.geeksailor.com/wp-content/uploads/2010/09/PES-2011-PC-Cover-Featuring-Lionel-Messi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.geeksailor.com/wp-content/uploads/2010/09/PES-2011-PC-Cover-Featuring-Lionel-Messi.jpg&lt;/a&gt;\n\n-fifa2011:\n &lt;a href=&quot;\nhttp://shareimage.ro/images/cocnmq7hs9jofyz820kp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://shareimage.ro/images/cocnmq7hs9jofyz820kp.jpg&lt;/a&gt;\n\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\n\n\nPro Evolution Soccer 2011 (c) Konami\n\n10/2010 :..... RELEASE.DATE .. PROTECTION .......: Securom/Serial\n1 :.......... DISC(S) .. GAME.TYPE ........: Sports\n\nPRO EVOLUTION SOCCER 2011 is here and will bring digital soccer to the next\nlevel. Central to the heart and soul of PES 2011 is the idea of freedom of\nplay. This freedom invigorates the series with the most advanced set of\ngamplay improvements ever attempted by the Winning Eleven Production team,\ncoupled with the greatest stride in new content. The result will be a game\nthat allows total control over every element of play - even online - to give\nthe most lifelike soccer experience next to actually putting on a uniform and\ntaking the field.Features:Total Control: PES Productions has enhanced the\n360-degree passing ratio, offering unprecedented levels of control over every\npass, shot, throw-in, through ball and lofted through balls. Users can pass\nthe ball into space, and move their play with total freedom. Players must\nprecisely weight their passes and second-guess the runs of their team-mates\nand exploit their movement. Players even can apply pressure on opponents to\nforce them off the ball.Shot &amp; Stamina Gauge: In addition to the generic\npower gauge, the Shot &amp; Stamina meter details the player's exact level of\nfitness. Constantly sprinting will have an adverse affect on performance and\nstatisticsNew Defender AI: Defenders now hold their positions naturally,\ninstead of chasing balls that enter their area and work to close down the\nattacker to force mistakesAnimation and Player Physics: PES Productions has\ntotally reworked every element of in-game animation. These additions will\nbecome clear before even kick-off, with the players enjoying fluid, natural\nmovements, with more realistic acceleration and inertia than ever before. The\nphysicality between players is also improved, which was a priority requested\nin PES forums. Jostling and blocking now looks stunning, while there is a\nlarger variety of convincing tackling styles. Ambient animation also adds\nimmensely to the in-game atmosphere, as players behave realistically when off\nthe ball, and walk and run with a variety of individual styles.Speed of Play\nThe new level of control means that PES 2011 enjoys a more varied pace of\nplay, which depends on the situation at hand. The game will burst into life\nas counter-attacks come into play, but players can dictate the pace via slow\nbuild up or exploiting available space to surge forward. It is harder to make\nlong runs from midfield, and successful play will depend on making quick\npasses to create space.Aesthetics: PES 2010 showcased the best likenesses in\na football game, and PES 2011 ups the ante further. Facial animation has been\nenhanced, but the key advances are over 1000 all-new animations which have\nbeen recreated from the ground up using over 100 hours of motion captured\nfootage yielding more organic runs, turns, throw-ins, tackles, and\ninteraction. Tactical and Strategy: The PES Productions team has implemented\nan all new 'Drag and Drop' mechanism that can be used in every aspect of team\nmanagement. These settings are also animated to promote better understanding\nof the plays that have been altered.Feint settings: PES has always offered a\nwide range of subtle skills, feints and turns, but PES 2011 allows users to\nmap their favourite move sequences to the right stick, making them more\naccessible than ever before.Master League Online: PES 2011 will mark the\nonline debut for its much-loved Master League element, with players bidding\nagainst each other for the world's best players, and attempting to build a\nsquad that can compete with the best against online peers all over the globe.\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game, when asked for a serial enter one of the following\n\nXXXX-XXXX-XXXX-XXXX-XXXX ... check nfo\n\n4. Copy over the cracked content\n5. Play the game\n\n\n\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\n\n\nFIFA 11 (c) Electronic Arts Inc\n\n09/2010: RELEASE.DATE .. PROTECTION: Securom\n1: DISC(S) .. GAME.TYPE: Sports\n\nBuilding on the FIFA Soccer 10 gameplay that won 50 sports game of the\nyear awards, FIFA Soccer 11 reinvents player authenticity - on and off\nthe ball - for every player and at every position on the pitch with\nPersonality+, an all-new feature that sees individual abilities\nreflected in game, enabling clear differentiation for every player\nNew customization features will also give players the ability to bring\ntheir own style to the highest rated sports game ever\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game. Use the keygen in the Crack dir\n4. Copy over the cracked content\n5. Play the game\n\n\n------------------------------------------------------------------------------------------------------------------------enjoy----------------------------------------------------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:a06d522eaa101000ce66eb76c3ae3202f71a21de","amp;dn":"PES2011%2BFIFA2011.RELOADED+-+by.cloud","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a06d522eaa101000ce66eb76c3ae3202f71a21de","infoHashBuffer":{"type":"Buffer","data":[160,109,82,46,170,16,16,0,206,102,235,118,195,174,50,2,247,26,33,222]},"announce":[],"urlList":[]}}