{"title":"Capitan America [DivX ita mp3][Nautilus-bt]","uid":6676196,"size":735737856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a25f445fbc948d60cd3f8f8d242aa06329b4317f&amp;dn=Capitan+America+%5BDivX+ita+mp3%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"someuser11","files":1,"time":1316037348,"description":"Capitan America ÃƒÂ¨ un film del 1990, diretto da Albert Pyun, basato sull'omonimo personaggio dei fumetti Marvel Comics creato nel 1941 da Joe Simon e Jack Kirby.\nIl film, dal budget molto basso, ebbe uno scarso successo sia di pubblico che di critica. Venne distribuito il 14 dicembre 1990 in Gran Bretagna, negli anni successivi in altri paesi\n\n:::-&gt; Trama &lt;-:::\n\nNel corso della seconda guerra mondiale alcuni nazisti selezionano un bambino italiano, Tadzio De Santis, per sottoporlo a degli esperimenti sulla mutazione. Creano cosÃƒÂ¬ Teschio Rosso, un aberrante mostro dotato di superforze. Nel team medico vi ÃƒÂ¨ anche la dottoressa Vaselli che tenta di opporsi alla sperimentazione sugli umani, ma il tentativo fallisce ed ÃƒÂ¨ costretta alla fuga. Reimpiegata per le forze militari statunitensi aderisce al progetto per la creazione del supermilitare, sperimentando sul soldato Steve Rogers una modificazione che lo trasforma in Capitan America. La sua prima missione ÃƒÂ¨ perÃƒÂ² un fallimento: introdottosi in un rifugio nazista viene sconfitto da Teschio Rosso e legato a un missile indirizzato sulla Casa Bianca: all'ultimo Capitan America riesce ad evitare l'impatto, ma il missile devia sull'Alaska dove rimane intrappolato nel ghiaccio per piÃƒÂ¹ di cinquant'anni. Il momento viene immortalato in foto da un bambino.\nRitrovato da un gruppo di esploratori il supereroe ÃƒÂ¨ rimasto ibernato e tenta di ritrovare la sua casa dove, una volta giunto, scopre che il tempo per gli altri ÃƒÂ¨ normalmente passato mentre lui ÃƒÂ¨ rimasto sempre lo stesso. Lo vede soprattutto in Bernice, la sua fidanzata di allora, che ÃƒÂ¨ invecchiata. Nel frattempo Teschio Rosso, a cui ÃƒÂ¨ stato donato un viso umano dopo il crollo del Reich per renderlo irriconoscibile, opera dall'Italia rapendo il presidente degli Stati Uniti. Sulle tracce di Capitan America, il cui rinvenimento ÃƒÂ¨ riportato su tutti i giornali, vi ÃƒÂ¨ proprio il presidente che era il bambino che aveva scattato la foto al supereroe anni prima. L'uomo viene ritrovato nel palazzo italiano di Teschio Rosso, grazie alle indagini di Capitan America e della figlia di Bernice, Sharon, intenzionata a vendicare la madre uccisa da un manipolo di manigoldi assoldati da Teschio Rosso per catturare l'atavico nemico.\nI due si scontrano nella fortezza dove Capitan America ha la meglio sul malvagio..\n\n","torrent":{"xt":"urn:btih:a25f445fbc948d60cd3f8f8d242aa06329b4317f","amp;dn":"Capitan+America+%5BDivX+ita+mp3%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a25f445fbc948d60cd3f8f8d242aa06329b4317f","infoHashBuffer":{"type":"Buffer","data":[162,95,68,95,188,148,141,96,205,63,143,141,36,42,160,99,41,180,49,127]},"announce":[],"urlList":[]}}