{"title":"The Microphone Handbook{BBS}","uid":6681263,"size":8852243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a33be82fe5e1a2d7cf585a80d216b4f0e44e367b&amp;dn=The+Microphone+Handbook%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316202379,"description":".this is a very interesting book which is well written and copiously illustrated with both graphs and pictures throughout. For anyone involved in using, specifying or manufacturing microphones this will prove an invaluable read.&quot; - Lighting and Sound International\n\n\n&quot;Besides being a &quot;must-have&quot; reference source for recording engineers, producers or anybody who desires to better understand and utilize mics, The Microphone Book is an engaging read from its first chapter on microphone history to the 21st chapter and Eargle's unique take on classic microphones and their influence on the art and science of recording...The Microphone Book is unique in its balance of broad and meticulously detailed practical information.&quot; - Music Connection magazine\n\nReviews for the previous edition:\n&quot;John has brought his successful experience in classical and other music recording to the book's many pages, and one can find the best microphone arrangements for nearly every conceivable situation and guides to proceed for the more unusual ones.&quot; - The American Organist\n\n&quot;John Eargle has prepared another useful book for audio system contractors, engineers, designers and enthusiasts.&quot;\nSound &amp; Communications magazine\n\n&quot;Highly recommended for everyone who wants to know more. Read it.&quot;\nAmazon.com customer review\n\n&quot;The Microphone Book will save you time and money, even if you only ever buy one microphone to use in a home studio. If you do live sound, record on location, or are kitting out a slightly more ambitious project studio, then this book will be invaluable. It takes you far further than the 'microphone' sections of general guides to studio recording.&quot;\nAmazon.co.uk customer review\nBook Description\nThe complete illustrated guide to microphone technology\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 368 pages\n    * Publisher: Focal Press; 2 edition (November 24, 2004)\n    * Language: English\n    * ISBN-10: 0240519612\n    * ISBN-13: 978-0240519616","torrent":{"xt":"urn:btih:a33be82fe5e1a2d7cf585a80d216b4f0e44e367b","amp;dn":"The+Microphone+Handbook%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33be82fe5e1a2d7cf585a80d216b4f0e44e367b","infoHashBuffer":{"type":"Buffer","data":[163,59,232,47,229,225,162,215,207,88,90,128,210,22,180,240,228,78,54,123]},"announce":[],"urlList":[]}}