{"title":"Maverick [BdRip 1080p Ita Eng ac3] nautilus-bt.org ","uid":6679935,"size":8319361459,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a35713541023a8dbf7e5df2d8ec7493d39f8e407&amp;dn=Maverick+%5BBdRip+1080p+Ita+Eng+ac3%5D+nautilus-bt.org+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Collerom","files":-1,"time":1316168514,"description":"DUAL AUDIO\nPRIMARY ITALIAN\nSECONDARY ENGLISH\n\n &lt;a href=&quot;\nhttp://img191.imageshack.us/i/maverick19941080pbluray.jpg/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img191.imageshack.us/i/maverick19941080pbluray.jpg/&lt;/a&gt; &lt;a href=&quot;\nhttp://img844.imageshack.us/i/maverick19941080pbluray.jpg/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img844.imageshack.us/i/maverick19941080pbluray.jpg/&lt;/a&gt; &lt;a href=&quot;\nhttp://img685.imageshack.us/i/maverick19941080pbluray.jpg/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img685.imageshack.us/i/maverick19941080pbluray.jpg/&lt;/a&gt; &lt;a href=&quot;\nhttp://img52.imageshack.us/i/maverick19941080pbluray.jpg/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img52.imageshack.us/i/maverick19941080pbluray.jpg/&lt;/a&gt;\n\n\nMaverick is a 1994 Western comedy film based on the 1950s television series of the same name, created by Roy Huggins. The film was directed by Richard Donner from a screenplay by William Goldman and features Mel Gibson, Jodie Foster and James Garner, as well as several cameo appearances. The film was nominated for an Academy Award for Best Costume Design.\n\n\nDirected by \tRichard Donner\nProduced by \tBruce Davey\nRichard Donner\nWritten by \tWilliam Goldman\nBased on \tMaverick by\nRoy Huggins\nStarring \tMel Gibson\nJodie Foster\nJames Garner\nMusic by \tRandy Newman\nCinematography \tVilmos Zsigmond\nEditing by \tStuart Baird\nMike Kelly\nStudio \tIcon Productions\nDistributed by \tWarner Bros.\nRelease date(s) \tMay 20, 1994\nRunning time \t127 minutes\nCountry \tUnited States\n\n\n\n\n\nPlot\n\nThe story, set in the American Old West, is a first-person account by a wisecracking gambler Bret Maverick (Mel Gibson), of his misadventures on the way to a major five-card draw poker tournament. Besides wanting to win the poker championship for the money, he also wants to prove, once and for all, that he is &quot;the best&quot;. However, complications keep getting in the way.\n\nMaverick rides into the fictional town of Crystal River intending to collect money owed to him, as he is $3,000 short of the poker tournament entry fee of $25,000. His efforts to make up this $3,000 provide some plot motivation, as well as diversions caused by, and in the company of, three people he encounters at Crystal River: an antagonist named Angel (Alfred Molina), a young con-artist calling herself Mrs Annabelle Bransford (Jodie Foster), and legendary lawman Marshal Zane Cooper (James Garner, who played Bret Maverick in the original TV series). The first two are also rival poker players.\n\nMaverick, Bransford and Cooper share a stagecoach (the driver of which dies at the reins at full gallop), agree to help a wagon train of migrant evangelist settlers who have been waylaid by ruffians (for a fee which Maverick in the end is too big-hearted to accept) and are headed-off by a troop of Indians led by Joseph (Graham Greene). Unknown to his companions, Joseph and Maverick are good friends, and Maverick allows himself to be &quot;captured.&quot; Joseph is another one of his unreliable debtors, and in and around his tribal grounds they collaborate on a scheme to swindle a Russian Grand Duke.\n\nDuring this time, Angel has received a mysterious telegram ordering him to not allow Maverick to reach the poker game, and has also learned that Maverick had conned him in Crystal River. Angel catches up with Maverick after he has left Joseph's tribe, beats him up and attempts to hang him. Despite being tied to both a tree and to his horse, Maverick escapes and reaches the poker game, which is taking place on a paddle steamer. Bransford and Angel have also reached the game, and Cooper has been engaged to oversee its security. Learning that Bransford is still short several thousand dollars of the entry fee, Maverick finds the Grand Duke on board and cons him out of the needed amount so she can get in the game.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:a35713541023a8dbf7e5df2d8ec7493d39f8e407","amp;dn":"Maverick+%5BBdRip+1080p+Ita+Eng+ac3%5D+nautilus-bt.org+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a35713541023a8dbf7e5df2d8ec7493d39f8e407","infoHashBuffer":{"type":"Buffer","data":[163,87,19,84,16,35,168,219,247,229,223,45,142,199,73,61,57,248,228,7]},"announce":[],"urlList":[]}}