{"title":"Aine Tubridy &quot;When Panic Attacks&quot; PDF","uid":7377849,"size":286040888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a38415e46281d15eec0b939e08bf7618759ed25e&amp;dn=Aine+Tubridy+%26quot%3BWhen+Panic+Attacks%26quot%3B+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1340412168,"description":"Description\n\n&quot;When Panic Attacks&quot; answers these questions. It explains the psychology and physiology underlying panic. It makes sense of why a sufferer is radically altered after their first panic attack, and how they come to inhabit a new world full of threats, both external and internal. Dr Aine Tubridy gives an understanding of the innermost thoughts of those who panic. She documents their deep sense of alienation from others, and how they feel split off from a body they can't control. Grounded in years of clinical experience and research , Dr Tubridy shows how you can control panic attacks through a variety of skills. She includes muscle relaxation exercises, thought management, changing avoidance behaviours, exercises targeting the chakra system, homeopathic remedies and psychotherapy. This book calls for a change in the way society looks at this subject, which has been medicalised for too long, rather than being seen as a personal dilemmas to which there is a unique solution. Accompanying &quot;When Panic Attacks&quot; is a free CD on which Dr Tubridy guides you through the main points of the book.It also contains an 'emergency drill' for immediate help on the first signs of an attack and 'maintenance exercises', designed to teach you breathing and relaxation techniques.\n\n\nAuthor\n\nAine Tubridy M.D. is a medical doctor and practising psychotherapist living and working in Ireland. She has a special interest in mind-body-spirit and vibrational medicine and is co-author with Michael Corry M.D. of Going Mad and Depression: an Emotion not a Disease.","torrent":{"xt":"urn:btih:a38415e46281d15eec0b939e08bf7618759ed25e","amp;dn":"Aine+Tubridy+%26quot%3BWhen+Panic+Attacks%26quot%3B+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a38415e46281d15eec0b939e08bf7618759ed25e","infoHashBuffer":{"type":"Buffer","data":[163,132,21,228,98,129,209,94,236,11,147,158,8,191,118,24,117,158,210,94]},"announce":[],"urlList":[]}}