{"title":"POtHS - Wars &amp; Rumors of Wars - 9 - Rumors of War III  Targe","uid":7386759,"size":2827028869,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a3fb6265244e8f5a9efd8aa5e640aa86638c6e6d&amp;dn=POtHS+-+Wars+%26amp%3B+Rumors+of+Wars+-+9+-+Rumors+of+War+III++Targe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":81,"time":1340653712,"description":"POtHS - Wars &amp; Rumors of Wars - 9 - Rumors of World War III Target US\n\n\n\nPOtHS Comments on This one: Thank God I missed this Bullshit War with a Lucky High Number in the Draft Lotto.\n\n\nDescription:\n\nRumors of War III  Target U.S. - GBTV, April 27 2012:\nAn invasion is underway. The U.S. is under attack. The enemy moves freely amongst us and even advises the very government bodies established to protect us from such a threat. They've already smuggled in at least one weapon of mass effect and are working to set up missile bases within striking distance of the homeland. They are here, now, and their goal is singular and quite specific: The downfall of the United States of America.\n\n\nCIA Spooks Wife Tells All in Ted Gunderson Interview:\nIn this outstanding video, Ted Gunderson interviews Nancy Tatum, the wife of black ops-operative Chip Tatum. In this film you'll learn from Nancy how her and Chip were stalked, harassed, intimidated and eventually railroaded into federal prison for Chip's refusal to turn over secret documents to U.S. intelligence agencies because he knew that they &quot;knew&quot; he had first-hand knowledge of shadow government narco-trafficking into the United States by powerful, high profile officials. Chip knew that he would be murdered if he gave up his &quot;evidence&quot; to Oliver North at the behest of his handler, George H.W. Bush. This video exposes how absolutely corrupt the federal so-called &quot;justice&quot; department and courts have become-to the point of aiding and abetting in the conspiracy and cover-up of U.S. government &quot;spook&quot; agency participation in narcotics trafficking into the U.S. She warns how anyone and everyone can be destroyed by the corrupt justice system.","torrent":{"xt":"urn:btih:a3fb6265244e8f5a9efd8aa5e640aa86638c6e6d","amp;dn":"POtHS+-+Wars+%26amp%3B+Rumors+of+Wars+-+9+-+Rumors+of+War+III++Targe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3fb6265244e8f5a9efd8aa5e640aa86638c6e6d","infoHashBuffer":{"type":"Buffer","data":[163,251,98,101,36,78,143,90,158,253,138,165,230,64,170,134,99,140,110,109]},"announce":[],"urlList":[]}}