{"title":"Cyber Update Jul.2011------FM-14551 LoreleiLee IsisLove.","uid":6546038,"size":731904789,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a41bab42b1cd5d6df753c9ca81a7cb654ec8172c&amp;dn=Cyber+Update+Jul.2011------FM-14551+LoreleiLee+IsisLove.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":235,"time":1310861056,"description":"From Kink.com      (Fuckingmachines)  + Pics\n\n\n\n\nThere can be only one Queen. It will be difficult to win the crown for these competitors are no ordinary mortals, this is Isis Love and Lorelei Lee, two of THE hottest girls in porn. \n\nIsis and Lorelei have been FuckingMachines.com Hall of Fame Babes from their first shoots taking big cock, fast, hard and relentless until they squirt or climax so hard that there is no question they gave it all to the machines. \n\nLorelei Lee has seduced pornstars and amateurs alike and is always certain to have her fair share of the machine fucking solo or with others.\nHer strength is the Double Penetration and anal fucking which gives her a clear advantage over Isis Love who usually only does it in the ass if we beg. But no way in hell is Isis an underdog to Lorelei. \n\nIsis has the wettest ace in the industry - her squirting, multiple orgasm pussy. Isis has been know to destroy more than one couch while riding the Sybian or getting nailed by the Fucksall and she is sure to be tough competition. \n\nPart 1 includes a full on battle as the girls struggle not to lose in the first 3 events of this 6 round competition. This update was shot LIVE and members voted in round 3 for their favourite girl. If you missed the live show, you can still vote here on the boards. This update is nearly unedited and left raw so you can see every bit that goes into crowning a Queen of the Machines. Part 2 of the competition which includes bondage, double penetration and serious last attempts at the crown, will be posted in the coming weeks. \n\n\n\nScreens &lt;a href=&quot; http://www.fuckingmachines.com/site/shoot.jsp?shootId=14551&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.fuckingmachines.com/site/shoot.jsp?shootId=14551&lt;/a&gt;\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:a41bab42b1cd5d6df753c9ca81a7cb654ec8172c","amp;dn":"Cyber+Update+Jul.2011------FM-14551+LoreleiLee+IsisLove.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a41bab42b1cd5d6df753c9ca81a7cb654ec8172c","infoHashBuffer":{"type":"Buffer","data":[164,27,171,66,177,205,93,109,247,83,201,202,129,167,203,101,78,200,23,44]},"announce":[],"urlList":[]}}