{"title":"Kevin Fowler...Bring It On(2007)[FLAC]","uid":6677077,"size":341102648,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a615548707183456406cb95d8966e26549bae388&amp;dn=Kevin+Fowler...Bring+It+On%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":18,"time":1316071370,"description":"[img]http://image.allmusic.com/00/amg/cov200/drj000/j040/j04014bre2p.jpg[/img]\n[color=Brown]Bring It On [2007]  Equity Music Group / 50013[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 Long Line of Losers -Fowler, Tribble 3:43 \n2 Feels Good Don't It -Fowler, Kinney, Martin 4:04 \n3 Ain't Dead Yet -Murphy, Tribble 3:36 \n4 Me and the Boys -Fowler, Shepherd 4:01 \n5 I Pulled a Hank Last Night -Brown, Griggs 3:54 \n6 What's Your Point? -Fowler, McKinney 5:09 \n7 Bring It On -Fowler 4:12 \n8 Cheaper to Keep Her -Butler, Fowler, Shepherd 4:05 \n9 Slow Down -Fowler, Hennessee 3:41 \n10 Now You're Talkin' -Dean, Murphy, Tribble 4:00 \n11 Best Mistake I Ever Made -Fowler, Pounds 3:05 \n12 Let's Start Livin' -Agee, Fowler 3:09 \n13 Honky Tonk Junkie -Fowler, Ingersoll 3:18 \n\nThe outlaw movement in country music didn't last very long in Nashville, but in Texas they take being an outlaw, or at least being an outcast and outsider, pretty seriously. Since returning to his country roots in 2000, Kevin Fowler turned out the kind of country albums they've long forgotten about in Nashville, hardwood honky tonk Saturday night epics with plenty of rock attitude and enough grit to grind the fenders off a '69 Caddy. Fowler's bad-boy stance will never go out of style in either country or rock, and his band delivers the goods on these 13 tunes of drinkin', hell-raisin', and good-timin'. &quot;Ain't Dead Yet&quot; gives a shout out to all the things that are supposed to kill you -- booze, fluoride in the toothpaste, cigarette smoke, and carcinogens in barbecued food, to mention just a few. It's a toast to the joys of self-destruction that everyone will want to raise a glass too. &quot;Long Line of Losers&quot; celebrates Fowler's muddy gene pool with a Cajun-flavored stomp flavored by some wailing fiddle from Chris Whitten and screaming electric guitar by Tracy Martin. &quot;I Pulled a Hank Last Night&quot; rides down the lost highways that claimed Hank Williams, and unlike a lot of songs that reference Williams, it avoids maudlin sentimentality and wallows in excess and alcoholic jubilation with lines like &quot;takin' it easy drinkin' that hard stuff.&quot; The band salutes Williams by dropping a musical quote from &quot;Honky Tonk Blues&quot; into their smokin' instrumental break. The song titles tell the story -- &quot;Honky Tonk Junkie,&quot; &quot;Cheaper to Keep Her,&quot; &quot;Feels Good Don't It&quot; are rife with good old boy humor and pounding honky tonk beats. Even on the album's one love song, &quot;Best Mistake I Ever Made,&quot; he keeps things from getting too serious with a bit of boozy humor.\n\ncd ripped by EAC\n\nPLEASE SEED\n\n[url]http://dickthespic.org/2011/09/07/kevin-fowler/[/url]","torrent":{"xt":"urn:btih:a615548707183456406cb95d8966e26549bae388","amp;dn":"Kevin+Fowler...Bring+It+On%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a615548707183456406cb95d8966e26549bae388","infoHashBuffer":{"type":"Buffer","data":[166,21,84,135,7,24,52,86,64,108,185,93,137,102,226,101,73,186,227,136]},"announce":[],"urlList":[]}}