{"title":"Fireburst-SKIDROW-on","uid":7217512,"size":1410448240,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a81af6b326e82d713f925140f33cfe24f90f467e&amp;dn=Fireburst-SKIDROW-on&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ontotita","files":31,"time":1335431404,"description":"Fireburst (c) Strategy First Inc.\n\n25-04-2012....Release Date\nProtection...................Steam\nRacing...........Game Type\nDisk(s)......................1 DVD\n\nRELEASE NOTES\n\nBlast opponents off the road with Fireburst, an explosively fun\nfast-paced arcade style racing game with fantastic graphics. Rev up to\nscorching speeds to outrun opponents on a dozen different tracks,\nsetting them ablaze in your flaming wake thanks to our exclusive\nFireboost technology. Drive as sixteen sarcastic drivers with unique\nstyles and taunts, using various explosive, fire-based special\nabilities to turn other cars into a pyre of parts. Leave opponents\nsucking on your smoldering dust in single-player mode, local\nfour-player mode or the insane, firetastic online eight-player mode.\nGrab the wheel and burn some rubber.\n\nFeatures:\n\nChoose Your Death Ride - Get behind the wheel of 16 different vehicles\nincluding trucks, buggys, muscle cars and 4x4s. Win additional artwork\nand unlock other goodies as you turn opponents in piles of road ash.\n\nEccentrically Eclectic Characters - Choose from 16 original characters\nwith unique personalities and nerve pinching taunts.\n\nFireboost Abilities - Turn every vehicle into a deadly hotrod with\nfour fiery class-specific special abilities: Fireball, Fireblast,\nFirewall and Firewheels. Oh yeah\n\nMaps Galore - Race on 12 single-player and five multi-player maps\nincluding docks, airfields, oil rigs, sewers and warehouses packed\nwith shortcuts, obstacles and cool-down zones (to help extend your\nFireboost).\n\nModes Aplenty - Play the single-player mode to complete challenges,\ncreate a custom race or simply smash AI opponents. Multiplayer modes\ninclude four-player local split-screen and eight-player online racing.\n\nHeart-Pounding Soundtrack - As if things weren't hot enough, the\nsoundtrack includes Hawthorne Heights' rockin' hit single, &quot;Drive.&quot;\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy ","torrent":{"xt":"urn:btih:a81af6b326e82d713f925140f33cfe24f90f467e","amp;dn":"Fireburst-SKIDROW-on","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a81af6b326e82d713f925140f33cfe24f90f467e","infoHashBuffer":{"type":"Buffer","data":[168,26,246,179,38,232,45,113,63,146,81,64,243,60,254,36,249,15,70,126]},"announce":[],"urlList":[]}}