{"title":"The Gates 1x02 HDTV Spanish by tony","uid":6684375,"size":508031176,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a84e589c2064b6f52b6bd1602c15c55acd0dc91a&amp;dn=The+Gates+1x02+HDTV+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"carambolas","files":3,"time":1316304368,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nAcurrucado en el interior de una comunidad de montaÃƒÂ±a privada estÃƒÂ¡ The Gates. Es un suburbio que ofrece una imagen de felicidad perpetua. Cada calle estÃƒÂ¡ alineada con unas casas perfectamente cuidadas, protegidas por enormes puentes de hierro, pero un oscuro y delicioso secreto estÃƒÂ¡ enterrado bajo la superficie de este pintoresco vecindario. Ocultos entre los residentes humanos hay toda una comunidad sobrenatural que incluye vampiros, hombres lobo y brujas. Sus razones para vivir en The Gates no estÃƒÂ¡n totalmente claras, pero definitivamente harÃƒÂ¡n todo lo posible para esconderse de los humanos.\n\nComo muchas de las familias asentadas en The Gates, los Monahan proceden de una vida complicada que dejaron atrÃƒÂ¡s en Chicago. Nombrado como el nuevo jefe de policÃƒÂ­a de The Gates, Nick Monahan (Frank Grillo, Prison Break) espera tener una vida tranquila en su nuevo hogar. Cansado como policÃƒÂ­a y como padre, Nick es la clase de hombre que harÃƒÂ­a cualquier cosa por proteger a su familia y por llevar ante la justicia a aquellos que se lo merecen. Como detective de homicidios, Nick estÃƒÂ¡ acostumbrado a complicados casos... pero ninguno de ellos le ha preparado para las sorpresas inesperadas que encontrarÃƒÂ¡ en The Gates. El problema es que en una comunidad donde todos ocultan algo, los instintos policiales de Nick no harÃƒÂ¡n mÃƒÂ¡s que crearle problemas.","torrent":{"xt":"urn:btih:a84e589c2064b6f52b6bd1602c15c55acd0dc91a","amp;dn":"The+Gates+1x02+HDTV+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a84e589c2064b6f52b6bd1602c15c55acd0dc91a","infoHashBuffer":{"type":"Buffer","data":[168,78,88,156,32,100,182,245,43,107,209,96,44,21,197,90,205,13,201,26]},"announce":[],"urlList":[]}}