{"title":"Dimensity-RELOADED","uid":7375578,"size":3107850461,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a9cfa8de6422d7fbd8d770abd7868a863d6fa577&amp;dn=Dimensity-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Totenkruez","files":-1,"time":1340351157,"description":"                          Dimensity (c) Strategy First\n    \n        04/2010 :..... RELEASE.DATE .. PROTECTION .......: Solidshield\n              1 :.......... DISC(S) .. GAME.TYPE ........: Role-Playing\n   \n                   ÃœÃŸÃŸ  ÃœÃŸÃŸÃœ ÃœÃŸÃœÃŸÃœ ÃœÃŸÃŸ  ÃŸ ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ ÃœÃŸ\n  ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ Ã› ÃŸÂ² Ã›ÃŸÃŸÂ² Ã›   Â² Â²ÃŸ Ãœ Ã› Ã›  Â² Â²ÃŸ   Ã›  Â² ÃŸÃŸÃŸÃ› ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ\n                    ÃŸÃŸ  ÃŸ    ÃŸ   ÃŸ ÃŸÃŸÃŸÃŸ ÃŸ ÃŸ    ÃŸ     ÃŸÃŸ   ÃŸÃŸ\n\n\n  The most powerful is the Kingdom of Dumnoni, whose kings claim to be almighty\n  and everyone must obey their orders. Far to the east of the mountains in\n  hostile marshlands, the race of the Firbolgs united in ancient times and\n  formed a shamanistic culture. Although the Humans often call them 'Savages',\n  the Firbolgs are proud and just people. They are born in war, they live to\n  fight and die in the name of the War God. \n\n  Little is known about the fearsome Ghosts. The knowledge of their origin\n  seems lost in present days. However many of the scholars believe they are\n  souls, that are bound to the world until they achieve the right to find rest\n  in the true death. \n\n  Almost nothing is known about the Elementals. Actually many believe they\n  haven't existed at all. They are source of legends and myths and none has\n  been able to see them for many generations. \n\n  At the present the Kingdom of Dumnoni tries to expand towards the territories\n  of the Firbolgs and force them to kneel to the crown. A goal that proved not\n  easy to achieve as the time revealed. The race of men is separated however by\n  religious disjunction and many people disagree that the mighty kings of\n  Dumnoni are true bearers of the will of gods. \n\n  Features\n  * Create a leader choosing from four available races (Human, Firbolg, \n    Elemental and Ghost) with two classes each (warrior and mage). Â  \n  * Make your hero advance learning from available skills and magic spells of \n    your choice. Â  \n  * Face more than 100 types of creatures and bosses. Â  \n  * Explore an immersive and hostile Heroic Fantasy world. Â  \n  * Raise structures of war and build an army to accompany you. Â  \n  * Prevail in Multiplayer game which supports up to four players. Â  \n  * Raise your level through multiple multiplayer sessions having all \n    acquired skills and items. \n\n\n\n             ÃŸ ÃœÃŸÃŸÃœ ÃœÃŸ   Â²ÃœÃœ  ÃœÃŸÃŸÃœ Â²   Â²   ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ Â²ÃœÃœ  ÃœÃŸÃŸ  ÃœÃŸ\n  ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ Ã› Ã›  Â² ÃŸÃŸÃŸÃ› Ã›  Ãœ Ã›ÃŸÃŸÂ² Ã›   Ã›   Ã›  Â² Ã›  Â² Ã›  Ãœ Â²ÃŸ Ãœ ÃŸÃŸÃŸÃ› ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ\n             ÃŸ ÃŸ     ÃŸÃŸ   ÃŸÃŸÃŸ ÃŸ    ÃŸÃŸÃŸ ÃŸÃŸÃŸ ÃŸ     ÃŸÃŸ   ÃŸÃŸÃŸ ÃŸÃŸÃŸÃŸ  ÃŸÃŸ\n\n  \n\n  1. Unrar.\n  2. Install the game. \n  3. Install the update located in the /Crack dir on the DVD.\n  4. Copy over the cracked content located in the /Crack dir on the DVD to \n\tyour &lt;install&gt;bin dir.\n  5. Play the game.\n  6. Support the software developers. If you like this game, BUY IT!\n\n","torrent":{"xt":"urn:btih:a9cfa8de6422d7fbd8d770abd7868a863d6fa577","amp;dn":"Dimensity-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9cfa8de6422d7fbd8d770abd7868a863d6fa577","infoHashBuffer":{"type":"Buffer","data":[169,207,168,222,100,34,215,251,216,215,112,171,215,134,138,134,61,111,165,119]},"announce":[],"urlList":[]}}