{"title":"Sherlock Holmes: A Game of Shadows. Official Trailer [HD] (2011)","uid":6553963,"size":75985408,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:aa703aafe3738f42c4425ea0b4a1554b922e54fb&amp;dn=Sherlock+Holmes%3A+A+Game+of+Shadows.+Official+Trailer+%5BHD%5D+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"proffcom","files":-1,"time":1311208621,"description":"In theaters: December 16th, 2011\n\nSynopsis:\n\nRobert Downey Jr. reprises his role as the world's most famous detective, Sherlock Holmes, and Jude Law returns as his formidable colleague, Dr. Watson, in &quot;Sherlock Holmes: A Game of Shadows.&quot; Sherlock Holmes has always been the smartest man in the room...until now. There is a new criminal mastermind at large--Professor Moriarty (Jared Harris)--and not only is he Holmes' intellectual equal, but his capacity for evil, coupled with a complete lack of conscience, may actually give him an advantage over the renowned detective. When the Crown Prince of Austria is found dead, the evidence, as construed by Inspector Lestrade (Eddie Marsan), points to suicide. But Sherlock Holmes deduces that the prince has been the victim of murder--a murder that is only one piece of a larger and much more portentous puzzle, designed by one Professor Moriarty. Mixing business with pleasure, Holmes tracks the clues to an underground gentlemen's club, where he and his brother, Mycroft Holmes (Stephen Fry) are toasting Dr. Watson on his last night of bachelorhood. It is there that Holmes encounters Sim (Noomi Rapace), a Gypsy fortune teller, who sees more than she is telling and whose unwitting involvement in the prince's murder makes her the killer's next target. Holmes barely manages to save her life and, in return, she reluctantly agrees to help him. The investigation becomes ever more dangerous as it leads Holmes, Watson and Sim across the continent, from England to France to Germany and finally to Switzerland. But the cunning Moriarty is always one step ahead as he spins a web of death and destruction--all part of a greater plan that, if he succeeds, will change the course of history. Filmmaker Guy Ritchie returns to direct &quot;Sherlock Holmes: A Game of Shadows,&quot; the follow-up to the smash hit &quot;Sherlock Holmes.&quot; The sequel also reunites producers Joel Silver, Lionel Wigram, Susan Downey and Dan Lin. Bruce Berman serves as executive producer, with Steve Clark-Hall co-producing. Jared Harris (TV's &quot;Mad Men,&quot; &quot;The Curious Case of Benjamin Button&quot;) joins the cast as the notorious Professor Moriarty. Also joining the cast, in her first English-speaking role, is Swedish actress Noomi Rapace, who gained international attention in the Swedish film &quot;The Girl with the Dragon Tattoo.&quot; Stephen Fry (&quot;Alice in Wonderland,&quot; &quot;Harry Potter and the Goblet of Fire&quot;) plays Mycroft Holmes, Sherlock's older brother. Additional cast members returning from the first film include Eddie Marsan as Inspector Lestrade; Kelly Reilly as Watson's bride, Mary Morstan; and Geraldine James as Holmes's long-suffering landlady, Mrs. Hudson. &quot;Sherlock Holmes: A Game of Shadows&quot; is written by Michele Mulroney &amp; Kieran Mulroney. Sherlock Holmes and Dr. Watson were created by the late Sir Arthur Conan Doyle, and appear in stories and novels by him.\n\nGenre: Action and Adventure, Thriller\n\nDirector: Guy Ritchie\n\nCast: Robert Downey Jr., Jude Law, Noomi Rapace, Jared Harris, Eddie Marsan, Stephen Fry, Gilles Lellouche\n\n\n___________________________________________________________\n\nVideo: Xvid 1920x816 23.98fps\n\nAudio: MPEG Audio Layer 3 44100Hz stereo 320kbps\n___________________________________________________________","torrent":{"xt":"urn:btih:aa703aafe3738f42c4425ea0b4a1554b922e54fb","amp;dn":"Sherlock+Holmes%3A+A+Game+of+Shadows.+Official+Trailer+%5BHD%5D+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa703aafe3738f42c4425ea0b4a1554b922e54fb","infoHashBuffer":{"type":"Buffer","data":[170,112,58,175,227,115,143,66,196,66,94,160,180,161,85,75,146,46,84,251]},"announce":[],"urlList":[]}}