{"title":"Internet Download Manager v6.07 Build 3 Portable [DwzRG]","uid":6545567,"size":9332145,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:abdf5d5cc80250b05594593b901a74312e90aabf&amp;dn=Internet+Download+Manager+v6.07+Build+3+Portable+%5BDwzRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rahulro","files":-1,"time":1310841387,"description":"Internet Download Manager v6.07 Build 3 Portable [DwzRG] | 8.89 MB\n\nOverview:\n\nInternet Download Manager (IDM) is a tool to increase download speeds by up to 500 percent, resume and schedule downloads. \n\nComprehensive error recovery and resume capability will restart broken or interrupted downloads due to lost connections, network problems, computer shutdowns, or unexpected power outages. Simple graphic user interface makes IDM user friendly and easy to use. \n\nInternet Download Manager has a smart download logic accelerator that features intelligent dynamic file segmentation and safe multipart downloading technology to accelerate your downloads. \n\nDuring the download process Internet Download Manager segments downloaded files dynamically, unlike other download accelerators and managers that segment files before the download starts Internet Download Manager reuses available connections without additional connect and login stages to achieve better acceleration performance. \nInternet Download Manager supports proxy servers, ftp and http protocols, firewalls, redirects, cookies, directories with authorization, MP3 audio and MPEG video content processing, and a large number of directory listing formats. \n\nIDM integrates seamlessly into Microsoft Internet Explorer, Netscape, MSN Explorer, AOL Explorer, Opera, Mozilla Firefox, Mozilla Firebird, Avant Browser, MyIE, Google Chrome, and all other popular browsers to automatically handle your downloads. \n\nYou can also drag and drop files, or use Internet Download Manager from command line. Internet Download Manager can dial your modem at the set time, download the files you want, then hang up or even shut down your computer when it's done. \n\nOther features include multilingual support, zip preview, download categories, built-in download accelerator, scheduler pro, sounds on events, HTTPS support, queue processor, pipelining of ftp commands, html help and tutorial, enhanced virus protection on download completion, progressive downloading with quotas (useful for connections that use some kind of fair access policy or FAP like Direcway, Direct PC, Hughes, etc.), command line parameters, and many others.\n\nInstallation Instructions:\n\n1. Extract file(s) from .rar.\n2. Run &quot;Internet Download Manager Portable.exe&quot; Always To Use The Software.\n3. Done. Enjoy!!\n\nBy DwzRG","torrent":{"xt":"urn:btih:abdf5d5cc80250b05594593b901a74312e90aabf","amp;dn":"Internet+Download+Manager+v6.07+Build+3+Portable+%5BDwzRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abdf5d5cc80250b05594593b901a74312e90aabf","infoHashBuffer":{"type":"Buffer","data":[171,223,93,92,200,2,80,176,85,148,89,59,144,26,116,49,46,144,170,191]},"announce":[],"urlList":[]}}