{"title":"Any Given Day Discography 1999-2002 (4 Releases)","uid":7229907,"size":174808048,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:abec49839e4ac4ef4b243ddbbfb51d594a4f771a&amp;dn=Any+Given+Day+Discography+1999-2002+%284+Releases%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"TorrentTracts","files":51,"time":1335801448,"description":"---------------------------------------------------------------\nANY GIVEN DAY DISCOGRAPHY\n---------------------------------------------------------------\n\nThere are 4 releases included in this Any Given Day discography today...\n\n * 1999 - Any Given Day\n * 1999 - Passionate Worship For The Soul\n * 2001 - Earth To Heaven\n * 2002 - Old Soul For New Voices\n\nf you liked the Ramones you'll like Any Given Day... three chord wonders mixed with the catchy harmonies inspired by the Beatles. Any Given Day are the new-wave punk sensation!\n\nIn July 2001, Simon, Barrie and three other friends got together to form what they intended to be the greatest rock and roll experience known to man, &quot;Any Given Day&quot; was given life. Success quickly followed, TV appearances, sell-out gigs both here in the UK and in Europe, and self produced CD's that were well received. But with all that success comes greater demands, as life within the band changed, so did its members. Donna arrived in the first round of changes and several others have come and gone as the level of commitment and the sacrifices that need to be made in order to see your dreams come to fruition become greater and more obvious.\n\nFour years on and the core of the band has become stronger and more intense, the search for new members to replace those who fell by the wayside, people willing to put it all on the line, has become impossible. The &quot;Any Given Day&quot; that stands before you on stage in 2005, is a dynamic, uncompromising, power house 3-piece unit at the fore front of a new Punk Revolution, that takes issue with everything that is the establishment of the music industry today. Any Given Day will prove that they can succeed without conforming to the stereotype of mass produced pop/rock bands, that roll off the conveyor belt to a wave of hysteria, only to be forgotten less than 12 months later.\n\nGod Bless,\nTorrentTracts - April 2012\n","torrent":{"xt":"urn:btih:abec49839e4ac4ef4b243ddbbfb51d594a4f771a","amp;dn":"Any+Given+Day+Discography+1999-2002+%284+Releases%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abec49839e4ac4ef4b243ddbbfb51d594a4f771a","infoHashBuffer":{"type":"Buffer","data":[171,236,73,131,158,74,196,239,75,36,61,219,191,181,29,89,74,79,119,26]},"announce":[],"urlList":[]}}