{"title":"Star Trek: Voyager - Season 6 (1998) DVDRip Xvid Eng MP3 MKV [Bi","uid":6662191,"size":14150713500,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ac7b897ddcf0d9e1170e03dea4a12d4d9167bd10&amp;dn=Star+Trek%3A+Voyager+-+Season+6+%281998%29+DVDRip+Xvid+Eng+MP3+MKV+%5BBi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bigjazz.h33t","files":28,"time":1315560768,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nStar Trek: Voyager - Season 6 (1998) DVDRip Xvid Eng MP3 MKV\n\nTitle: \t\tStar Trek: Voyager\nRelease:\tTV: 1999 DVD:2005\nSeason: \t6 (Complete)\nRuntime: \tEach Episode approx. 42mins\n\nPulled to the far side of the Galaxy, where the Federation is 75 years away at maximum warp speed, a Starfleet ship must cooperate with Maquis rebels to find a way home.\n\nCast:\nKate Mulgrew ...   Captain Kathryn Janeway\nRobert Beltran ...   Chakotay\nRoxann Dawson ...   B'Elanna Torres\nRobert Duncan McNeill ..Tom Paris\nEthan Phillips ...   Neelix\nRobert Picardo ...   The Doctor\nTim Russ ...   Tuvok\nGarrett Wang ...   Harry Kim\nTarik Ergin ...   Lieutenant Ayala\nJeri Ryan ...   Seven of Nine\nMajel Barrett ...   Voyager Computer\n\nEncoding\n\nVideo;\nResolution: \t576x448\nBitrate: \t~1310kbps @ 25fps\nCodec: \t\tXvid, v1.2.2\nFormat: \tMatroska (.mkv)\n\nAudio;\nFormat:\t\t5.1 Channel AC3\nBitrate:\t384kbps\nLanguage:\tEnglish\n\nScene Markers: \tEncoded with Scene Titles\n\nSubtitles:\tDanish, German, English, Castilian, French, Italian, Dutch, Norwegian, Swedish\n\nFile Size: \t~517MB\n\nSource Info;\nType: \t\tPAL DVD (R4)\nFrame Type: \tFull Frame, Interlaced\n\nTorrent Files: \t28\n\nStar Trek: Voyager - Season 6\n\n601-Equinox, Part II\nThe crew of the USS Equinox attempt to elude the USS Voyager in order to exploit the nucleogenic lifeforms in a bid to return home.\n\n602-Survival Instinct\nThree Borg from Seven's past appear, and ask to be completely separated from the Collective.\n\n603-Barge of the Dead\nB'Elanna's shuttle is hit by an ion storm and she awakens to find herself among Klingons in the Barge of the Dead, on the way to Klingon Hell.\n\n604-Tinker Tenor Doctor Spy\nThe Doctor adds daydreaming to his program, imagining himself as the Emergency Command Hologram (ECH) aboard Voyager; but aliens, tapping into his perceptions to observe the crew, prepare an attack when they believe that what they are seeing in the daydreams is real.\n\n605-Alice\nTom Paris becomes obsessed with a salvaged alien shuttlecraft which appears to have a mind of its own.\n\n606-Riddles\nReturning from a diplomatic mission Tuvok is attacked by a cloaked intruder and suffers neurological damage.\n\n607-Dragon's Teath\nVoyager discovers a network of subspace passageways, but is forced to land on a planet after being attacked.\n\n608-One Small Step\nSeven helps the crew avoid a huge mass of subspace energy and they theorize an ancient spacecraft is inside.\n\n609-The Voyager Conspiracy\nAfter assimilating Voyager's data for the past six years, through an enhancement to her Borg implants, Seven of Nine suspects the ship did not arrive in the Delta Quadrant by accident.\n\n610-Pathfinder\nBarclay gets over-involved with holographic recreations of the Voyager crew in his attempts to contact them.\n\n611-Fair Haven\nHarry Kim and Tom Paris create an Irish village on the holodeck for the crew.\n\n612-Blink Of An Eye\nVoyager is trapped in orbit about a planet with a space-time differential such that, while its inhabitants live through years, Voyager experiences mere minutes.\n\n613-Virtuoso\nVisiting aliens who have never before encountered music become fascinated with the Doctor's Opera singing, and ask him to leave Voyager and join their society.\n\n614-Memorial\nChakotay, Tom Paris, Harry Kim, and Neelix begin to experience weird visions after an away mission.\n\n615-Tsunkatse\nSeven of Nine and Tuvok are kidnapped while on shore leave, and Seven is forced to fight in a gladiatorial contest to the death. (Guest Stars: Dwayne Johnson)\n\n616-Collective\nChakotay, Kim, Paris, and Neelix are taken hostage when the Delta Flyer is captured by Borg children in a derelict Cube.\n\n617-Spirit Folk\nProblems arise from running the holographic Irish village of Fair Haven non-stop, when a malfunction leads the holographic characters to become self-aware.\n\n618-Ashes to Ashes\nA deceased crew member resurfaces, claiming to have been resurrected by an alien race who have since adopted her.\n\n619-Child's Play\nThe family of Icheb, one of the Borg children, is found, but he is reluctant to rejoin them. Seven, too, is reluctant for him to leave the ship; and his parents are concealing the real reason for desiring his return.\n\n620-Good Sheperd\nThree crew members who are under-performing are taken on a mission by Janeway.\n\n621-Live Fast and Prosper\nCon artists impersonate Janeway and Tuvok.\n\n622-Muse\nTorres is stranded on a bronze-age planet after a crash in the Delta Flyer, and Kim is missing in an escape pod.\n\n623-Fury\nA much older and more powerful Kes returns to Voyager, and attempts to travel back in time to change her history.\n\n624-Life Line\nThe Doctor's creator, Lewis Zimmerman, is dying in the Alpha Quadrant from a disease similar to the Vidiian phage. The Doctor's matrix is transferred to Zimmerman's lab on the Jupiter station, to assist Mr Barclay and Counsellor Troi in attempting to treat the illness.\n\n625-The Haunting of Deck Twelve\nAs Voyager travels through a nebula all ship's power is turned off, giving Neelix an opportunity to tell the Borg children a ghost story.\n\n626-Unimatrix Zero, Part I\nJaneway, B'Elanna and Tuvok infiltrate a Borg Cube in an attempt to save Borg drones who are trying to develop individuality.\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:ac7b897ddcf0d9e1170e03dea4a12d4d9167bd10","amp;dn":"Star+Trek%3A+Voyager+-+Season+6+%281998%29+DVDRip+Xvid+Eng+MP3+MKV+%5BBi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac7b897ddcf0d9e1170e03dea4a12d4d9167bd10","infoHashBuffer":{"type":"Buffer","data":[172,123,137,125,220,240,217,225,23,14,3,222,164,161,45,77,145,103,189,16]},"announce":[],"urlList":[]}}