{"title":"Saved by The Bell Season 4","uid":7318450,"size":5022842880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ade5e8ff804271c71da09fc79334e763351ca3ec&amp;dn=Saved+by+The+Bell+Season+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"Bond-boy007","files":27,"time":1338555988,"description":"Saved By the Bell originated as a Disney Channel series titled Good Morning, Miss Bliss. This show about a teacher, Miss. Bliss and her students in an Indiana Junior High School was very short-lived. The people at NBC noticed that the show had potential and picked it up after changing a few things. They decided to keep the characters of Mr. Belding, Zack Morris, Lisa Turtle and Screech Powers, while adding new members such as Kelly Kapowski, Jessie Spano and AC Slater. The focus of the series shifted gears as it began to focus on high school students, rather than a middle school teacher and her class. This series about the adventures of 6 students at Bayside High School became one the 90Î“Ã‡Ã–s biggest hits. The series lasted for 5 seasons until the gang graduated High School. Some of the spin-offÎ“Ã‡Ã–s for the series included Saved By the Bell: The College Years which followed the gang in college. This series didnÎ“Ã‡Ã–t share the same success as the original and was canceled after one season. There was also Saved By the Bell: The New Class, which again took place back at the high school but this time with new students. It lasted 7 seasons, but it was missing something and was never as popular as the original.","torrent":{"xt":"urn:btih:ade5e8ff804271c71da09fc79334e763351ca3ec","amp;dn":"Saved+by+The+Bell+Season+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ade5e8ff804271c71da09fc79334e763351ca3ec","infoHashBuffer":{"type":"Buffer","data":[173,229,232,255,128,66,113,199,29,160,159,199,147,52,231,99,53,28,163,236]},"announce":[],"urlList":[]}}