{"title":"Hugo(2011)DVDRip.AC3(ENG)-DROCK","uid":7287967,"size":733048832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae14842df9f1364a0f6a201be56daefed4096f10&amp;dn=Hugo%282011%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1337639834,"description":"Martin Scorsese's adaptation of Brian Selznick's award-winning novel The Invention of Hugo Cabret stars Asa Butterfield, as an orphan boy who lives in a Parisian train station. Sent to live with his drunken uncle after his father's death in a fire, Hugo learned how to wind the massive clocks that run throughout the station. When the uncle disappears one day, Hugo decides to maintain the clocks on his own, hoping nobody will catch on to him squatting in the station.\n\nHis natural aptitude for engineering leads him to steal gears, tools, and other items from a toy-shop owner who maintains a storefront in the station. Hugo needs these purloined pieces in order to rebuild a mechanical man that was left in the father's care at the museum -- the restoration was a project father and son did together.\n\nWhen Georges (Ben Kingsley), the old man who runs the toy stand, catches on to the thievery, he threatens to turn Hugo over to the station's lone police officer (Sacha Baron Cohen, who makes every effort to send any parentless child in the station to the orphanage. But Hugo's run-in with Georges leads to a friendship with the elderly gentleman's goddaughter, Isabelle (Chloe Grace Moretz), who unknowingly possesses the last item Hugo needs to make the mechanical man work again. \n\nRipped with Autogk\n\nLength: 2 Hours 6 Minutes\n\nFile Type: AVI\n\nFrame Width: 608\n\nFrame Height: 336\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 114kbps","torrent":{"xt":"urn:btih:ae14842df9f1364a0f6a201be56daefed4096f10","amp;dn":"Hugo%282011%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae14842df9f1364a0f6a201be56daefed4096f10","infoHashBuffer":{"type":"Buffer","data":[174,20,132,45,249,241,54,74,15,106,32,27,229,109,174,254,212,9,111,16]},"announce":[],"urlList":[]}}