{"title":"Jerry Peek - Electric Bass Frontiers","uid":7269625,"size":572827925,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae1b04703290ecfe5c137b61c478fed5af267066&amp;dn=Jerry+Peek+-+Electric+Bass+Frontiers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1337011122,"description":"Title : Electric Bass Frontiers by Jerry Peek\nLength: 1:21:57\nFormat: MP4\n\nElectric Bass Frontiers is a guide to expanding your sound with techniques you can use today and keep developing for the sounds of tomorrow. It concentrates on your number one priority, connecting the rhythm and harmony in group performance. In addition, it will give you the powerful tools you need for developing head turning solos. Topics include warm-up and stretching exercises, slap-and-pop, chords, two-handed tapping, and techniques to breathe new life into the same old grooves.\n\nJerry Peek can be heard on the Steve Morse Band albums The Introduction, Stand Up, and High Tension Wires (nominated for a Grammy in 1990). He has been featured in music publications such as Guitar Player and the German publication Fachblatt. In the course of his musical career he has also performed with such illustrious musicians as Steve Howe (YES), Allan Holdsworth, Rick Derringer, Eric Johnson, Mark O'Connor, Albert Lee, and T. Lavitz. As a clinician he has appeared with Jaco Pastorius and Darryl Jones. In addition, he has given NAMM show performances with Rod Morgenstein and Reb Beach of Winger.\n\nPlease note that the video is from 1993 and ripped from VHS. If any of the audio sounds overdriven it's because it was that way on the videotape.","torrent":{"xt":"urn:btih:ae1b04703290ecfe5c137b61c478fed5af267066","amp;dn":"Jerry+Peek+-+Electric+Bass+Frontiers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae1b04703290ecfe5c137b61c478fed5af267066","infoHashBuffer":{"type":"Buffer","data":[174,27,4,112,50,144,236,254,92,19,123,97,196,120,254,213,175,38,112,102]},"announce":[],"urlList":[]}}