{"title":"Yo Soy Betty La Fea","uid":6544179,"size":40878356623,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae4767c429b3a567a308f7bf755deff47a3b17eb&amp;dn=Yo+Soy+Betty+La+Fea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":17,"uploader":"L.ginger00","files":157,"time":1310801167,"description":"Yo soy Betty la Fea&quot; es la historia de Beatriz PinzÃƒÂ³n Solano, una joven cuyas cualidades profesionales la convierten en la ejemplar trabajadora de una empresa, y aunque sus mÃƒÂ©ritos como economista con post grado en finanzas la hacen merecedora de un cargo ejecutivo, sus atributos fÃƒÂ­sicos la obligan a conformarse con ser una secretaria.\n\nEs asÃƒÂ­ como ser fea es el ÃƒÂºnico defecto de Betty, quien ademÃƒÂ¡s aprende a quedarse solterona para toda la vida, y prefiere dedicarse a su formaciÃƒÂ³n y a agradar a su padre.\n\nPero cuando Betty comienza a trabajar en Ecomoda, una de las empresas de confecciÃƒÂ³n mÃƒÂ¡s grande del paÃƒÂ­s, conoce a Armando Mendoza, el hombre de quien se enamora. Pero debe conformarse con estar a su lado como su secretaria, pues por ser fea las cosas no van a ser fÃƒÂ¡ciles, asÃƒÂ­ que decide empezar por abajo e ir escalando posiciones.\n\n\nBetty trabaja aislada del resto de sus compaÃƒÂ±eros, y desde allÃƒÂ­ sueÃƒÂ±a y vive feliz, pues ve todo el dÃƒÂ­a a su jefe, lo atiende, suspira por ÃƒÂ©l a pesar de que para Armando ella no existe como mujer, sino como un ser que le proporciona ideas brillantes, que es su cÃƒÂ³mplice y que le maneja la agenda de citas clandestinas y lo encubre ante su novia, Marcela Valencia, una sofisticada diseÃƒÂ±adora de modas que la desprecia.\n\nLas cosas empiezan a cambiar para Betty cuando su jefe atraviesa por serios problemas con la empresa. Hace maniobras peligrosas que cuentan siempre con la solidaridad de Betty, y una noche Armando la besa enloquecidamente. Ese beso cambia la vida de Betty: la pone a soÃƒÂ±ar como nunca, la saca del abismo de la resignaciÃƒÂ³n... Definitivamente, Betty no volverÃƒÂ¡ a ser la de antes, ya que sufrirÃƒÂ¡ una transformaciÃƒÂ³n sorprendente, del alma y del cuerpo.\n\n","torrent":{"xt":"urn:btih:ae4767c429b3a567a308f7bf755deff47a3b17eb","amp;dn":"Yo+Soy+Betty+La+Fea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4767c429b3a567a308f7bf755deff47a3b17eb","infoHashBuffer":{"type":"Buffer","data":[174,71,103,196,41,179,165,103,163,8,247,191,117,93,239,244,122,59,23,235]},"announce":[],"urlList":[]}}