{"title":"C-Organizer Professional 4.5 Lite Multilingual with CRACK","uid":6687011,"size":24084428,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:af3284b91304d80e4ec15c9838068e873cac531b&amp;dn=C-Organizer+Professional+4.5+Lite+Multilingual+with+CRACK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chami1988","files":-1,"time":1316442864,"description":"C-Organizer Professional is a beautiful and powerful personal information manager. The program can help you organize and plan your business and personal life. In short, this is a Planner, Address Book, Password and Bookmark manager, Notebook, and a Calendar of Events combined into one powerful, easy-to-use application. All data can be shared in real-time on a network. You and your assistant can be in using your calendar at the same time! Moreover, you can synchronize your C-Organizer Appointments, Tasks and Address book with your Pocket PC or Palm device! C-Organizer is a personal information manager with elegant design and all the necessary features: it lets you plan your day, set alarms and keep and address book with photos. Also this program includes a notebook. C-Organizer easy to use interface includes a monthly calendar and buttons that switch among Task List mode, Alarms mode, Address Book and Notes mode. The tool is always accessible from the system tray icon. \n\nFeatures:\n\nGeneral\n- Intuitive, user-friendly interface.\n- C-Organizer supports various interface types and color schemes.\n- Fully customizable view.\n- Multilanguage support.\n- Flexible tree-like database structure.\n- Password protection.\n- Database encryption.\n- All data can be shared in real-time on a network.\n- Synchronization with Pocket PC / Smart Phone.\n- Synchronization with Palm.\n- Printing with configurable templates. Ability to export the print reports into RTF or HTML file.\n- Built - in print templates editor.\n- Capability of creating new databases; simultaneous work with multiple databases.\n- On-the-fly database swapping.\n- Simultaneous multiple records processing (adding and editing).\n- Hyperlink support (between documents, Internet and local/network files).\n- Notification system with a capability to automatically open documents, restart or shut down computer at any set time.\n- E-mail alerts to multiple email addresses.\n- Powerful database search engine.\n- Ability to show any entries as electronic &quot;sticky&quot; notes on computer's monitor.\n- Import and export features (csv, txt, xml, cdb, html)\n- Minimization to the system tray.\n- The Advanced Diary support. You can open this program using C-Organizer's main menu commands.\n- Installation and uninstallation.\n\nCalendar and Task\n- Easily visible (bold font) display of the days that have appointments scheduled on the program's calendar.\n- Time Grid and List modes.\n- Day, Work Week, Week, Month and Year views are supported in each mode (in the List and in the Time Grid).\n- Flexible sorting system.\n- Extended prioritizing settings.\n- Task progress tracker.\n- Categories support. You can assign a category to any entry and then filter your information by categories.\n- Unique notification (alert) system.\n- Flexible settings of recurring events.\n- Task grouping.\n- An ability to assign any predefined or own picture to any folder in the program's tree for better visualization of your information.\n- Hyperlinks to other database records or Internet/local/network files.\n- Files attachment. You can attach any files to the program entries and keep them directly in the database file.\n- vCalendar files support.\n- An ability to print a calendar like report with your appointments.\n\nContacts\n- Phone dialer with Skype support.\n- Option to store photographs (full size and thumbnails).\n- Option to modify database structure for each record.\n- Option to add the custom date fields with the reminders.\n- An ability to send messages to the stored contacts or to the contacts groups.\n- Categories support. You can assign a category to any entry and then filter your information by categories.\n- Flexible settings and template use.\n- Integration with default e-mail client and web browser.\n- Unique notification (alert) system.\n- Record grouping.\n- An ability to assign any predefined or own picture to any folder in the program's tree for better visualization of your information.\n- Hyperlinks to other database records or Internet/local/network files.\n- Files attachment. You can attach any files to the program entries and keep them directly in the database file.\n- vCard files support.\n\nOS : Win XP/2000/Vista/Win 7\nLanguage : Multilingual\n\n","torrent":{"xt":"urn:btih:af3284b91304d80e4ec15c9838068e873cac531b","amp;dn":"C-Organizer+Professional+4.5+Lite+Multilingual+with+CRACK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af3284b91304d80e4ec15c9838068e873cac531b","infoHashBuffer":{"type":"Buffer","data":[175,50,132,185,19,4,216,14,78,193,92,152,56,6,142,135,60,172,83,27]},"announce":[],"urlList":[]}}