{"title":"THE WAR OF THE GARGANTUAS - Export Dub","uid":7302929,"size":1162448318,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af8a24b16a754397ee8ec3a356f5553b079a81c5&amp;dn=THE+WAR+OF+THE+GARGANTUAS+-+Export+Dub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheBoxMonster","files":2,"time":1338092149,"description":"I'm tired of this being unavailable to most people because the few people who do have it are hoarders, so here you go, Pirate Bayers.\n\nToho's international poster for overseas markets:\n\nStarting in the late 1950s, Toho and other film companies of the Far East saw the building interest in their films abroad, and thus began creating their own English-language versions to be sold to the international market. Non-English speaking countries would translate these versions into their own languages, which was an easier task than translating from Japanese. These versions made available to the rest of the world by the studios who produced the actual films, variously called &quot;export&quot; and &quot;international&quot; versions, feature English dubbing recorded in Tokyo or Hong Kong, and the voice acting talent would consist of expats living in either city who spoke English fluently. Because the voice actors are very rarely credited and since they bounced from one studio to another, it is nearly impossible to tell which companies were responsible for each dub, but generally the dubs featuring actors with British accents were done in Hong Kong while the dubs with American accents are from Japan. Some of the longer films would be considerably shortened for their international versions, but with these few exceptions they were uncut and identical to the original language versions except for all-new English credit sequences and titles.\n\nThe export version of FRANKENSTEIN'S MONSTERS: SANDA VS. GAIRA, entitled THE WAR OF THE GARGANTUAS, was definitely dubbed in Hong Kong. Voice actors heard in this film can also be found in the international dubs to films like GODZILLA VS. HEDORAH and GODZILLA VS. GIGAN, which were also recorded there. This copy is shorter than the original Japanese version, but only because of the 4% PAL speedup and many instances of splices and messy reel changes. The opening Toho logo and the ending title are missing, but it is presumed both were originally part of this international version. This very rare copy, known as KATANGO'S WAR, features burnt-in Dutch subtitles and is several generations from the source, so it doesn't look that great. Nevertheless, I hope you enjoy this rare treat. Toho's export trailer to the film has also been included.","torrent":{"xt":"urn:btih:af8a24b16a754397ee8ec3a356f5553b079a81c5","amp;dn":"THE+WAR+OF+THE+GARGANTUAS+-+Export+Dub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af8a24b16a754397ee8ec3a356f5553b079a81c5","infoHashBuffer":{"type":"Buffer","data":[175,138,36,177,106,117,67,151,238,142,195,163,86,245,85,59,7,154,129,197]},"announce":[],"urlList":[]}}