{"title":"Fellowship! The Musical Parody of The Fellowship of the Ring - S","uid":7282573,"size":39537376,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:afbfe9c259973bac38ecfade6d0d09e32a7df875&amp;dn=Fellowship%21+The+Musical+Parody+of+The+Fellowship+of+the+Ring+-+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":17,"time":1337476180,"description":"The original soundtrack of Fellowship!, the musical parody of The Fellowship of the Ring.\n\n---\n\nFellowship! is a musical parody stage play based on The Fellowship of the Ring the first volume of J. R. R. Tolkien's The Lord of the Rings, and Peter Jackson's 2001 film adaptation of it. The book was written by Kelly Holden-Bashar and Joel McCrary with music by Allen Simpson and lyrics and additional material by Brian D. Bradley, Lisa Fredrickson, Kelly Holden-Bashar, Joel McCrary, Edi Patterson, Steve Purnick, Cory Rouse, Allen Simpson, Ryan Smith, Peter Allen Vogt and Matthew Stephen Young. The musical was first performed at the El Portal Forum Theater in North Hollywood, California.\nThe play follows the major events of Tolkien's story. It re-imagines Bilbo Baggins as an aged Jewish comedian, the Balrog as a sleep-deprived diva, the battle on Weathertop as a West Side Story-style gang fight, and Rivendell as a Scientologist stronghold. Part live action, part puppet show and part animation, the show removes or summarizes parts of the story that would slow it down. While played for laughs, the music features original compositions instead of parodies, and the song styles range from cheesy 1980s rock to sleazy cabaret numbers.\nThe play had a successful six-week run in early 2005, and played several sold-out shows at the 2005 San Diego Comic Con. L.A. Weekly named it a &quot;Pick of the Week&quot;, and both Backstage West and the Los Angeles Times listed it as a &quot;Critic's Choice.&quot;\nIn 2006, the play won Musical of the Year and Best Comedy Ensemble at the 2006 LA Weekly Theater Awards. The show was also nominated for Best Musical Direction.\nAt the 36th Annual Saturn Awards, held on June 24, 2010, in Burbank, California, the play won the award for Best Local Stage Production: Small Theatre. It was the first time an award in this category had ever been given at the Saturn Awards. Composer Allen Simpson and cast members Matt Young and Ryan Smith accepted the award on behalf of the play. The award was presented by actor John de Lancie.\nThe 36th Annual Saturn Awards were presented by The Academy of Science Fiction, Fantasy and Horror Films, a non-profit organization created in 1972 to honor, recognize and promote genre entertainment. The Academy was founded by noted film historian, Dr. Donald A. Reed, who died in 2001. Robert Holguin currently serves as President of the Academy.\n\n\nOfficial site: http://www.fellowshipthemusical.com/","torrent":{"xt":"urn:btih:afbfe9c259973bac38ecfade6d0d09e32a7df875","amp;dn":"Fellowship%21+The+Musical+Parody+of+The+Fellowship+of+the+Ring+-+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afbfe9c259973bac38ecfade6d0d09e32a7df875","infoHashBuffer":{"type":"Buffer","data":[175,191,233,194,89,151,59,172,56,236,250,222,109,13,9,227,42,125,248,117]},"announce":[],"urlList":[]}}