{"title":"De Tales (2006) (Digital) HC","uid":7235829,"size":63385140,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b0e56baba0bb042af30923218a4e865c3e4beab5&amp;dn=De+Tales+%282006%29+%28Digital%29+HC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1335985917,"description":"From the company that introduced American audiences to Brazilian twins Fabio Moon and Gabriel Ba (Daytripper, Pixu) comes a new hardcover edition of Dark Horse's out-of-print De:Tales, a collection of the twins' breakthrough short stories! After three Eisner Awards and a series of acclaimed projects with writers Joss Whedon (Sugarshock), Gerard Way (The Umbrella Academy), Mike Mignola (B.P.R.D.: 1947), and Matt Fraction (Casanova), Moon and Ba are now among the hottest artists in comics. De: Tales is the duo's most personal work to date, presenting their work separately, together, and in tandem - as the twins trade off on the roles of writing and illustrating, share those roles, or fly solo. Brimming with all the details of human life, their charming tales move from the urban reality of their home in Sao Paulo to the magical realism of their Latin American background. Featuring a brand-new cover, Moon and Ba's seminal and sought-after work is finally back in this handsome hardcover packaging, proving once again that they are a talented pair to watch out for.","torrent":{"xt":"urn:btih:b0e56baba0bb042af30923218a4e865c3e4beab5","amp;dn":"De+Tales+%282006%29+%28Digital%29+HC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0e56baba0bb042af30923218a4e865c3e4beab5","infoHashBuffer":{"type":"Buffer","data":[176,229,107,171,160,187,4,42,243,9,35,33,138,78,134,92,62,75,234,181]},"announce":[],"urlList":[]}}