{"title":"Folder Lock 7.0.0 with serial","uid":6683814,"size":9894128,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b3f8cad4858737b46c76588ed9e566baab25b43a&amp;dn=Folder+Lock+7.0.0+with+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1316323308,"description":"Folder Lock 7.0.0\n\nFolder Lock is fast file-security software that can password-protect, lock, hide, and encrypt any number of files, folders, drives, pictures, and documents in seconds. Locked files are undeletable, unrenamable, unmovable, hidden, and inaccessible. You can lock, scramble, or encrypt depending on speed and security. Folder Lock is fully portable, so you can protect your files on USB flash drives, disks, CD-RWs, notebooks, and hard disks, and it doesn't require installation on another PC. Folder Lock protects files in Windows, DOS, and Safe modes, even when you change your OS or boot from a disk. Folder Lock doesn't let you delete its own program folder, and it can't be uninstalled without the correct password. Additional options include Stealth Mode, Hacker Attempt Monitoring, Shred files, AutoLock, Auto Shutdown PC, Lock your PC, Erase PC tracks, 256-bit Blowfish Encryption and Context Menu in Explorer.\n\n\n\nFolder LockÃ‚Â® - The Fastest Encryption on Earth!\n------------------------------------------------\nFolder Lock is a file encryption software that offers fastest way of encrypting and password protecting files and folders. You can either choose to encrypt important files from techies or lock your files, pictures and private data from casual users. Folder Lock comes with locking, encryption, shredding, stealth mode, hack attempt monitoring, portability, plug &amp; play support, history cleaning, and more than 20 privacy features all tailored to special needs for people wanting privacy and security.\n\nMilitary Standard of securing your files and folders!\n------------------------------------------------------\nFolder Lock - file encryption software uses US military standard 256-bit Advanced Encryption Standard algorithm to protect your valuables. Encryption is on-the-fly and decryption is automatic i.e. content is loaded in memory instead of hard drive. This means your data is unrecoverable without correct password no matter how the protection is tampered and the protection is fast as it does away the hassle of decrypting everything in your hard drive.\n\nYour data moves freely in your pocket without fears!\n-----------------------------------------------------\nFolder Lock is a portable file encryption software offering PC independent password protection of your files and folders. Create a portable Locker in your USB Drive or Memory Stick and Folder Lock will also create an autoplay executable in your USB drive. Automatic plug &amp; plug is also supported making it easy to open protected Lockers on USB drive without the need to install Folder Lock.\n\nYour data is safe no matter what the bad guy think!!\n-----------------------------------------------------\nWith Folder Lock, all your data sits in one location i.e. your secured Locker. Furthermore, this file encryption software supports multi-user interface making it easy for the whole family or your colleagues to use your computer for storing their own Lockers with their own passwords. Never again worry about data loss, theft or privacy breaches. If you share your computer with others or fear hackers and thieves may steal your data, give Folder Lock a try!\n\nWorks on all 32-bit and 64-bit Windows platforms!\n--------------------------------------------------\nFolder Lock is compatible on all 32-bit and 64-bit flavors of Windows 7.0, Windows Vista, Windows XP, Windows 2008, Windows 2003 Server and Windows 2000. The protection is cross-platform compatible and PC independent. Folder Lock offers great features and zero compromise on data security in all versions of Windows.\n\nEncrypt:\n=========\n-Fast file encryption software\n-256-bit AES on-the-fly encryption\n-Encrypt files and folders of any type\n-Encrypt data on USB drives as well\n\nLock:\n======\n-Easy drag &amp; drop file locking\n-Password protect folders easily\n-Lock files, folders and drives\n-Context Menu in Explorer supported\n\nShred:\n=======\n-Shreds original files when encrypted\n-Leaves no traces on your PC\n-Prevents recovery of private data\n-Enable/disable shredding feature\n\nPrivacy:\n=========\n-File locking &amp; file encryption software\n-Cleans history automatically on use\n-Protected files are hidden as well\n-All features well suited for privacy\n\nStealth:\n=========\n-No evidence of Folder Lock installed\n-Remove all traces and shortcuts\n-Press hotkey to run Folder Lock\n-Program supports 64-bit based OS\n\nMonitoring:\n============\n-Hack Attempt Monitoring\n-Monitor fake login attempts\n-Shut down / logs off automatically\n-Halts on fake password attempts\n\nFeatures and Benefits:\n=======================\n\n-256-bit AES encryption. The fastest file encryption software that uses on-the-fly encryption (military standard) for file protection.\n-File Lock, Folder Lock, Drive Lock, File Encryption and Folder Encryption. All in one complete package.\n-Full Portability. Password protect USB Drives, Lock CDs &amp; DVDs and share password with trusted friends.\n-Backup or transfer your password protected Lockers anywhere. All data sits in one place for easy backup.\n-Undeletable Lockers (on the PC where Folder Lock is installed). Deletion requires you to login into Folder Lock.\n-Shred files automatically when data is encrypted. Choose this option if you're obsessed with your data.\n-Stealth Mode feature can efficiently hide all the traces of Folder Lock ever been installed on your PC.\n-Windows History Cleaning. Removes recent history of PC activity automatically when Locker closes.\n-Hack Attempt Monitoring option can monitor fake password attempts and can Shutdown PC automatically.\n-Fastest File Encryption Software! Encrypted data is later decrypted in memory, preventing data recovery &amp; slow processing.\n-Complete Privacy! Whether you're concerned with privacy, data theft, data loss, data leaks or virus attacks. You need Folder Lock!\n\n\nHome Page - http://www.newsoftwares.net/folderlock\n\n\n\n\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n\n\n*** When using TPB please read these important notes: \n-----------------------------------------------------\n\n01. AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they're \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don't use them.\n\n02. To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03. If AV software removed a clean crack usually it can be restored \n    (if it's not in Quarantine then look at History or something similar).\n\n04. To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/6487418&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/6487418&lt;/a&gt;\n\n05. Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06. Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07. Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08. Clicking on unknown links can coz malware being silently installed on a pc!\n\n09. Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10. Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n11. In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12. In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13. Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n14. Comments are welcome, unlike ranting, trolling, whining, etc.\n\n15. No Promises ... No Debts!\n\n\nFor reporting bad or suspicious        torrents:                                                                        &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor requests:                                                                       &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=31&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=31&lt;/a&gt;\n\nFor visiting my 1200+ torrents:                                                                        &lt;a href=&quot;\nhttp://thepiratebay.se/user/Anacondaz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Anacondaz/&lt;/a&gt;\n\n\n\n-----------------------------------------------------------------------------------\n\n\nTo the &quot;United Reliable The Pirate Bay Users&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intentionally \nposting fake comments &amp; files. Their meaning is just trying to spread \nconfusion and to frustrate TPB and it's users. \nLess downloaders = less seeders = less download speed etc = not good! \n\nIt's in the benefit of TPB and all reliable users to warn each other about people \nwho intentionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intentionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and TPB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable The Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\t\t\t\n\t\t","torrent":{"xt":"urn:btih:b3f8cad4858737b46c76588ed9e566baab25b43a","amp;dn":"Folder+Lock+7.0.0+with+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f8cad4858737b46c76588ed9e566baab25b43a","infoHashBuffer":{"type":"Buffer","data":[179,248,202,212,133,135,55,180,108,118,88,142,217,229,102,186,171,37,180,58]},"announce":[],"urlList":[]}}