{"title":"Happy Thank You More Please (2010) [DVDRip][DUAL][Eng-Spa]","uid":6687267,"size":1297601284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4bcdcf0513b092a03bfaff32597e0067e54afef&amp;dn=Happy+Thank+You+More+Please+%282010%29+%5BDVDRip%5D%5BDUAL%5D%5BEng-Spa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1316451773,"description":"Happy Thank You More Please (2010) [DVDRip][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.happythankyoumoreplease.com/#/home&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.happythankyoumoreplease.com/#/home&lt;/a&gt; &lt;a href=&quot;\nhttp://www.avalonproductions.es/happy/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.avalonproductions.es/happy/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1481572/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1481572/&lt;/a&gt;\n\n--------\nEnglish:\n--------\nQuality: DVDRip \nCodec: Xvid \nAudio: Castilian / English \nResolution: 720 x 404 \nAudio Codec: AC3 5.1 for both languages \n\nTitle: Happy thank you more Please \nOriginal title: Happythankyoumoreplease \nCountry: USA \nUSA release: 04/03/2011 \nReleased in Spain: 08/04/2011 \nReleased on DVD (rental): 31/08/2011 \nStudio: Paper Street Films \nDirector: Josh Radnor \nScreenplay: Josh Radnor \nStarring: Kate Mara, Malin Akerman, Josh Radnor, Dana Barron, Richard Jenkins, Zoe Kazan, Tony Hale, Pablo Schreiber, Fay Wolf, Michael Algieri, Peter Scanavino, Maria Elena Ramirez, Sawyer Novak \n\n\nSynopsis: \nThe young writer Sam Wexler (Josh Radnor) is having one of the best days of your life. He wakes up late and hungover to attend an important meeting with the director of one of the most prestigious publishing houses of New York. On the way to his appointment, he meets a child who has lost his mother on the subway and is torn between continuing his way as if it had never seen the child, or take care of him while his family is. \n\nAfter trying, unsuccessfully, to locate the family of the small Rasheen, Sam decides to take to your appointment in the editorial, which is a total failure. \n\nSam's life revolves around their friends, a group of New Yorkers who, about to enter adulthood, they try to answer your questions about love and friendship. Annie, her best friend (Malin Ackerman) suffer from a foodborne illness that made him lose his hair, and as she thinks, all her physical attractiveness. Sam 2 (Tony Hale) is a co-worker who is very attracted to her, but whom she avoids at all costs. \n\nCharlie (Paul Schrieber) and his girlfriend Mary Catherine (Zoe Kazan) pass through a difficult time in their relationship when, after receiving a job offer in Los Angeles, Charlie begins to seriously consider the move. \n\nSam's love life does not go much better than his career, moving from one relationship to another, avoiding any kind of commitment until he meets Mississippi (Kate Mara), a beautiful waitress and singer. It is so impressed with her that he proposes an unusual deal that will stagger your life and your friends.\n\n\n\n--------\nEspaÃƒÂ±ol:\n--------\nCalidad: DVDRip\nCodec: Xvid\nAudio: Castellano/InglÃƒÂ©s\nResoluciÃƒÂ³n: 720 x 404 \nAudio Codec: AC3 5.1 para ambos idiomas\n\nTÃƒÂ­tulo: Happy thank you more please\nTÃƒÂ­tulo original: HappyThankYouMorePlease\nPaÃƒÂ­s: USA \nEstreno en USA: 04/03/2011 \nEstreno en EspaÃƒÂ±a: 08/04/2011 \nLanzamiento en DVD (alquiler): 31/08/2011 \nProductora: Paper Street Films \nDirector: Josh Radnor \nGuiÃƒÂ³n: Josh Radnor \nReparto: Kate Mara, Malin Akerman, Josh Radnor, Dana Barron, Richard Jenkins, Zoe Kazan, Tony Hale, Pablo Schreiber, Fay Wolf, Michael Algieri, Peter Scanavino, Maria Elena Ramirez, Sawyer Novak\n\n\nSinopsis:\nEl joven escritor Sam Wexler (Josh Radnor) no estÃƒÂ¡ teniendo uno de los mejores dÃƒÂ­as de su vida. Se despierta tarde, y con resaca, para asistir a una importante reuniÃƒÂ³n con el director de una de las editoriales mÃƒÂ¡s prestigiosas de Nueva York. De camino a su cita, se encuentra con un niÃƒÂ±o que ha perdido a su madre en el metro y se debate entre continuar su camino, como si nunca hubiera visto al niÃƒÂ±o, o hacerse cargo de ÃƒÂ©l mientras encuentra a su familia. \n\nTras intentar, infructuosamente, localizar a la familia del pequeÃƒÂ±o Rasheen, Sam decide llevarlo a su cita en la editorial, que supone un estrepitoso fracaso. \n\nLa vida de Sam gira en torno a la de sus amigos, un grupo de neoyorquinos que, a punto de entrar en la edad adulta, tratan de resolver sus dudas sobre el amor y la amistad. Annie, su mejor amiga (Malin Ackerman) padece una enfermedad alimenticia que le ha hecho perder el pelo, y segÃƒÂºn ella piensa, todo su atractivo fÃƒÂ­sico. Sam 2 (Tony Hale) es un compaÃƒÂ±ero de trabajo que se siente muy atraÃƒÂ­do por ella, pero a quien ella rehuye a toda costa. \n\nCharlie (Pablo Schrieber) y su novia Mary Catherine (Zoe Kazan) atraviesan un momento difÃƒÂ­cil en su relaciÃƒÂ³n cuando, tras recibir una oferta de trabajo en Los Angeles, Charlie empieza a plantearse muy seriamente el traslado. \n\nLa vida sentimental de Sam no va mucho mejor que su carrera, pasa de una relaciÃƒÂ³n a otra, evitando cualquier tipo de compromiso, hasta que encuentra a Mississippi (Kate Mara), una hermosa camarera y cantante. Queda tan impactado con ella que le propone un curioso trato que harÃƒÂ¡ tambalearse su vida y la de sus amigos. \n\n\n","torrent":{"xt":"urn:btih:b4bcdcf0513b092a03bfaff32597e0067e54afef","amp;dn":"Happy+Thank+You+More+Please+%282010%29+%5BDVDRip%5D%5BDUAL%5D%5BEng-Spa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4bcdcf0513b092a03bfaff32597e0067e54afef","infoHashBuffer":{"type":"Buffer","data":[180,188,220,240,81,59,9,42,3,191,175,243,37,151,224,6,126,84,175,239]},"announce":[],"urlList":[]}}