{"title":"Encyclopedia of Multicultural Psychology{BBS}","uid":6663954,"size":6143951,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5fcfb8b53efe801f4d31c79bcbed4e96b9e02be&amp;dn=Encyclopedia+of+Multicultural+Psychology%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315614719,"description":"We live in a multicultural world, and professionals from a variety of fields are faced with challenges brought by differences that are in some cases only recently recognized or accommodated. The Encyclopedia of Multicultural Psychology is a welcome addition to the literature that attempts to define these differences. According to its introduction, this volume, the work of almost 200 academic contributors, is intended for &quot;laypersons, students, and professionals new to the field with an interest in the role of culture in psychology.&quot;\n\nAmong the A-Z entries are articles for ethnic groups, for example, Alaska natives, Cuban Americans, and Vietnamese Americans . Each of these articles gives background for the group, a history of its immigration, information about acculturation, and more. Major areas of concern, such as Depression, Posttraumatic stress disorder, and Stress are defined and discussed in general, and then with respect to various groups. Topics such as Bilingual education, Intelligence tests, Racism and discrimination, Religion , and Transracial adoption are discussed with an emphasis on the differences that culture brings to these issues. Series of entries cover culture-specific syndromes, indigenous healing, and religious and spiritual beliefs.\n\nThe articles are for the most part at least one page in length. Many are much longer, and most include bibliographies. There is good use of see also references. An alphabetical list of articles and a thematic guide can be found at the beginning of the volume. The index is sufficiently detailed.\n\nThis is a timely and useful volume that has value for students and professionals alike. It would fit well in the collections of academic and large public libraries where multiculturalism is a topic of concern. Danise Hoover\nCopyright Ã‚Â© American Library Association. All rights reserved\nReview\n&quot;This is a timely and useful volume that has value for students and professionals alike. It would fit well in the collections of academic and large public libraries where multiculturalism is a topic of concern.&quot; (Danise Hoover )\n\n&quot;Useful statistics are included for many entries. The presentation and writing format are clear. This will be a valuable book for a wide variety of readers interested in multicultural psychology. Comprehensive index. Highly recommended.&quot; (V. Viator )\n\n    &quot;Those working in a counseling relationship with members of various underrepresented cultural groups in the United States will find the encyclopedia particularly useful. There are numerous entries that either directly or indirectly address issues of clinical relevance. For example, some of the topics covered in the Psychopathology and Treatment categories include depression, anxiety, alcohol/substance use and abuse, help-seeking behavior, family therapy, indigenous treatments and healers, psychopharmacology, and multicultural competencies. The text also attends to psychopathology or psychological distress as it is understood, experienced, and measured from different cultural perspectives.     This encyclopedia is a meaningful contribution to the field of multicultural psychology. Jackson and her colleagues offer an authoritative synthesis of the important work that has been done to advance sensitivity and understanding of the rich cultural diversity that characterizes the United States.&quot; (Mary C. Burke )\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 492 pages\n    * Publisher: Sage Publications, Inc; 1 edition (August 18, 2006)\n    * Language: English\n    * ISBN-10: 1412909481\n    * ISBN-13: 978-1412909488\n    * Product Dimensions: 11.1 x 8.7 x 1.5 inches ","torrent":{"xt":"urn:btih:b5fcfb8b53efe801f4d31c79bcbed4e96b9e02be","amp;dn":"Encyclopedia+of+Multicultural+Psychology%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5fcfb8b53efe801f4d31c79bcbed4e96b9e02be","infoHashBuffer":{"type":"Buffer","data":[181,252,251,139,83,239,232,1,244,211,28,121,188,190,212,233,107,158,2,190]},"announce":[],"urlList":[]}}