{"title":"The Ed Show 6-20-12.mp4","uid":7374123,"size":175804384,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b849472fca43ba052c888650384ba56e1473ba43&amp;dn=The+Ed+Show+6-20-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"liberal42","files":1,"time":1340312885,"description":"The Ed Show; June 20 2012.\n\nThe Ed Show covers the unprecedented contempt of AG Eric Holder as recommended by Darrell Issa's committee in the house. John Boehner has expressed support for the entire house to vote against this. This is a political witch hunt paralleled only by the McCarthy hearings.\n\nEd speaks first with Carolyn Maloney (D) NY then with Johnathan Alter on Issa's witch hunt.\n\nThen Ed discuss the nightmare of the dream act for Marco Rubio with Rep. Xavier Becerra (D) California.\n\nThen Mike Hatch (former Minnesota AG), discusses if a Romney/Pawlenty ticket is a dream for Democrats.\n\nA panel discusses Obama's lawsuit that calls Crossroads GPS a tax exempt &quot;Social Welfare Organization&quot;. In the panel are: Krystal Ball (MSNBC Contributor), Mark Simone (Radio Talkshow Host), and Karen Finney (Former Communications Director of the DNC). The panel then turns their attention back to congress going forward with contempt charges.\n\nThen Ed looks into if liberals should ditch the individual mandate as Howard Dean did.\n\nFinally, Sen. Bernie Sanders (I) Vermont, joins Ed to discuss the large cuts in food stamps as subsidies rise for wealthy farmers (the bill enjoys bipartisan support).","torrent":{"xt":"urn:btih:b849472fca43ba052c888650384ba56e1473ba43","amp;dn":"The+Ed+Show+6-20-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b849472fca43ba052c888650384ba56e1473ba43","infoHashBuffer":{"type":"Buffer","data":[184,73,71,47,202,67,186,5,44,136,134,80,56,75,165,110,20,115,186,67]},"announce":[],"urlList":[]}}