{"title":"HISTORY OF POP AND ROCK MUSIC - part 305","uid":6541280,"size":513337972,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:baff9ef5bde07467c6058cfb68a05085cdce882c&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+305&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zlatkopupovac","files":-1,"time":1310699685,"description":"                          PART  305\n\n\n\n                          Fifties \n\n\n             CARL PERKINS   -  I'm Glad All Over (1957)\n             CHARLIE GRACIE  - 'Cool Baby  (1957)\n             JERRY LEE LEWIS TRIO  -  Great Balls of Fire  (1957)\n             JOHNNY CARROLL -   Crazy Crazy Lovin'  (1957)\n             LITTLE RICHARD - Tutti-Frutti  (1957)\n             FATS DOMINO - Wait &amp; See  (1957)\n\n\n\n    &quot;Glad All Over&quot; is a song written by Aaron Schroeder, Sid Tepper, and Roy Bennett and recorded by rockabilly artist Carl Perkins, &quot;The Rockin' Guitar Man&quot;, at Sun Records in 1957. It was released as a 45 and 78 single on January 6, 1958 . A performance of the song was featured on the 1957 film Jamboree, where Perkins and his band perform the song in a recording studio. The Carl Perkins band consisted of Carl Perkins on lead guitar and vocals, Jay Perkins on rhythm guitar, Clayton Perkins on upright bass, and W.S. &quot;Fluke&quot; Holland on drums, who later became the drummer for Johnny Cash, who called him &quot;The Father of the Drums&quot;. \n    Charlie Gracie  is an American rock pioneer and singer. He was born the same day as another rock and roll singer, Bobby Darin.Gracie's musical career started at the age of 14 when he appeared on the Paul Whiteman television show.Gracie's personal appearances grew until he performed and headlined some of the biggest venues of that time: Alan Freed's rock and roll shows at the Brooklyn Paramount, The Ed Sullivan Show, American Bandstand and the 500 Club in Atlantic City. He appeared in the 1957 film, Jamboree, and toured with Chuck Berry, The Everly Brothers, Bo Diddley and his close friend, Eddie Cochran.Gracie's pioneering contribution to the genre has been recognized by the Rockabilly Hall of Fame.\n    &quot;Great Balls of Fire&quot; is a 1957 song written by Otis Blackwell and Jack Hammer.The song is best known for Jerry Lee Lewis's rendition, which was recorded in the Sun Studio in Memphis, Tennessee on October 8, 1957, and released as a 45rpm single on Sun 281 in November 1957. It reached #2 on the Billboard pop charts, #3 on the R&amp;B charts, and #1 on the country charts. It also reached #1 on the UK pop charts and it appeared on New Zealand Singles Chart and Dutch Top 40. The Jerry Lee Lewis rendition was ranked as the 96th greatest song ever by Rolling Stone.\n    Johnny Carroll (1937-1995) was an American rockabilly musician.Carroll began recording for Decca Records in the middle of the 1950s. He released several singles, but none of them saw significant success, though they are now critically acclaimed. His records were eclipsed by the success of other rockabilly and early rock &amp; roll musicians such as Elvis Presley, Jerry Lee Lewis, and Johnny Cash.\n   &quot;Tutti Frutti&quot;  is a 1955 song by Little Richard, which became his first hit record. With its opening cry of &quot;A-wop-bop-a-loo-bop-a-lop-bop-bop!&quot; (supposedly intended to be an onomatopoeic parody of a drum intro) and its hard-driving sound and wild lyrics, it became not only a model for many future Little Richard songs, but also one of the models for Rock and Roll itself. The song was recorded on September 14, 1955. Released on Specialty 561, the record entered the Billboard Rhythm and Blues chart at the end of November 1955, and rose to # 2 early in 1956. It also reached # 17 on the Billboard pop chart. In the UK, it only scraped into the top 30 in 1957, as the B-side of &quot;Long Tall Sally&quot;.\n\n\nFrom Wikipedia, the free encyclopedia","torrent":{"xt":"urn:btih:baff9ef5bde07467c6058cfb68a05085cdce882c","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+305","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baff9ef5bde07467c6058cfb68a05085cdce882c","infoHashBuffer":{"type":"Buffer","data":[186,255,158,245,189,224,116,103,198,5,140,251,104,160,80,133,205,206,136,44]},"announce":[],"urlList":[]}}