{"title":"MarxismLiberalismFeminism.pdf","uid":6556596,"size":425870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbc1d170bb844f9e2660c19d167b6816696a786d&amp;dn=MarxismLiberalismFeminism.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"engleerica","files":-1,"time":1311322332,"description":"Marxism, Liberalism, And Feminism (Leftist Legal Thought) New Delhi, Serials (2010) by Dr.Jur. Eric Engle LL.M. presents a broad overview of Marx theory on legal thought. It examines the Marxist theory of Law and the state as a legal and historical phenomenon. We can draw both Positive and negative inspiration from the Soviet Experiences and lessons for contemporary law Reforms by placing Marxism correctly in its relation to the liberal Theories which engendered it and by looking at history. The Soviet legal systems were a variant on the civilianize legal systems: Marxism was not a break in Western through. The Soviet legal system essentially mirrored the U.S., with parallel Institutions and different justifications. The U.S. and U.S.S.R. were both federal hegemony. However, they were organized around competing distributive principales: equality for the East, Liberty for the west. This work consists of a theoretical, historical, and speculative portion. It compares Marxist theories with the liberal theories which engendered Marxist .It presents the concept of socialist Legality and the Marxist Critique of Human Rights. It shows that the Ussr developed in parallel to the West but guided by a different Teleology distributive Justice directed towards equality in Society instead of liberty and individualism. The final three chapters are speculative. They expose Rousseaus Views on women, compare the post-Marxixt Feminist Mackinnon to Marx, and conclude with an overview of Marxist in flounces on left legal theory. The work present a theoretical and practical contribution to understanding and resolving the problems of Poverty and protection of human rights.","torrent":{"xt":"urn:btih:bbc1d170bb844f9e2660c19d167b6816696a786d","amp;dn":"MarxismLiberalismFeminism.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc1d170bb844f9e2660c19d167b6816696a786d","infoHashBuffer":{"type":"Buffer","data":[187,193,209,112,187,132,79,158,38,96,193,157,22,123,104,22,105,106,120,109]},"announce":[],"urlList":[]}}