{"title":"20110915-Stossel-[Question Authority]-Fox Business.CF.avi","uid":6682682,"size":359875960,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bc3c78afacdd730966b3ce1d2cd2248174abca58&amp;dn=20110915-Stossel-%5BQuestion+Authority%5D-Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1316221049,"description":"----------\n\nSTOSSEL - [Question Authority] - Fox Business Network\n2011, September 15, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n[excerpted from John Stossel's blog:]\n\nDo you question authority?\n\nAmericans seem to listen to anyone who looks like he is in charge.\n\nA fake security guard convinced airline passengers to lie down on the conveyer belt and go through a baggage X-ray like a piece of luggage.\n\nWhen a man with a clipboard stood at the Texas-Arkansas border, and told drivers that they couldn't enter Texas because it was &quot;closed,&quot; the drivers actually complied and turned around. Why?\n\nBecause we're taught to listen to authority.\n\nSeveral years ago, in a town in Pennsylvania, a man pretending to be a police officer raped one woman and molested others. The assaults had been well-publicized. The media and local police told people: &quot;Be on guard... be suspicious. Don't trust someone just because he says he's a police officer.&quot;\n\nSo, for a TV story, I bought a cheap mail-order police uniform and went to the town. I assumed people would question me...but no one did. Everyone just assumed I was a real police officer.\n\nIt's important to question authority. And here's a more important reason:\n\nDuring World War II, some Germans hated Jews ... in China, some people hated those who didn't obey the rules in Mao's little red book ... later, in Rwanda, some Hutus hated Tutsis.\n\nThere will always be some people who hate others. But what led to the murder of millions ...was blind obedience. Genocide doesn't happen without that.\n\nAlso on tonight's show, I'll show a small part of a psychology experiment conducted years ago by Yale professor Stanley Milgram.\n\nMilgram was trying to understand why, during the Holocaust, so many German soldiers were willing to obey orders and kill Jews. So he ran an ad asking for people to participate in what he said was a study of learning and memory. 40 men volunteered.\n\nThe volunteers were told to give increasingly stronger electric shocks to other volunteers who got answers wrong on a memory test. In truth, there were no other volunteers and no real shocks, but the men didn't know that. What they heard was a tape recording of someone pretending to be shocked ... with increasing sounds for each shock level. As the voltage increased, an actor banged on the wall as if he was in terrible pain.\n\nBefore conducting the experiment, Milgram asked Yale professors and students to predict how many men would administer the stronger shocks. Few believed they would ... and yet, all the test subjects did. 65% of the volunteers went all the way to the maximum of 450-volts.\n\nThey were upset about it. They later said they felt tortured themselves. But they still did it.\n\nWhat Milgram wrote in an article about his experiment titled, &quot;The Perils of Obedience&quot;, is still true today: &quot;few people have the resources ... to resist authority.&quot;\n\nWell...it's important that we get those resources.\n\n&quot;QUESTIONING AUTHORITY&quot; airs tonight at 10pm ET on FOX Business Network. Re-airing Saturday and Sunday at 9pm &amp; midnight ET.","torrent":{"xt":"urn:btih:bc3c78afacdd730966b3ce1d2cd2248174abca58","amp;dn":"20110915-Stossel-%5BQuestion+Authority%5D-Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc3c78afacdd730966b3ce1d2cd2248174abca58","infoHashBuffer":{"type":"Buffer","data":[188,60,120,175,172,221,115,9,102,179,206,29,44,210,36,129,116,171,202,88]},"announce":[],"urlList":[]}}