{"title":"God of War: Ghost of Sparta (2010) PSP","uid":6680845,"size":1541851281,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:bdde9890f7253cf2c85c7fb94578345c36161aa6&amp;dn=God+of+War%3A+Ghost+of+Sparta+%282010%29+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"theycallmepistol","files":-1,"time":1316187414,"description":" &lt;a href=&quot;http://reliztv.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://reliztv.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i2.imageban.ru/out/2011/09/16/0c2487feb304708e583379da3c624846.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i2.imageban.ru/out/2011/09/16/0c2487feb304708e583379da3c624846.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i2.imageban.ru/out/2011/09/16/36925bcb9d91d5f219bf5ebfb055ce0c.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i2.imageban.ru/out/2011/09/16/36925bcb9d91d5f219bf5ebfb055ce0c.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i2.imageban.ru/out/2011/09/16/a3e11ebdfa76f0e3ec777e398c3c70bc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i2.imageban.ru/out/2011/09/16/a3e11ebdfa76f0e3ec777e398c3c70bc.jpg&lt;/a&gt;\n\nYear: 2010\nDeveloper: SCEA / Ready At Dawn Studios LLC. / Santa Monica Studio\nPublisher: Sony Computer Entertainment America Inc.\nLanguage: English, Russian, Polish\nGenre: Action\n\nGod of War: Ghost of Sparta - a masterpiece from the creators of the famous video game studio Ready at Dawn. This game is the latest in a series God of War. She has all the prerequisites to become a multimillion-dollar publishing the same as her predshestvenniki.Glavny hero is still a Spartan warrior, Kratos. In this part of the game his goal is to reveal the secrets of his past, covered with a dark veil of obscurity. In the course of actions in the game, Kratos achieves extraordinary Olympic vysot.V God of War: Ghost of Sparta players will find all the things that attracted them in the earlier parts of the game - a breathtaking adventure, fierce battles with the blood and the use of super-weapon. It also spun an intriguing plot, coupled with mind-blowing graphics will leave no ravnodushnymi.Igroki once again to plunge into the mysteries of Greek mythology, more and more getting to know the secrets of the past along with the main Kratos geroem.Syuzhet built on the fact that Kratos is constantly pursuing the vision of his past that make it go on a dangerous and arduous journey to unravel the mystery. Over the long haul, Kratos gradually learns the things that were previously unknown to him and tormented by visions. He learns the secrets of tattoos and scars on his body. He opens the whole truth about the deaths of millions of years, many worlds and, eventually, Kratos finds out what evil befell his family at the creators of this game dele.V used the latest technology developments. Special attention should be paid on schedule. The player immersed in the game, feel their actual presence on the battlefield in the midst of terrible mythical creature with the blade of chaos in rukah.V game appeared and many new features, such as new sophisticated combat techniques, new characters and the magic of their ability, and, of course, new weapons.\n\nFeatures:\n# God Of War: Ghost Of Sparta - a beautiful masterpiece from renowned creators of video games studio Ready at Dawn.\n# The main character always acts as a fearless Spartan Kratos. In God Of War: Ghost Of Sparta its purpose is to reveal the secrets of his past, covered with a dark veil of obscurity. In the course of actions in the game, Kratos achieves extraordinary Olympic Heights.\n# In God Of War: Ghost Of Sparta players will find all the things that attracted them in the earlier parts of the game - a breathtaking adventure, fierce battles with the blood and use different weapons.\n# In God Of War: Ghost Of Sparta spun an intriguing plot, coupled with mind-boggling graphics will leave no one indifferent. Players once again to plunge into the mysteries of Greek mythology, more and more getting to know the secrets of the past, Kratos, along with the main character.\n# God Of War: Ghost Of Sparta is the latest in a series God of War. In God Of War: Ghost Of Sparta have all the prerequisites to become a multimillion-dollar publishing the same as its predecessors.\n\nInstallation\n1. Take a psp and usb.\n2. Connect the usb to the psp and the computer.\n3. Move the file to the folder the game ISO.\n4. Disconnect the psp from the usb.\n5. Play.\n\nSystem requirements\nGaming platform: 5.00 M33-6 / 5.50 GEN / 5.03 GEN / 5.00 Prometheus / 5.50 Prometheus\nRequired space on HDD: 1.44 GB","torrent":{"xt":"urn:btih:bdde9890f7253cf2c85c7fb94578345c36161aa6","amp;dn":"God+of+War%3A+Ghost+of+Sparta+%282010%29+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdde9890f7253cf2c85c7fb94578345c36161aa6","infoHashBuffer":{"type":"Buffer","data":[189,222,152,144,247,37,60,242,200,92,127,185,69,120,52,92,54,22,26,166]},"announce":[],"urlList":[]}}