{"title":"Coke Studio Season 5 Episode 2","uid":7303308,"size":103236800,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:be39f703f724426f3230aefed9c612122fbe9a97&amp;dn=Coke+Studio+Season+5+Episode+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jackthetrent","files":5,"time":1338110084,"description":"Coke Studio Season 5\n\nAims to introduce new genres and fusion where featured artists would explore their heritage besides showcasing their unique styles.\n\nThis season of Coke Studio will be exploring unique aspects of our culture by highlighting regional language songs and artists, introducing some gifted yet virtually unknown young singers who have arrived on this platform through their talents, passion and creativity. Season 5 will also showcase the creative and intellectual rediscovery of featured artists who will return to Coke Studio for the second time, while the young artists will discover their heritage by incorporating parts of Sufi poetry and philosophy in their music and writings.\n\nTo this end, Season 5 witnesses Rohail Hyatt back at the helm and features Atif Aslam, Bilal Khan, Bohemia, Chakwalis, Fareed Ayaz and Abu Muhammad, Hadiqa Kiyani, Hamayoon Khan, Meesha Shafi, Tahir Mithu, Overload, Qayaas, SYMT and Uzair Jaswal.\n\nSeason 5 also marks the return of the house band with Asad Ahmed on guitar, Babar Ali Khanna on dholak, Javed Iqbal on violin, Kamran &quot;Mannu&quot; Zafar on bass, Omran &quot;Momo&quot; Shafique on guitar, Sikander Mufti on multi-percussions and Rachel Viccaji and Zoe Viccaji on backing vocals. Joining the house band this season are two new talents Farhad Humayun on drums and Mubashir Admani on keyboards.\n\nEpisode 2\n\nKhabaram Raseeda - Fareed Ayaz &amp; Abu Muhammad\nLarho Mujhey - Bilal Khan\nRabba Sacheya - Atif Aslam\nPere Pavandi Saan - Tahir Mithu\nIshq Aap Bhe Awalla - Chakwal Group &amp; Meesha Shafi","torrent":{"xt":"urn:btih:be39f703f724426f3230aefed9c612122fbe9a97","amp;dn":"Coke+Studio+Season+5+Episode+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be39f703f724426f3230aefed9c612122fbe9a97","infoHashBuffer":{"type":"Buffer","data":[190,57,247,3,247,36,66,111,50,48,174,254,217,198,18,18,47,190,154,151]},"announce":[],"urlList":[]}}