{"title":"Code in the Cloud {BBS}","uid":7353543,"size":3714408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be458ccfee800d3cf8f1dd73ac246fcdcee96ef2&amp;dn=Code+in+the+Cloud+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1339687646,"description":"One of the most exciting recent changes in the computing world is cloud computing. Cloud computing is a dramatic shift in how applications are developed and used---and even in what applications are. With cloud computing, developers are no longer building applications that run on a user's desktop computer. Instead, they're building services on the network that can be used by thousands of users at the same time.\n\nCloud services are an exciting opportunity for developers: the cloud is a platform for creating services, a new kind of application that can reach more users, and provide those users with more capabilities than a desktop application ever could. Building applications as cloud services also makes them scalable: cloud applications can easily and smoothly adapt from running on a single computer for a single user to running on thousands of computers for millions of users.\n\nCode in the Cloud will teach you what a cloud service is, and how it differs from traditional applications. It will show you how to build a cloud service, taking advantage of the services that AppEngine makes available to you, using iterative development of a simple application to guide you through the different aspects of AppEngine development, using either Python or Java.\n\nThrough the process of working on a simple application, you'll learn about how to build an application as a service; how to manage persistent data using AppEngine; how to build dynamic, interactive user interfaces that run in a user's web-browser; how to manage security in a web application; and how to interact with other services running in the AppEngine cloud.\n\n\nPaperback: 320 pages\nPublisher: Pragmatic Bookshelf; 1 edition (April 29, 2011)\nLanguage: English\nISBN-10: 1934356638\nISBN-13: 978-1934356630","torrent":{"xt":"urn:btih:be458ccfee800d3cf8f1dd73ac246fcdcee96ef2","amp;dn":"Code+in+the+Cloud+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be458ccfee800d3cf8f1dd73ac246fcdcee96ef2","infoHashBuffer":{"type":"Buffer","data":[190,69,140,207,238,128,13,60,248,241,221,115,172,36,111,205,206,233,110,242]},"announce":[],"urlList":[]}}