{"title":"Grand Theft Auto 1 Pack + GTA 2 - GLOBE","uid":7298914,"size":145211265,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:be87d3dc39c3bcbc6a44e4d47cccd204fe8106c8&amp;dn=Grand+Theft+Auto+1+Pack+%2B+GTA+2+-+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1337975113,"description":"HI , GRAND THEFT AUTO SERIES FANS ...\n\n\n\nFINALLY GRAND THEFT AUTO 1 WITH THE 2 MISSIONS PACKS AVAILABLE TO PLAY WITH EVERYTHING PERFECT VERY EASILY WITH A VERY FRIENDLY INTERFACE ...\n\nAND NOW INCLUDING THE VERY ADDICTIVE GTA 2 ...\n\nALL ACCESSABLE BY A SINGLE WITH THE BEST SOUNDTRACK OF THIS GAMES ON THE NET AT THE INTERFACE BACKGROUND ...\n\n\n \n\n\n* GRAND THEFT AUTO 1 DOS PACK ;\n\n\n- GRAND THEFT AUTO 1\n\n- GRAND THEFT AUTO LONDON 1969 [MISSION PACK 1]\n\n- GRAND THEFT AUTO LONDON 1961 [MISSION PACK 2]\n\n\n\n* GRAND THEFT AUTO 2 \n\n\n\n\n* SYNOPSE :\n\n\nGrand Theft Auto 1 (abbreviated as GTA) is a 1997 action-adventure open world video game created by games developer DMA Design (now Rockstar North) and published by BMG Interactive. The game allows the player to take on the role of a criminal who can roam freely around a big city. Various missions are set for completion, such as bank robberies, assassinations, and other crimes. It is the first in the Grand Theft Auto series that has thus far spanned ten standalone games and three expansion packs.\n\n\n\nGTA 2 is set in an unspecified time in a retrofuturistic metropolis referred to only as &quot;Anywhere, USA&quot;,[4] but the game's manual and website uses the phrase &quot;three weeks into the future&quot;;[5] fictional journal entries on the GTA2 website suggest the year to be 2013.[4] Radio host Johnny Riccaro mentions in the game that &quot;the millennium's coming,&quot; which would set the game shortly before 2000.\nThe City is split into three levels, or &quot;districts.&quot; The first level, Downtown, is a hub of business activity as well as the site of a large mental institution and university. The second area, the Residential District, contains the city's prison, a trailer park with an Elvis-themed bar dubbed &quot;Disgracelands&quot;, a shopping mall, and a giant hydroelectric power plant. The third and final area is the Industrial District; it holds a large seaport, a meat packing plant, a Nuclear Power Plant and a Krishna temple.\nThere are a total of seven criminal gangs in the game: the Zaibatsu, a corrupt corporation, is present in all three areas. The Downtown area is also home to the Loonies, a gang of mentally ill people who have taken over the city asylum, and the Yakuza. In the Residential area, the gangs include SRS Scientists and the Rednecks, who live in a trailer park and drive around in pickups with large Confederate flags. The Industrial area contains the Russian Mafia and the Hare Krishna. Each gang has their own special characteristics, car, and behavior.\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012\t\t","torrent":{"xt":"urn:btih:be87d3dc39c3bcbc6a44e4d47cccd204fe8106c8","amp;dn":"Grand+Theft+Auto+1+Pack+%2B+GTA+2+-+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be87d3dc39c3bcbc6a44e4d47cccd204fe8106c8","infoHashBuffer":{"type":"Buffer","data":[190,135,211,220,57,195,188,188,106,68,228,212,124,204,210,4,254,129,6,200]},"announce":[],"urlList":[]}}