{"title":"BBC2 The Story Light Entertainent.avi","uid":7226355,"size":608090588,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bf6176d0ab84ab3bf57072d433363be4c6480056&amp;dn=BBC2+The+Story+Light+Entertainent.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mac.moe","files":1,"time":1335690464,"description":"Someone complained that I give no information with my uploads, but I give the name of the program, and the channel that it was broadcast on. Google will find more. I do not give technical info, because I am old and I do not understand most of it !!\n\n  \n\nI upload interesting programs, mostly from BBC2 and BBC4 that nobody else uploads. I have time to do this, because I am disabled and seldom leave the house. It is difficult for me to use a keyboard, so I do not bother with information that able bodied pirates can easily find on the net !!\n\n \n\nI am not going to trade disabilities with someone that is more articulate and more disabled than me. I cannot compete with a quad P that uses a mouth stick, so I'll quit after this upload, and concentrate on my day job, caring for sad EE addicts. They are more tolerant, and let me amuse myself by playing my childish, narcissistic games !!\n \nSome more easy listening over the next few days, then I will stop feeling sorry for myself, take my tongue out of my cheek  and retire !!\n \n\nBut your comments are still appreciated, so please leave them, good, bad, humourous or sympathetic !!\n\n \n\n\n\nWinx 1500/160k","torrent":{"xt":"urn:btih:bf6176d0ab84ab3bf57072d433363be4c6480056","amp;dn":"BBC2+The+Story+Light+Entertainent.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6176d0ab84ab3bf57072d433363be4c6480056","infoHashBuffer":{"type":"Buffer","data":[191,97,118,208,171,132,171,59,245,112,114,212,51,54,59,228,198,72,0,86]},"announce":[],"urlList":[]}}