{"title":"The PJ's Season 1 Dvdrip to mp4","uid":7236835,"size":887299164,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c0492662dede85f24f463eeebd0ab71ad2c0b3d2&amp;dn=The+PJ%27s+Season+1+Dvdrip+to+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PRODTorrents","files":13,"time":1336016485,"description":"Episode 1: &quot;Hangin' with Mr.Super&quot; Calvin decides that he wants to be just like Thurgood. But after Muriel hears about Calvin's idea she demands that Thurgood have him change his mind. (January 10, 1999)\nEpisode 2: &quot;Bones, Bugs and Harmony&quot; Thurgood assumes Mrs. Avery is eating dog food. (January 12, 1999)\nEpisode 3: &quot;The Door&quot; Thurgood gets a new door for the building but it gets stolen. (January 19, 1999)\nEpisode 4: &quot;Journal Fever&quot; Thurgood decides to take care of Muriel while she has the flu. (January 26, 1999)\nEpisode 5: &quot;Rich Man, Porn Man&quot; When the local porno movie theater is about to be shut down Thurgood decides that it is up to him to save it. (February 2, 1999)\nEpisode 6: &quot;Bougie Nights&quot; To get some time to himself and get away from the others, Thrugood hides away in the building hidden penthouse. But when Muriel and the other tenants find out he loses them and has to choose between the penthouse or his wife and friends. (February 9, 1999)\nEpisode 7: &quot;A Hero Ain't Nothing But A Super&quot; When the stubbs get mugged Muriel comes to the rescue and catches the burglar. But when Thurgood becomes jealous that all the credit. (February 16, 1999)\nEpisode 8: &quot;He's Gotta Have It&quot; Thurgood's libido increases when he take a prescription drug to stabilize his blood pressure. (February 23, 1999)\nEpisode 9: &quot;Boyz' N The Woods&quot; When Thurgood forgets to sign Juicy and Calvin up for a camping trip he decides that he could give them a better camping trip. With stories like the &quot;Red Moley&quot; story he and his friends try to scare them into having a good time. (April 6, 1999)\nEpisode 10: &quot;Operation Gumbo Drop&quot; When Thurgood enters a Gumbo cooking contest. He decides that he can't win fair and square so he uses some old dirty tricks he has up his sleeves to sabotage the other contestants Gumbo. (April 13, 1999)\nEpisode 11: &quot;U Go Kart&quot; The boys build a go-kart which mysteriously disappears. (May 4, 1999)\nEpisode 12: &quot;House Potty&quot; Thurgood decides to renovate that housing project but not by fixing that problems the tenants have but by adding a space-age toliet that causes the tenants to have Thurgood resign as the Super of the building. (May 11, 1999)\nEpisode 13: &quot;Haiti Sings The Blues&quot; Haiti Lady's puts a curse on Thurgood. (May 18, 1999)\n\nMissing episode 14 will uploaded later. all episode are mp4 and play on ps3 xbox 360 and ipod touch 60mb per episode.\n\nPLEASE SEED AS MUCH AS YOU CAN","torrent":{"xt":"urn:btih:c0492662dede85f24f463eeebd0ab71ad2c0b3d2","amp;dn":"The+PJ%27s+Season+1+Dvdrip+to+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0492662dede85f24f463eeebd0ab71ad2c0b3d2","infoHashBuffer":{"type":"Buffer","data":[192,73,38,98,222,222,133,242,79,70,62,238,189,10,183,26,210,192,179,210]},"announce":[],"urlList":[]}}