{"title":"127 Hours(2010)DVDRip.AC3(ENG)-DROCK","uid":7344438,"size":734121984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c0f53c920dfb4bdfcbf448475a12895040434b22&amp;dn=127+Hours%282010%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1339368787,"description":"James Franco stars in director Danny Boyle's inspiring survival drama based on the incredible true story of Aron Ralston, who became trapped alone in a Utah canyon for days after slipping on a loose rock, and resorted to extraordinary measures in order to make it out of his dire predicament alive. An experienced hiker and climber, Ralston (Franco) is very much in his element when he parks his truck by a mountain near Moab, UT, hops on his bike, and peddles to the middle of nowhere. Later, when Ralston encounters a pair of young female hikers who have gotten lost while searching for a local landmark, he jovially shows them a sight that most casual hikers miss before bidding them farewell and continuing on his way. Drifting through the canyons alone, deep in thought, however, the explorer who presumed he was ready for anything quickly discovers just how fast things can spin out of control when a rock gives way as he shimmies down a crevice, and pins his hand to the unforgiving wall of stone. Over the course of the next 127 hours, Ralston tries everything he can think of to free himself, flashing back to small but memorable events in his life -- as well as forward to the future that he might enjoy should he manage to wiggle free -- as his body begins the slow process of shutting down. Eventually realizing that the only way out is to leave part of himself behind, the exhausted, delirious adventurer draws his cheap made-in-China multi-tool, and does what it takes to survive.\n\nRipped with Autogk\n\nLength: 1 Hour 34 Minutes\n\nFile Type: AVI\n\nFrame Width: 624\n\nFrame Height: 336\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 128kbps","torrent":{"xt":"urn:btih:c0f53c920dfb4bdfcbf448475a12895040434b22","amp;dn":"127+Hours%282010%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0f53c920dfb4bdfcbf448475a12895040434b22","infoHashBuffer":{"type":"Buffer","data":[192,245,60,146,13,251,75,223,203,244,72,71,90,18,137,80,64,67,75,34]},"announce":[],"urlList":[]}}