{"title":"Battlestar Galactica: Razor 720p [PS3 Compatible]","uid":6662207,"size":2468732340,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:c123d9e2921872a76f30021173dd84d2a5856aae&amp;dn=Battlestar+Galactica%3A+Razor+720p+%5BPS3+Compatible%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DarthPS3","files":-1,"time":1315561687,"description":"This was originally just going to be a treat in the Season 4 torrent, but seeing as how that has been a complete disaster up until now, here's a little treat all by itself.\n\nThank you to all the teams, scenes and other uploaders that have brought so much delightful fun into my life.\n \nPlease help seed when done.\n\nAs always, please be patient for the first 3-4 days after I initially upload the torrent. Thank you to all those that have helped seed my other torrents, which allows me to continue uploading new stuff. \n\n\nIf anyone has any requests, post below.\n\nFor more of my PS3 compatible torrents, click above, DarthPS3.\n  \n|- These are all my personal files, films and television shows that I could not find (most often in high resolution) in a format that would allow me to simply pop on a external hard drive. I converted all these files, most often from original .mkv sources, and since they are sitting there decided to share them.\n Though my torrents take a few days to download, most of the original sources that I myself downloaded took a few days.\n So, if you want to go find and download those original sources and then convert them to work on your PS3 yourself, awesome, but if you were as frustrated as I was and either don't want to convert them or don't know how, here you go.-| \n\n\nThank you's are welcome.\t\t\n ","torrent":{"xt":"urn:btih:c123d9e2921872a76f30021173dd84d2a5856aae","amp;dn":"Battlestar+Galactica%3A+Razor+720p+%5BPS3+Compatible%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c123d9e2921872a76f30021173dd84d2a5856aae","infoHashBuffer":{"type":"Buffer","data":[193,35,217,226,146,24,114,167,111,48,2,17,115,221,132,210,165,133,106,174]},"announce":[],"urlList":[]}}