{"title":"One Piece - Movie Pack (1-2-3) [DVDrip ITA JAP] TNT Village","uid":6673159,"size":2698462058,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c315d324b94008d8771549462ec6627742673c75&amp;dn=One+Piece+-+Movie+Pack+%281-2-3%29+%5BDVDrip+ITA+JAP%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":3,"time":1315939947,"description":"One Piece - Movie Pack (1-2-3) [DVDrip ITA JAP] TNT Village\n\nDual Audio: #1 Italian #2 Japanese\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=72751&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=72751&lt;/a&gt;\n\n.: Plot :.\n\nMovie 1 (2000) There once was a pirate known as the Great Gold Pirate Woonan, who obtained almost 1/3 of the world's gold. Over the course of a few years, the pirate's existence faded, and a legend grew that he disappeared with his gold to a remote island, an island pirates continue to search for. Aboard the Going Merry, Luffy and his crew, starved and reckless, are robbed of their treasure. In an attempt to get it back, they wreck the getaway ship, guided by a young boy named Tabio, who's a captured part of El Drago's pirate crew. El Drago's love for gold has driven him to look for Woonan's island, and thanks to Woonan's treasure map, he finds it. During this time, Luffy's crew have been split up, and despite their own circumstances, they must find a way to stop El Drago from obtaining Woonan's gold. \n\nMovie 2 (2001) Relaxing on a cozy beach, the Straw Hat Pirates are taking a rest from their quest. Right until Luffy noticed the Going Merry has been hijacked and sailed off from the beach. This leads them to search the ship and find the thief who took it from them. They ran into a duo named the Theif Brothers, who informed them that their ship was stolen by a group of pirates called the Trump Kyoudai. When they encountered the Trump Pirates, Nami ended up getting kidnapped as well as Luffy's hat. They tracked down the pirates to their base on Clockwork Island. Now Luffy, Zoro, Sanji, Usopp, and the Theif Brothers must reclaim the Going Merry, Save Nami, and get back Shank's straw hat.\n\nMovie 3 (2002) As the Straw Hat Pirates sail through the Grand Line. Chopper has been teased by Usopp about him not being brave enough to face dangers like a real pirate. They spot an upcoming island, and according to Nami's map reading. The island is called Crown Island, which is said to hold a crown treasure. A line of geysers erupted from under the Going Merry. And the whole crew find themselves flying over the island. Unfortunatly, Chopper fell off the ship and was separated from his friends. Luffy and the others landed on the other side of the island and were greeted by an elderly parrot, who tells them that Crown Island is home to many bizarre talking animals. Chopper meanwhile finds himself being worshiped as the island's new king by the animals. According to Momambi(a jungle boy) a new king appears from the heavens when the old one pasts away. Momambi was over joy to have someone like Chopper to be their new king...\n\n.: Trama :.\n\nMovie 1 (2000) Un tempo, nel mare orientale, navigava un uomo conosciuto come il grande pirata dell'oro; il suo nome era Woonan. CompÃƒÂ¬ innumerevoli arrembaggi, nel corso dei quali sottrasse tesori a malvagi e disonesti. La leggenda dice che l'oro accumulato sui ponti delle sue navi splendesse nel buio della notte illuminando le acque circostanti come se fosse giorno. Sono ormai parecchi anni he di Woonan non si hanno piÃƒÂ¹ notizie, sembra svanito nel nulla. Circolano voci, perÃƒÂ², che sostengono che il grande pirata abbia nascosto tutti i suoi tesori su una piccola isola, dove in seguito morÃƒÂ¬. Di conseguenza, svariate ciurme di pirati si sono messe alla ricerca dell'isola sperduta. Ma per raggiungerla serve una mappa che pare sia stata disegnata da Woonan in persona; chi riuscirÃƒÂ  ad entrarne in possesso, potrÃƒÂ  raggiungere l'isola leggendaria dove sono sepolte eccezionali quantitÃƒÂ  di oro.\n\nMovie 2 (2001) Mentre Rubber e la sua ciurma si rilassano su una spiaggia, qualcuno ruba la loro nave. I nostri amici trovano un'imbarcazione di fortuna e si mettono a cercare, ma vengono intrappolati da un uomo, Bolodo, e da un bambino, Akisu, due pirati che dicono di volerli rapinare e dichiarano di essere fratelli. I nostri fraternizzano con i due, che dicono di aver visto la Going Merry in mano ai terribili pirati dei fratelli Trump, che in quel momento arrivano di sorpresa e rapiscono Nami. Il loro covo ÃƒÂ¨ situato sull'Isola Spirale. Per combinazione anche i due fratelli sono diretti lÃƒÂ¬, dove intendono rubare un prezioso orologio tempestato di diamanti. L'isola ÃƒÂ¨ molto particolare, ÃƒÂ¨ costruita come l'ingranaggio di un orologio, ed ÃƒÂ¨ sorretta da una vite interna, rivestita da una scalinata a chiocciola, che la rende inespugnabile. L'isola ÃƒÂ¨ governata con la forza dai fratelli Trump, che hanno instaurato un regime del terrore, costringendo gli abitanti a costruire armi e, in particolare, un potentissimo &quot;Cannone Reale&quot;, che permetterÃƒÂ  al comandante, Bear King, di dominare in tutti gli oceani.\n\nMovie 3 (2002) Ruffy e co. s'imbattono per caso su un'isola nascosta dalle nubi.Questo non fa altro che eccitare la ciurma per la ricerca di un'eventuale tesoro nascosto. Tuttavia, invece di cercare per il tesoro,la ciurma finisce per cercare Chopper! E a proposito di caccia, perchÃƒÂ¨ ci sono 3 tipi strani che sono alla ricerca di animali con le corna? Un'avventura piena d'azione li attende ed il segreto del tesoro dell'isola verra' scoperto. Invece del re dei pirati, che cosa direste di diventare il re degli animali? \n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img339.imageshack.us/img339/5793/1234567890987.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img339.imageshack.us/img339/5793/1234567890987.jpg&lt;/a&gt;\n\n0=============================0\n\n.: Info Ripping :.\n\nMovie 1\n\nDimensione: 838 MB\nDurata: 00:50:59\n\nVideo Codec: Xvid 1.0.2\nVideo Bitrate: 1995 kb/s\nRisoluzione: 720 x 400\nFPS (Frames/sec): 23.976\nQF (Frame quality): 0.289 bits/pixel\n\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: ITA 48000Hz 160 kb/s tot , Joint Stereo\nJAP 48000Hz 128 kb/s tot , Joint Stereo \n\nMovie 2\n\nDimensione: 902 MB\nDurata: 00:55:06\n\nVideo Codec: Xvid 1.1.0 final\nVideo Bitrate: 1987 kb/s\nRisoluzione: 700 x 400\nFPS (Frames/sec): 23.976\nQF (Frame quality): 0.288 bits/pixel\n\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: ITA 48000Hz 160 kb/s tot , Stereo\nJAP 48000Hz 128 kb/s tot , Joint Stereo \n\nMovie 3\n\nDimensione: 832 MB\nDurata: 00:55:36\n\nVideo Codec: Xvid 1.0.3\nVideo Bitrate: 1792 kb/s\nRisoluzione: 700 x 400\nFPS (Frames/sec): 23.976\nQF (Frame quality): 0.260 bits/pixel\n\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: ITA 48000Hz 160 kb/s tot , Stereo\nJAP 48000Hz 128 kb/s tot , Joint Stereo","torrent":{"xt":"urn:btih:c315d324b94008d8771549462ec6627742673c75","amp;dn":"One+Piece+-+Movie+Pack+%281-2-3%29+%5BDVDrip+ITA+JAP%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c315d324b94008d8771549462ec6627742673c75","infoHashBuffer":{"type":"Buffer","data":[195,21,211,36,185,64,8,216,119,21,73,70,46,198,98,119,66,103,60,117]},"announce":[],"urlList":[]}}