{"title":"APOLLO 18 RMVB CAM GLOBE","uid":6682366,"size":195691057,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c6987536dc47461cc73082499a0f9fd362f26deb&amp;dn=APOLLO+18+RMVB+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1316252148,"description":"* RMVB CAM  * 01H14M21S \n\n\n* Worked with the Dub plugins :\n===============================\n \n- Black borders at the top and the bottom of the screen corrected to a perfect widescreen\n\n- Colours improved\n\n- Picture background particles reduced to the minimum\n\n\n* Plot :\n========\n \nIn December, 1974, the crew of the previously-cancelled Apollo 18 mission is informed that the mission is a go, though it has now been deemed a top secret Department of Defense mission. Commander Nathan Walker, Lieutenant Colonel John Grey and Captain Benjamin Anderson are launched towards the Moon to place detectors to alert the United States of any impending ICBM attacks from the USSR.\n \nGrey remains in orbit aboard the Freedom while Walker and Anderson land on the moon in the lunar module Liberty. While planting one of the detectors, the pair take samples of moon rocks. While attempting to sleep, the pair hear noises outside and a camera captures a small rock moving nearby. Houston claims the noises are interference from the ICBM detectors. Anderson finds a rock sample on the floor of Liberty despite having secured the samples. During further exploration they discover footprints that lead them to a Soviet LK lander nearby, finding it functional but blood-stained. Anderson follows tracks leading into a dark crater and finds a dead cosmonaut. Walker queries Houston about the Soviet presence but is told only to continue with the mission.\n \nThe following day the pair find that the flag they had planted is missing. Their mission complete, the crew prepares to leave the Moon but the launch is aborted when Liberty suffers violent shaking. An inspection reveals extensive damage to Liberty and non-human tracks that Walker cites as evidence of extraterrestrial life. Walker feels something moving inside his spacesuit and helmet and is horrified as a spider-like creature crawls across the inside of his helmet. Walker disappears from view and Anderson finds him unconscious outside of Liberty. Walker later denies the events. A wound is discovered on Walker\\'s chest; Anderson feels, and removes, a Moon rock embedded within him. The pair find themselves unable to contact Houston or Grey due to increased levels of interference from an unknown source.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n* GLOBE FILES 2011\n \n","torrent":{"xt":"urn:btih:c6987536dc47461cc73082499a0f9fd362f26deb","amp;dn":"APOLLO+18+RMVB+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6987536dc47461cc73082499a0f9fd362f26deb","infoHashBuffer":{"type":"Buffer","data":[198,152,117,54,220,71,70,28,199,48,130,73,154,15,159,211,98,242,109,235]},"announce":[],"urlList":[]}}