{"title":"Hitler The Rise Of Evil 2003 NL.ISO","uid":6676344,"size":4682228641,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c80d1028d3973952eb4bb4c7c8651d1f5638a684&amp;dn=Hitler+The+Rise+Of+Evil+2003+NL.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JuuLeo65","files":3,"time":1316041542,"description":"Cast\n\n    Robert Carlyle als Adolf Hitler\n    Stockard Channing als Klara Hitler\n    Jena Malone als Geli Raubal\n    Julianna Margulies als Helene Hanfstaengl\n    Matthew Modine als Fritz Gerlich\n    Liev Schreiber als Ernst Hanfstaengl\n    Peter Stormare als Ernst RÃƒÂ¶hm\n    Friedrich von Thun als Erich Ludendorff\n    Peter O\\'Toole als Paul von Hindenburg\n    Zoe Telford als Eva Braun\n    Terence Harvey als Gustav von Kahr\n    Justin Salinger als Dr. Joseph Goebbels\n    Chris Larkin als Hermann GÃƒÂ¶ring\n    James Babsen als Rudolf Hess\n    Patricia Netzer als Sophie Gerlich\n    Harvey Friedman als Friedrich Hollaender\n    Nicole Marischka als Blandine Ebinger\n    Julie-Ann Hassett als Angela Hitler\n    Thomas Sangster als Hitler als tienjarige\n    Simon Sullivan als Hitler als zeventienjarige\n    Robert Glenister als Anton Drexler\n    Ian Hogg als Alois Hitler sr.\n\nHet plot\nLeeswaarschuwing: Onderstaande tekst bevat details van de plot en/of de afloop van het verhaal.\n\nHet verhaal beschrijft de opkomst van Hitler vanaf zijn vroege jeugd tot zijn benoeming tot rijkspresident in 1934, na de dood van Hindenburg.\n\nHitlers jeugd wordt beschreven met daarin de gebeurtenissen die de meeste invloed op zijn leven hadden: de dood van zijn beide ouders en de afwijzing voor de kunstacademie. In de Eerste Wereldoorlog wordt Hitlers antisemitisme veroorzaakt door een joodse officier die terugkomt op zijn woord Hitler een onderscheiding te geven.\n\nNa de oorlog sluit Hitler zich aan bij de DAP, de toekomstige NSDAP, en wordt hier al snel een sleutelfiguur. Hij ontdekt zijn talent voor het voeren van redevoeringen. Ook leert Hitler Hanfstaengl kennen, en koestert romantische gevoelens voor diens vrouw, Helene. Ook Hitlers vriendschap met RÃƒÂ¶hm wordt beschreven, en zijn relatie tot Geli Raubal en diens mysterieuze dood.\n\nFritz Gerlich komt als journalist al snel in de hoedanigheid van zijn journalistieke werk bij de MÃƒÂ¼nchner Neueste Nachrichten in aanraking met Hitler. Aanvankelijk is hij geÃƒÂ¯nteresseerd, maar al snel ziet hij de ware dreiging van de NSDAP en keert zich tegen deze partij. Hij houdt Hitler de jaren daarna scherp in het oog en ontpopt zich tot een van zijn belangrijkste tegenstanders.\n\nUiteindelijk breekt Hitler electoraal door in 1929, en in 1933 wordt hij tot rijkskanselier benoemd. Gerlich wordt gearresteerd en voor altijd het zwijgen opgelegd. In de Nacht van de Lange Messen rekent Hitler met RÃƒÂ¶hm af, en laat Gerlich vermoorden. Zijn vrouw ontvangt slechts diens bril terug.\n\nDe film eindigt met de benoeming van Hitler tot rijkspresident van Duitsland, omringd door een Sieg Heil schreeuwende menigte.\n[bewerken] Historische onjuistheden\n\nIan Kershaw adviseerde aanvankelijk de filmmakers. Hij heeft zich echter uit het project teruggetrokken vanwege een aantal in de film vertoonde onjuistheden over Hitlers leven:\n\n    Alois Hitler overlijdt in de film thuis onder de ogen van de jonge Adolf. Dit is onjuist, daar hij in Gasthaus Stiefler overleed.\n    De arts van Hitlers moeder, Dr. Bloch, wordt als een stereotype Jood afgebeeld. Bloch was echter volledig geassimileerd.\n    Hitlers antisemitisme zou na een incident in de Eerste Wereldoorlog zijn ontstaan. In werkelijkheid was zijn antisemitisme vermoedelijk in zijn jaren in Wenen gedurende langere tijd zijn ontstaan.\n    In de film slaat Hitler zijn hondje Foxl. Er is geen bewijs dat hij ooit zijn hond geslagen zou hebben. Sterker nog, hij zorgde later voor dierenbeschermingswetten en toonde tegenover dieren vaak meer genegenheid dan hij tegenover mensen deed.\n    Een aantal militairen, waaronder Ludendorff, draagt onderscheidingen die ze in werkelijkheid niet gehad hebben. Ook wordt de reden waarom Hitler het IJzeren Kruis ontving gebagatelliseerd.\n    In de film komt Hitler aan in MÃƒÂ¼nchen en neemt direct deel aan de oorlogsbetoging aldaar op 1 augustus 1914. In werkelijkheid woonde hij al meer dan een jaar in MÃƒÂ¼nchen.\n    Hitler gaf aan dat hij niet dronk. Hoewel hij weinig dronk dronk hij wel degelijk bier en soms ook wijn (met een schepje suiker erin omdat het anders te bitter voor hem was).\n    Hitler kust zijn nichtje Geli Raubal op de mond terwijl zij dit niet wil. Er bestaat geen bewijs dat hij dit ooit deed of dat de relatie ooit seksueel werd, hoewel velen dit wel vermoedden.\n    Tijdens de Bierhalleputsch loopt Hitler makkelijk naar het podium. In werkelijkheid was de zaal zo vol dat de nazi\\'s zich door de mensen heen moesten banen.\n    De rollen van een aantal personen in de nazipartij zijn gebagatelliseerd of deze personen ontbreken geheel, terwijl deze personen een significante invloed op en in Hitlers leven hadden. Het gaat hier onder andere om GÃƒÂ¶ring, Goebbels en Schleicher, terwijl Himmler, de gebroeders Gregor en Otto Strasser en Eckart zelfs geheel ontbreken. Anderzijds zou de rol van Hanfstaengl zijn overdreven.\n","torrent":{"xt":"urn:btih:c80d1028d3973952eb4bb4c7c8651d1f5638a684","amp;dn":"Hitler+The+Rise+Of+Evil+2003+NL.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c80d1028d3973952eb4bb4c7c8651d1f5638a684","infoHashBuffer":{"type":"Buffer","data":[200,13,16,40,211,151,57,82,235,75,180,199,200,101,29,31,86,56,166,132]},"announce":[],"urlList":[]}}