{"title":"Every PSP Firmware EVER","uid":7235113,"size":1547735359,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:c852ef14c7875eda6ed1437cdb46fe4310100eb7&amp;dn=Every+PSP+Firmware+EVER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"odoroubo","files":63,"time":1335966564,"description":"Every PSP Firmware from 1.50 to 6.60 (The last there will ever be) These can be a pain to find online with Sony cracking down, so here is a torrent with all of them. Download them all, or just the one you need.\n\nFor use with POPSLoader, CFW, Homebrew, Downgrades, or whatever you may think up\nThese are all Official Firmwares, not custom or hacked in any way.\n\nFile naming is the firmware version stripped of the decimal point. PSP GO! firmwares have -GO added. (So the Official 6.20 firmware would be 620.PBP, or 620-GO.PBP for the GO version.)\n\nTo flash an official firmware you either need to be running a lower version or use a downgrader program. Google is your friend if you need to downgrade. (You may need to upgrade to a higher version in order to downgrade certain models/firmwares. Make sure you know what you're doing before starting anything.)\n\nTo upgrade from a lower version to a higher one:\n1. You need a Memory Stick Duo or Pro Duo that works with your PSP\n2. Either connect the PSP to your PC via USB cable, or use a card reader with the Memory Stick\n3. Starting at the root folder of your memory stick, create the following folder if it does not already exist: PSPGAMEUPDATE\n4. Copy the .PBP of the firmware you want to update to into the UPDATE folder on the Memory Stick\n5. Rename the .PBP file to EBOOT.PBP\n6. Exit the USB connect mode or insert the Memory Stick into your PSP\n7. Navigate to the Game menu on your PSP and look under the Memory Stick item. If you followed this correctly there should be an item under Memory Stick for the firmware upgrade you chose. If not, check everything and start over.\n8. Start the update and follow the on-screen instructions.\n\nI assume absolutely no responsibility in the (highly unlikely) event that you turn your PSP into a doorstop.","torrent":{"xt":"urn:btih:c852ef14c7875eda6ed1437cdb46fe4310100eb7","amp;dn":"Every+PSP+Firmware+EVER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c852ef14c7875eda6ed1437cdb46fe4310100eb7","infoHashBuffer":{"type":"Buffer","data":[200,82,239,20,199,135,94,218,110,209,67,124,219,70,254,67,16,16,14,183]},"announce":[],"urlList":[]}}