{"title":"DVDFab Platinum v8.1.2.0 Qt Final + Patch","uid":6679498,"size":27804473,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cac27fd05edfa35d62a7a1a3f5415d5f1f05edd9&amp;dn=DVDFab+Platinum+v8.1.2.0+Qt+Final+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Slickinator","files":2,"time":1316148268,"description":"DVDFab Platinum v8.1.2.0 Qt Final\n\nThis is a AIO = all in one program double click exe and use clickable buttons.\n\n[img]http://www.dvdfab.com/images/logo.png[/img]\n\nWhat's New:\nDVDFab 8.1.2.0 Qt is out (September 15, 2011):\n\nNew: Updated language files.\nNew: Added &quot;3D Device&quot; in &quot;DVD Ripper&quot;, &quot;Blu-ray Ripper&quot;, &quot;Blu-ray 3D Ripper&quot; and &quot;Video Converter&quot; options.\nNew: Added support for new glasses-free 3D phones from Sharp, HTC and LG.\nNew: Added interleaved SBS 3D output, which can be used on iPhone4.\nNew: Added two streams in one file 3D output, which can be used on Fujifilm FinePix REAL 3D V1.\nNew: Brand new internal preview engine.\nNew: Some minor changes and improvements.\nFix: A crash problem when changing source in &quot;Settings -&gt; Info&quot; window.\n\nDVD Copy:\n\nNew: Added support for a new copy protection as found on &quot;Thor&quot; (US). Please note: HD Decryter doesn't support it for now.\nFix: The interface layout was wrong for &quot;DVD Copy - Split&quot;.\n\nDVD Ripper:\n\nNew: The default profile for AVI was changed to 2GB+ which allows output file to be larger than 2GB.\nFix: A video jerky problem when copying DVD to PS3/iPod/iPhone/iPad with CUDA encoder.\n\nBlu-ray Copy:\n\nInfo: AACS MKB v26 is out, and it's already supported by old version of DVDFab.\nFix: &quot;Convert LPCM/DTS audio to AC3&quot; was always enabled for BD9/BD5 output.\nFix: A freeze problem at end of conversion when &quot;Convert LPCM/DTS audio to AC3&quot; option is enabled.\nFix: A freeze problem when opening disc with DTS-HD audio (7.1 channels) in certain cases.\nFix: A freeze problem when copying Blu-ray with VC-1 video in certain cases.\nFix: A freeze problem when copying Blu-ray to BD9/BD5 when subpicture is selected in certain cases.\n\nBlu-ray Ripper:\n\nNew: The default profile for AVI was changed to 2GB+ which allows output file to be larger than 2GB.\nFix: A no sound problem in output for m2ts.passthrough profile.\nFix: Shock-wave noise in output when selecting the second DTS-HD Master Audio track.\n\nVideo Converter:\n\nNew: The default profile for AVI was changed to 2GB+ which allows output file to be larger than 2GB.\n\n2D to 3D Converter:\n\nNew: Improved speed of new 2D to 3D engine, and it's the default engine now.\nNew: Improved the engine to remove most jitters.\nNew: Adjust Gain automatically according to the source.\n\n\nFeatures:\n\nDVD Copy v8.1.2.0 aka DVD to DVD\nDVDFab DVD Copy is popular worldwide and known for its power and flexibility. You can copy a DVD with just a click or two, or use DVD Copy's many settings to customize the ouput. Burn it to a blank DVD or write the output to a folder or image file on your hard drive or media server, compress content to fit on smaller discs, the choice is yours!\n\nBlu-ray Copy v8.1.2.0 aka Blu-ray to Blu-ray\nDVDFab Blu-ray Copy leads the industry in features and options. Remove all known Blu-ray protections, with lightning fast protection updates from our 24/7 server. Copy Blu-ray to blank discs or your PC hard drive, compress them to fit on BD-25 media or even DVD9 or DVD5 discs, all in high definition!\n\nBlu-ray 3D Ripper\nv8.1.2.0\nThe first Blu-ray 3D to 3D video ripping software in the world, rips any Blu-ray 3D to AVI, MP4, WMV, and MKV 3D video for playback on 3D display devices. Side-by-side 3D format supported. The 3D type can be left/right or top/bottom. And the video frame size can be full (100%) or half (50%). Just like all DVDFab products, Blu-ray 3D Ripper is also superior in speed and quality, and very easy to use.\n\nBlu-ray to DVD Converter\nv8.1.2.0\nDVDFab Blu-ray to DVD Converter, the first full-featured and the most powerful Blu-ray to DVD converter in the world, can convert any Blu-ray to DVD-Video disc independently for playback on DVD player or DVD player software, offers people total freedom from Blu-ray to DVD, with super fast speed, great output quality, helpful editing functions, and many other neat features.\n\nVideo Converter v8.1.2.0\naka File to Mobile\nThis handy option allows you to convert quickly between many popular video/audio file formats such as AVI, MP4, MKV, FLV and many more for use on many mobile/portable devices as well as advanced consoles and media players. It has the power and flexibility to produce the output that you need.\n\nwebsite: http://www.dvdfab.com/\n\nInstallation Info:\n1)install the dvdfab setup and don't launch\n2)open crack folder and right click on the msvcr90.dll and copy\n3)go to the install folder \nC:\\Program Files\\DVDFab 8 QT   and or C:\\Program Files(x86)\\DVDFab 8 QT\nand right click and paste the file and Copy over other msvcr90.dll or do the patch same spot\n4)start DVDfab program and close welcome screen\nand click on the green check mark at the top\nand on the top left of the settings window click on general\nand in the middle bottom area UNcheck check for new version automaticly click ok\nAnd never update as u will lose your registration\n5)enjoy from Slickinator\n\n\n","torrent":{"xt":"urn:btih:cac27fd05edfa35d62a7a1a3f5415d5f1f05edd9","amp;dn":"DVDFab+Platinum+v8.1.2.0+Qt+Final+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac27fd05edfa35d62a7a1a3f5415d5f1f05edd9","infoHashBuffer":{"type":"Buffer","data":[202,194,127,208,94,223,163,93,98,167,161,163,245,65,93,95,31,5,237,217]},"announce":[],"urlList":[]}}