{"title":"Games of Thrones and Philosophy","uid":7319414,"size":3658167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cafd00264f1f93d0950a28314a2bf9ccaf7ffb55&amp;dn=Games+of+Thrones+and+Philosophy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"amarkhan123456","files":1,"time":1338580896,"description":"An in-depth look at the philosophical issues behind HBO's Game of\nThrones television series and the books that inspired it\n\n\nGeorge R.R. Martin's New York Times bestselling epic fantasy book\nseries, A Song of Ice and Fire, and the HBO television show\nadapted from it, have earned critical acclaim and inspired\nfanatic devotion. This book delves into the many philosophical\nquestions that arise in this complex, character-driven series,\n\nincluding: Is it right for a &quot;good&quot; king to usurp the throne of a\none and murder his family? How far should you go to protect\nyour family and its secrets? In a fantasy universe with medieval\nmores and ethics, can female characters reflect modern feminist\nideals?\n\nTimed for the premiere of the second season of the HBO Game of\nThrones series Gives new perspectives on the characters,\nstorylines, and themes of Game of Thrones Draws on great\nphilosophers from ancient Greece to modern America to explore\nintriguing topics such as the strange creatures of Westeros, the\nincestuous relationship of Jaime and Cersei Lannister, and what\nthe kings of Westeros can show us about virtue and honor (or the\nlack thereof) as they play their game of thrones\n\nEssential reading for fans, Game of Thrones and Philosophy will\nenrich your experience of your favorite medieval fantasy series.\n\nEditor - Henry Jacoby\n\nSeries Editor - William Irwin\n\nPublisher - Wiley; 1 edition\n\nPublished - March 13, 2012","torrent":{"xt":"urn:btih:cafd00264f1f93d0950a28314a2bf9ccaf7ffb55","amp;dn":"Games+of+Thrones+and+Philosophy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cafd00264f1f93d0950a28314a2bf9ccaf7ffb55","infoHashBuffer":{"type":"Buffer","data":[202,253,0,38,79,31,147,208,149,10,40,49,74,43,249,204,175,127,251,85]},"announce":[],"urlList":[]}}