{"title":"Real Hide IP v4.1.4.2 + Crk","uid":6554966,"size":14342846,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cafe8770b1f91f79fba683f2925e5478d62b14b1&amp;dn=Real+Hide+IP+v4.1.4.2+%2B+Crk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Slickinator","files":2,"time":1311254435,"description":"Real Hide IP v 4.1.4.2\n\n[img]http://www.real-hide-ip.com/images/stories/app/product1/box/box250g.jpg[/img]\n\nUse Real Hide IP to surf anonymously, prevent hackers from monitoring your online activities or identity thieves from stealing your identity and other personal information, send anonymous email, and un-ban yourself from forums or restricted websites.\n\nAnonymous Surfing with Real Hide IP\n\nProtect your privacy on the Internet. With Real Hide IP, you can conceal your real IP address, surf anonymously, send anonymous emails through any web based mail system, un-ban yourself from forums or restricted websites, keeping your personal information safe from hackers and identity thieves.\n\nReal Hide IP enables you to be assigned one of our fake IP addresses which can be from different countries such as United States, United Kingdom, France, etc. It works with Internet Explorer, Firefox, Opera, Maxthon, MyIE and is compatible with all types of routers, firewalls, home networks, wireless networks and any other kind of Internet.\nKey Features\n\n    * Hide Your Real IP Address\n      Be assigned fake IP addresses from different countries to conceal your real IP.\n    * Anonymous Web Surfing\n      Surf anonymously with fake IP, whenever you want to.\n    * Protect Your Identity Against Hackers\n      Protect you from hackers and identity thieves who will be tricked by your fake IP.\n    * Un-ban Yourself from Forums or Restricted Websites\n      Real Hide IP allows you to access any forums, blogs or websites that have ever banned you.\n    * Prevent Websites from Tracking Your Online Activities\n      Hide your real IP when you are surfing the Internet to prevent you from being tracked by websites.\n\n\nWebsite:  &lt;a href=&quot; http://www.real-hide-ip.com/products/real-hide-ip.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.real-hide-ip.com/products/real-hide-ip.html&lt;/a&gt;\n\nPlatform: Windows 2000/XP/Vista/7 (32-bit and 64-bit)\n\n\nInstallation Info:\n1)Run setup  (DON'T start uncheck the run program) and also UNcheck all the Ask tool bar crap as u install\n2)copy and paste the cracked exe file in the installed directory and copy over other one\nC:\\Program Files\\RealHideIP  or   C:\\Program Files(x86)\\RealHideIP\ndepends on which windows installed\n3) start program and NEVER update and click on Settings \nand UNcheck automatic updates and click ok\n4)Enjoy from Slickinator\n\n\n\n","torrent":{"xt":"urn:btih:cafe8770b1f91f79fba683f2925e5478d62b14b1","amp;dn":"Real+Hide+IP+v4.1.4.2+%2B+Crk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cafe8770b1f91f79fba683f2925e5478d62b14b1","infoHashBuffer":{"type":"Buffer","data":[202,254,135,112,177,249,31,121,251,166,131,242,146,94,84,120,214,43,20,177]},"announce":[],"urlList":[]}}