{"title":"XYplorer 11.40.0000 Final + Keygen-CRD","uid":7387345,"size":2970799,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cda017ae43248d9be9836f0229eb42a86906425d&amp;dn=XYplorer+11.40.0000+Final+%2B+Keygen-CRD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mrriser007","files":-1,"time":1340670037,"description":"XYplorer is a multi-tabbed file manager for Windows 98/NT/ME/2000/XP/Vista, featuring a very powerful file search, versatile preview facilities, a highly customizable interface, and a large array of unique ways to efficiently automate frequently recurring tasks. It's extremely fast and light, it's innovative, and it's fun! XYplorer (formerly known as TrackerV3) is a hybrid file manager that combines features found in navigational and orthodox file managers. Instead of dual folder panes, it features a file tree and a tabbed interface for folders that supports drag-and-drop between tabs.\n\nA central feature is the hideable information panel at the bottom that can be used to view file properties and contents, generate reports, preview files (PNG, TIF, GIF, JPG, TGA, PSD, ICO; WAV, MP3, MPEG, AVI; TTF, PFB; HTML, EML, MSG, DOC, XLS, PDF, and many other formats) and find files. The search facility supports Boolean logic, Regular Expressions, whole word and fuzzy matching, binary string search, and multiple location search. Some unique features are the Catalog, (which is a user created panel of links to files, folders, URLs, and similar entries), Scripting (which allows user to create stored sets of commands, similar to a macro), and UDC (User Defined Commands) (which allow user to create a limited set of customized commands).","torrent":{"xt":"urn:btih:cda017ae43248d9be9836f0229eb42a86906425d","amp;dn":"XYplorer+11.40.0000+Final+%2B+Keygen-CRD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cda017ae43248d9be9836f0229eb42a86906425d","infoHashBuffer":{"type":"Buffer","data":[205,160,23,174,67,36,141,155,233,131,111,2,41,235,66,168,105,6,66,93]},"announce":[],"urlList":[]}}