{"title":"WarGames: WOPR Android","uid":7388522,"size":14137414,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:cf3e59d1e30a6848664c67ff65834c9372d8dcd8&amp;dn=WarGames%3A+WOPR+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cad40","files":1,"time":1340711450,"description":"Shall We Play A Game?\nThis is THE officially licensed WarGames mobile game!\nStep into the role of the iconic WOPR computer as you wage intense battles of Global Thermonuclear War against characters from the movie. Take on David Lightman (played by Matthew Broderick), Jennifer Mack (played by Ally Sheedy), McKittrick (played by Dabney Coleman), and others.\nFeatures: \n-Compelling storyline \n-40+ levels \n-24 Tactics and Mods to make your character more powerful, each with 6 upgradable levels\nGameplay: \nThere are four tile types on the board at any given time. Drag your finger over as many similar tiles to create as long of a chain as possible. The longer the chain the bigger the bonus you'll get or more damage you'll deal to your opponent.\nTile Types: \nNuke - Damage your opponent \nHealth - Heal yourself \nMoney - Gain money to deploy tactics against your enemy \nRadar - Fills up your bonus meter. Once the meter's reaches 100% you get to choose an instant PowerUp\nEnemy Tiles: \nYour opponents will deploy tiles onto the board in an attempt to damage you and heal themselves. Match enemy tiles with regular tiles of the same type to damage and eventually destroy them. Enemy tiles are denoted by a pulsing crosshair.\nTactics: \nTactics are instant-use items deployable during battle. They do anything from dealing direct damage to your opponent, destroying enemy tiles, or nuking the whole board. They cost money to use (gain money by clearing money tiles). There are 12 unique tactics, each of which has 6 upgradable levels.\nMods: \nMods give passive bonuses and are always active during battle. Their powers range from increasing the amount of money gained each turn, adding to the value of a completed chain, or giving insane bonuses for completing long chains. There are 12 powerful mods and each one has 6 upgradable levels.\nKeywords:\npuzzle, tile, tiles, match, 3, match-3, strategy, war, games, 80s, license\nStay in the loop! \nWant to hear what's next from Be-Rad? Have a cool feature you want added? Keep in touch: \nBe-Rad's Facebook page:\nBe-Rad's Twitter:\nThe official WarGames movie Facebook page:\nWARGAMES TM and Â© 1983 METRO-GOLDWYN-MAYER STUDIOS INC. ALL RIGHTS RESERVED.","torrent":{"xt":"urn:btih:cf3e59d1e30a6848664c67ff65834c9372d8dcd8","amp;dn":"WarGames%3A+WOPR+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf3e59d1e30a6848664c67ff65834c9372d8dcd8","infoHashBuffer":{"type":"Buffer","data":[207,62,89,209,227,10,104,72,102,76,103,255,101,131,76,147,114,216,220,216]},"announce":[],"urlList":[]}}