{"title":"BorderLands Game Of The Year EDITION","uid":7269594,"size":9620598220,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:d1ef7aa1cf0c582b3266a4741ea61702907a8fb9&amp;dn=BorderLands+Game+Of+The+Year+EDITION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"sammetje12","files":-1,"time":1337009934,"description":"Borderlands is a first-person shooter that includes character-building elements found in role playing games, leading to Gearbox calling the game a &quot;role-playing shooter&quot;. At the start of the game, players select one of four characters, each with a unique special skill and with proficiencies with certain weapons. The four characters are: Soldier, Hunter, Siren, and Beserker.[4] From then on, players take on quests assigned through non-player characters or from bounty boards, each typically rewarding the player with experience points and a reward item.[4] Players also earn experience by killing foes and completing in-game challenges (such as getting a certain number of kills using a specific type of weapon). As they gain levels from experience growth, players can then allocate skill points into a skill tree that features three distinct specializations of the base character; for example, a Hunter can become specialized in sniping, melee combat, or scavenging. Players can distribute points among any of the specializations, and can also spend a small amount of in-game money to redistribute their skill points.\n\nJust Intel processors\n1GB system RAM\nNVIDIA Geforce 8600 GS\nATI Radeon X850 Series\n8 GB of hard disk space\n\nUnzip The File Then Click BorderLands GOTY.dmg\nThen Just Drag The Borderlands Folder Into the applications folder !\nafter that unzip the crack and replace it with the old one! \nStart The game and when a screen pops up just click Play! on the right \nYou dont have to enter the key!\n\nGood Luck !\n","torrent":{"xt":"urn:btih:d1ef7aa1cf0c582b3266a4741ea61702907a8fb9","amp;dn":"BorderLands+Game+Of+The+Year+EDITION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ef7aa1cf0c582b3266a4741ea61702907a8fb9","infoHashBuffer":{"type":"Buffer","data":[209,239,122,161,207,12,88,43,50,102,164,116,30,166,23,2,144,122,143,185]},"announce":[],"urlList":[]}}