{"title":"New Warriors v4 update","uid":7320329,"size":162220491,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d44010a18669e2d49fd26913d324bab07e6dd41f&amp;dn=New+Warriors+v4+update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SmokeBogey","files":-1,"time":1338599466,"description":"The New Warriors was originally compiled by writer/editor Tom DeFalco, consisting of the young superheroes Nova, Speedball, Namorita, Marvel Boy, and Firestar, all of whom were once featured in solo series or were supporting characters in more established series. To this mix DeFalco added Night Thrasher, an original character to serve as the team's founder and leader.   The first volume was cancelled after 75 issues.  The second volume relaunch lasted only 11 issues.  The third volume was a six issue miniseries that led to the Marvel Civil War.\n\nThe fourth volume of the New Warriors is one of the new team books debuting out of Civil War.  The new team has one returning member from the original group, (Night Thrasher), while everyone else is new to the team.\n\nThe series is written by Kevin Grevioux, writer of the film Underworld, with Paco Medina as the artist. The series made its debut in June 2007. Editor Axel Alonso has further mentioned that the team will be made up of &quot;superheroes you already know, sporting new superhero identities&quot;.\n\n \nDidn't notice when I was reviving these torrents that v4 was incomplete.   Here's the rest of the volume.","torrent":{"xt":"urn:btih:d44010a18669e2d49fd26913d324bab07e6dd41f","amp;dn":"New+Warriors+v4+update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d44010a18669e2d49fd26913d324bab07e6dd41f","infoHashBuffer":{"type":"Buffer","data":[212,64,16,161,134,105,226,212,159,210,105,19,211,36,186,176,126,109,212,31]},"announce":[],"urlList":[]}}