{"title":"EVA - Virtual Assistant- v2.14 [EDGE]","uid":7362335,"size":5567454,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:d468637d870823d113008510cf3e9fc02fcddf59&amp;dn=EVA+-+Virtual+Assistant-+v2.14+%5BEDGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Edge316","files":2,"time":1340002952,"description":"EVA - Virtual Assistant- v2.14-\nThe best Voice Assistant for Android, now with extensive Facebook integration.\nEVA is the most full featured virtual assistant for Android.\nWho should use EVA? If you are looking for an application that provides hands-free operation of your phone to open apps, read and reply to text messages and email, schedule calendar events and many more functions that you can perform using just your voice then EVA is right for you. If you are just looking for an electronic friend to chat with then please go with one of the Siri clones. on the other hand if you want a real virtual assistant that has useful functions that will make your life easier then please give EVA a try.\nEVA has all the functions you'd expect your assistant to perform plus some that you probably never knew were possible. Here is a list of some of the functions that you wont find in most of the competition:\n\n\nâ˜… Reading and replying to incoming text and email including Microsoft Exchange\n\nâ˜… Integration with Evernote\n\nâ˜… Home Automation with INSTEon. Turn on the lights and appliances, open the garage door and a whole lot more, all with voice commands or scheduled or based on your location.\n\nâ˜… Location based reminders. Remind you to do something based on your location.\n\nâ˜… Location based actions. Perform any function that EVA can do based on your current location. Have EVA automatically text your wife when you leave the office.\n\nâ˜… Time based actions. Perform any function that EVA can do on a set day and\n time\nâ˜… In car mode including wake up phrase\n\nâ˜… Custom voice shortcuts to your phone applications. Give your apps any name you want and open them using that name.\n\nâ˜… Voice bookmarks to your favorite web sites. Give your bookmarks any name you want and open them using that name.\n\nâ˜… Activate just by shaking your phone\n\nâ˜… Works with all Bluetooth Headsets\n\n\nFor the full online manual please go to: &lt;a href=&quot;\nhttp://www.bulletproof.com/eva&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bulletproof.com/eva&lt;/a&gt;","torrent":{"xt":"urn:btih:d468637d870823d113008510cf3e9fc02fcddf59","amp;dn":"EVA+-+Virtual+Assistant-+v2.14+%5BEDGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d468637d870823d113008510cf3e9fc02fcddf59","infoHashBuffer":{"type":"Buffer","data":[212,104,99,125,135,8,35,209,19,0,133,16,207,62,159,192,47,205,223,89]},"announce":[],"urlList":[]}}