{"title":"Master Hacker CORE Publishing","uid":7355367,"size":429671571,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d4ae221c62d72e0f168d20426713312a19396d54&amp;dn=Master+Hacker+CORE+Publishing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"5p1k3_TL","files":-1,"time":1339749458,"description":"Master Hacker:\nInternet &amp; Computer Security Terrorism\nBy CORE Publishing\n\nTEAM LUNA Release 2012\n\nTHIS IS THE CD EVERYONE WANTS! MASTER HACKER\n\nHACKING: Hacking files &amp; tools for Windows &amp; Unix including: Port monitors, port scanners, spoofers, vulnerability scanners, Trojans, firewall attacks, packet grabbers, sniffers, flooders, e-mail tracing info, key loggers, ICQ IP sniffers, ICQ password hackers, packet hijacking, virile and virus source, and much more!\n\nCRACKING: Cracking files &amp; tools: password cracking programs, cracking wordlist dictionaries in over 12 languages, ftp crackers, Windows dial-up crackers, ZIP password crackers, tutorials and how-to on system cracking, plus Bonus Tools &amp; Info on cracking copy protection, and BIOS passwords!\n\nANARCHY: Anarchy and underground info files about; ATM machines, pay phones, cellular networks, lock-picking, magnetic stripe cards, credit cards, pirate radio and television broadcasting, cable TV descrambling, drug &amp; herb subculture, cannons and explosives, revenge ideas, and more subversive info!\n\nCOUNTERMEASURES: Countermeasure files &amp; tools that help protect and thwart attempts by hackers to breach your computer and network security like Trojan Killers, Port Monitors, Nuke Nabbers, and more! Information is power.\n\nNOTICE: This CD-ROM is intended for use by ADULTS and is sold for research and academic purposes only. The primary intent of this CD is to provide hard-to-find research material necessary in studying reverse-engineering techniques used by hackers.\n  \n\nMOUNT &amp; INSTALL\n\nSEED!!!!!!!","torrent":{"xt":"urn:btih:d4ae221c62d72e0f168d20426713312a19396d54","amp;dn":"Master+Hacker+CORE+Publishing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4ae221c62d72e0f168d20426713312a19396d54","infoHashBuffer":{"type":"Buffer","data":[212,174,34,28,98,215,46,15,22,141,32,66,103,19,49,42,25,57,109,84]},"announce":[],"urlList":[]}}