{"title":"MinecraftSP.zip","uid":7270585,"size":111885,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:d4e5e161e8061b90d096a2c14cd52b9bb6e8de45&amp;dn=MinecraftSP.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wereisit","files":1,"time":1337033935,"description":"Minecraft is a sandbox-building independent video game written in Java originally by Swedish creator Markus &quot;Notch&quot; Persson and now by his company, Mojang.\n\nMinecraft is focused on creativity and building, allowing players to build constructions out of textured cubes in a 3D world. Gameplay in its commercial release has two principal modes: Survival, which requires players to acquire resources themselves and maintain their health and hunger; and Creative, where the player has an unlimited supply of resources, the ability to fly, and no concept of health or hunger. A third gameplay mode, named Hardcore, is essentially the same as Survival, but the difficulty is locked on the hardest setting and respawning is disabled, forcing the player to delete his or her world upon death. An outdated Classic version is also available for free, although it is no longer being developed. Creative Minecraft resembles Classic, but with many more features.\n\nThe gameplay is heavily inspired by Infiniminer by Zachtronics Industries, and Dwarf Fortress by Bay 12 Games.\n\nmac version only on windows\n\n","torrent":{"xt":"urn:btih:d4e5e161e8061b90d096a2c14cd52b9bb6e8de45","amp;dn":"MinecraftSP.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4e5e161e8061b90d096a2c14cd52b9bb6e8de45","infoHashBuffer":{"type":"Buffer","data":[212,229,225,97,232,6,27,144,208,150,162,193,76,213,43,155,182,232,222,69]},"announce":[],"urlList":[]}}