{"title":"BlacksOnBlondes.-.Tiffany.Doll","uid":7363400,"size":505334507,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d735f5503b3b893564c1362f7bd6ca421cdae38c&amp;dn=BlacksOnBlondes.-.Tiffany.Doll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"exmnova","files":1,"time":1340031810,"description":"[BlacksOnBlondes./ DogFart.] Tiffany Doll (18.06.2012)\n\n\nThe trials and tribulations of black male talent continue to rear their ugly heads. Wesley Pipes, Rico Strong, Brian Pumper and Sheed are all in the alley and complaining about the woes that come with being talent in an industry that's full of interesting characters. Sheed is new to the game and taking in all their advice when Tiffany Doll enters the picture. Tiffany is from France and can;t find her way around these mean streets. Tiffany Doll learns that Sheed is new to adult video and offers herself up to be his sacrificial lamb. The black thugs get her inside and the interracial gangbang begins! Tiffany Doll slurps and sucks on each big black cock while her busy little hands jerk the others. There's no language barrier here seeing as Tiffany Doll knows her way around big, beefy black cocks. Tiffany Dolls continues to choke on all that ghetto meat until the nerve endings in her ass and pussy signal that it's their turn. The passage to Paris runs through Tiffany's colon and none of the black guys hesitate to ream her backdoor. The Parisian pussy gets its stuffing of black cock as all her holes get filled to capacity. We get to witness this European fuck slut get all the big black cock she can handle , and those ebony Eiffel Towers wreak havoc on her tiny little frame. Tiffany Doll may have been lost earlier BUT she found a way to milk all those black cocks. Viva La France and Viva La black cock sluts.\n\n\nScreens / More Info:\n\n\n &lt;a href=&quot;\nhttp://www.69bits.com/torrent/Interracial/53639/BlacksOnBlondes.-.Tiffany.Doll.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.69bits.com/torrent/Interracial/53639/BlacksOnBlondes.-.Tiffany.Doll.html&lt;/a&gt;","torrent":{"xt":"urn:btih:d735f5503b3b893564c1362f7bd6ca421cdae38c","amp;dn":"BlacksOnBlondes.-.Tiffany.Doll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d735f5503b3b893564c1362f7bd6ca421cdae38c","infoHashBuffer":{"type":"Buffer","data":[215,53,245,80,59,59,137,53,100,193,54,47,123,214,202,66,28,218,227,140]},"announce":[],"urlList":[]}}