{"title":"The Great Raid~XviD~EliteBay~","uid":7319683,"size":1741495715,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d873a964b4041e76ad47474bf15af3eb6a6f878c&amp;dn=The+Great+Raid%7EXviD%7EEliteBay%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EliteBay128","files":-1,"time":1338588164,"description":"John Dahl directed this war drama based on the true story of one of the most daring military actions of World War II. In the waning days of World War II, General Douglas MacArthur chose to make good on a pledge that he made in 1942 -- that he would return to the Philippines after he and his troops were forced to retreat. However, MacArthur's determination was more than a matter of pride. Over 500 American soldiers were being held in Cabanatuan, a notoriously brutal prisoner of war camp in the Philippines operated by the Japanese army, and MacArthur wanted to see to it that they made it home. MacArthur chose Lt. Col. Henry Mucci (Benjamin Bratt) to lead the Sixth Ranger Battalion on a mission 30 miles behind enemy lines to infiltrate Cabanatuan and liberate the American prisoners. With the help of Capt. Prince (James Franco), Mucci leads his men on a life-or-death raid against forces known for their savagery. The Great Raid was based on William B. Breuer's book The Great Raid on Cabanatuan: Rescuing the Doomed Ghosts of Bataan and Corregidor, and also stars Joseph Fiennes, Connie Nielsen, and Marton Csokas. ~ Mark Deming, Rovi","torrent":{"xt":"urn:btih:d873a964b4041e76ad47474bf15af3eb6a6f878c","amp;dn":"The+Great+Raid%7EXviD%7EEliteBay%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d873a964b4041e76ad47474bf15af3eb6a6f878c","infoHashBuffer":{"type":"Buffer","data":[216,115,169,100,180,4,30,118,173,71,71,75,241,90,243,235,106,111,135,140]},"announce":[],"urlList":[]}}