{"title":"Sunny Day Real Estate - 3 Albums [FLAC] politux","uid":6685576,"size":996975462,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da67396add0c21aa98e11a32c08b4be3a14391ea&amp;dn=Sunny+Day+Real+Estate+-+3+Albums+%5BFLAC%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"politux","files":-1,"time":1316389753,"description":"Considering their relatively brief existence, Sunny Day Real Estate racked up enough dramatic twists and turns to rank with some of the great rock soap operas. Its key members have engaged in just about every rock cliche imaginable, including finding religion, refusing to work with the media, breaking up, and joining a big-name group, and even recording an ambitious full-orchestra pop album; all before reuniting in 1997. Although they formed in 1992 amid the burgeoning hard rock scene in Seattle (and later signed to Northwest power label Sub Pop), the group could not have been more different from their flannel-clad contemporaries. Originally conceived as a three-piece (guitarist/vocalist Dan Hoerner, bassist Nate Mendel, and drummer William Goldsmith), Sunny Day Real Estate garnered attention when it added enigmatic lead singer Jeremy Enigk, whose high-pitched, constantly ascending voice complemented their melodic songs. The group was shrouded in mystery from the get-go: they released only one picture to the press; conducted one interview; and, for some still-unknown reason, never played a show in the state of California with all four members. \n \nWith the release of their 1994 debut album, Diary, Sunny Day achieved newfound fame (at one time posing for an ad for department-store chain Nordstrom), while Enigk converted to Christianity. In 1995, the group broke up, but not before releasing that years LP2 (which, because of its single-hue design, is usually referred to as The Pink Album) and prompting speculation as to whether Enigks born-again status was behind the breakup. Goldsmith and Mendel quickly found work with the Foo Fighters, while Hoerner retreated to a farm in Washington. One year after the breakup, Enigk released Return of the Frog Queen, a set of acoustic songs recorded with a 21-piece orchestra. In the meantime, the group maintained a steady fan base on the Internet, and continued to sell copies of their first two albums. \n \nIn 1997, after months of speculation, the group re-formed, minus Mendel (who stayed with the Foo Fighters and was replaced first by former Mommyheads bassist Jeff Palmer, then by ex-Posie Joe Skyward), and in September 1998 returned with How It Feels to Be Something On, which was met with critical accolades from fans and critics, prompting more media attention than ever as well as a new tour. The dates also yielded 1999s Live, which helped whet appetites for the second studio album of the reunion (and the first not recorded for Sub Pop). The Rising Tide was released by Time Bomb in 2000, marked by a gentler tone and a stronger prog rock influence that resulted in some of the best reviews of the bands already acclaimed career. However, external forces conspired against the band; Time Bombs distribution deal with Arista fell through, making promotion and touring all but impossible. Additional difficulties with their management soured sessions for a follow-up, and it was announced in June 2001 that Sunny Day Real Estate had disbanded.\n \nReleased: 1994-2000\nGenre: Rock\nStyle: Alternative\nSource: CD\nCodec: FLAC\nChannels: Stereo\nSample Rate: 44,100 Hz\nBit Rate: ~1,000 kbps\nBits per Sample: 16\nCovers: Front\n \nAlbums:\n \nDiary - 1994\n \n 1. Seven                           \n 2. In Circles\n 3. Song About an Angel\n 4. Round  \n 5. 47     \n 6. The Blankets Were the Stairs \n 7. Pheurton Skeurto      \n 8. Shadows\n 9. 48\n 10. Grendel\n 11 Sometimes\n \nLP2 - 1995\n \n 1. Friday\n 2. Theo B\n 3. Red Elephant \n 4. 5/4\n 5. Waffle\n 6. 8\n 7. Iscarabaid\n 8. JNuh\n 9. Rodeo Jones\n \nThe Rising Tide - 2000\n \n 1. Killed by an Angel\n 2. One\n 3. Rain Song\n 4. Disappear\n 5. Snibe\n 6. The Ocean\n 7. Fool in the Photograph\n 8. Tearing in My Heart\n 9. Television\n 10. Faces in Disguise\n 11. The Rising Tide          \t\n\nMore info: \n &lt;a href=&quot;\nhttp://allmusic.com/artist/sunny-day-real-estate-p44823/discography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/artist/sunny-day-real-estate-p44823/discography&lt;/a&gt;","torrent":{"xt":"urn:btih:da67396add0c21aa98e11a32c08b4be3a14391ea","amp;dn":"Sunny+Day+Real+Estate+-+3+Albums+%5BFLAC%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da67396add0c21aa98e11a32c08b4be3a14391ea","infoHashBuffer":{"type":"Buffer","data":[218,103,57,106,221,12,33,170,152,225,26,50,192,139,75,227,161,67,145,234]},"announce":[],"urlList":[]}}