{"title":"Richard (Dickey) Betts - Highway Call (2001) 320 vtwin88cube","uid":6666940,"size":86657872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da9f02cfcd3b1770b97e45c53f9064011014ffb7&amp;dn=Richard+%28Dickey%29+Betts+-+Highway+Call+%282001%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1315722154,"description":"Richard (Dickey) Betts\nHighway Call (2001)\n\n\n\nDickey Betts joined the Allman Brothers Band as second lead guitarist and singer in the late '60s. In addition to matching bandleader Duane Allman lick for lick, Betts also wrote such memorable songs as &quot;Revival&quot; (number 92, 1971) and the instrumental tour de force &quot;In Memory of Elizabeth Reed.&quot; After Duane Allman was killed in a road accident in 1971, Betts and Allman's brother Gregg shared leadership of the band, with Betts writing and singing the group's biggest hit, &quot;Ramblin' Man&quot; (number two, 1973). Members of the band began solo careers in 1973, and Betts released his first solo album Highway Call, in 1974. The Allmans split up in 1976, and Betts formed Dickey Betts and Great Southern. The Allmans reformed in 1978, with Betts contributing &quot;Crazy Love&quot; (number 29, 1979), &quot;Angeline&quot; (number 58, 1980), and &quot;Straight From the Heart&quot; (number 39, 1981). But they split again, and both Betts and the Allmans were inactive for several years. Betts returned with the Dickey Betts Band and Pattern Disruptive in 1988, and in 1989 he and a couple of members of his backup band joined a second, more permanent re-formation of the Allmans. \n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\nOriginal Release:\t1974\n\n\n\n\nAfter the runaway success of the Allman Brothers' classic Brothers and Sisters LP -- an album on which Dickey Betts virtually architected the open loping country sound with his newly found singing voice and easy, slimmed down guitar style -- the guitarist decided to try his hand at a solo album. Highway Call is, in essence, the second chapter in Betts finding his own voice as not only a singer, but also as a songwriter as well. At a brief half-hour in length, Highway Call is nonetheless an emotionally powerful slice of small country life offered with a vast emotional landscape. The tone is nostalgic in that each of the songs here reflects memory and the yearning for a simpler, less cluttered life lived in the open spaces, away from the chaotic roil of rock stardom and all of its trappings. The title track reflects an acceptance of Betts' life as an itinerant musician, destined to play out his hand on the road. There isn't a hint of regret in the ringing, slippery guitars and harmony vocals, but there is a sense that life could have been different. On &quot;Let Nature Sing,&quot; Betts calls forth the spirits of America, from its rock and crags, its lakes and panoramic vistas, and from the ghosts of the people who've traipsed through Betts' life, leaving an emotional and indelible impression upon him. Each song here, such as &quot;Rain,&quot; with its sideways pedal steel, or &quot;Long Time Gone,&quot; with its runaway slide, or even the aforementioned &quot;Let Nature Sing,&quot; with its glorious dobro and fiddle (courtesy of Vassar Clements) underscoring Betts' lead and the ringing pedal steel of Jon Hughey is a testament to the pastoral in American life. And for Betts, the rambler, gambler, and hard living guitar man, there is no contradiction. All of his cards are on the table in &quot;Hand Picked,&quot; a nearly 15-minute country swing romp through Bob Wills, Merle Haggard, the Allmans, and bluegrass, Betts creates the ultimate road instrumental. The listener can hear Clements and Betts roaring down the two-lane blacktop on the back of a flatbed truck, ripping this one out with easy abandon. Highway Call stands as the artist's finest solo moment, one that holds his true voice easily expressing itself far from the madding blues wail of the Allmans, deep in the center of a Georgia holler with the sun beating down on the peach trees or on the incessant babble of a backwoods creek calling his listeners to the mystery inherent in simple living and in playing honest, heartfelt music.\n\n\n\n\n\nAudio-Info:\n\n\n\n\n01. Long Time Gone\n02. Rain\n03. Highway Call\n04. Let Nature Sing\n05. Hand Picked\n06. Kissimmee Kid\n\n\n\n\n\n\n\n\n              ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                  ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n\n","torrent":{"xt":"urn:btih:da9f02cfcd3b1770b97e45c53f9064011014ffb7","amp;dn":"Richard+%28Dickey%29+Betts+-+Highway+Call+%282001%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da9f02cfcd3b1770b97e45c53f9064011014ffb7","infoHashBuffer":{"type":"Buffer","data":[218,159,2,207,205,59,23,112,185,126,69,197,63,144,100,1,16,20,255,183]},"announce":[],"urlList":[]}}