{"title":"Skyrim Jacked (230 Mods to jack up you skyrim experiance)","uid":7296185,"size":16021761390,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dcaf4aee4b01e09adb446218fb0593601b1f1f57&amp;dn=Skyrim+Jacked+%28230+Mods+to+jack+up+you+skyrim+experiance%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Maous1","files":1,"time":1337891439,"description":"This is for steam users only or those that know how to merge these folders and replace these files manually without my instructions. \n\nThis file will require at least a gtx 560 or equivalent radeon model to achieve playable framrates 30+\n\nThis was created so my three friends don't have to download over 200gb's of mod files and spend over 60+ hours of time customizes the mods to get them to work / sync with no graphical errors or game-play bugs. Feel free to use this if you like them want a seriously beefed up skyrim experience without the hassle of modding it yourself.\n\nI am not a mod creator or artist and take no credit in doing any such things i have a small credits section in the readme if your interested in some of the mod authors, but its not complete as i did not document alot of what i did and this is weeks later so i do not remember everything just the big stuff.\n\nBe absolutely sure to read the readme and the very important text documents.\n\nAgain Be absolutely sure to read the readme and the very important text documents.\n\nScreens will be taken and uploaded sometime in the next few days hopefully i work alot like alot alot. And d3 is now very time consuming.\n\nThis includes everything from new character models to new dust particles on the ground as well as better perk trees and better magic experiance for pure mages ( Dragons are hard) \n\nThis is for steam users only or those that know how to merge these folders and replace these files manually without my instructions. ","torrent":{"xt":"urn:btih:dcaf4aee4b01e09adb446218fb0593601b1f1f57","amp;dn":"Skyrim+Jacked+%28230+Mods+to+jack+up+you+skyrim+experiance%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcaf4aee4b01e09adb446218fb0593601b1f1f57","infoHashBuffer":{"type":"Buffer","data":[220,175,74,238,75,1,224,154,219,68,98,24,251,5,147,96,27,31,31,87]},"announce":[],"urlList":[]}}