{"title":"Benny Andersson Band - Story of a Heart 2009","uid":6685219,"size":334226567,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dfa925b2d0644dd868d2e1f414c85a34e7dd305a&amp;dn=Benny+Andersson+Band+-+Story+of+a+Heart+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"barber9","files":-1,"time":1316376553,"description":"To the majority of UK residents GÃƒÂ¶ran Bror Benny Andersson , one of the 'B's in ABBA has been a man whose reputation as a music maker ended somewhere around the era of Chess, although of course his role as co-ecutive producer (along with his most famous wrtiting partner Bjorn Ulvaeus) of the musical Mama Mia! has kept his biggest legacy alive and well. But to fans and Swedes he's a busy man, not least with his 16-piece Benny Andersson Orkester wherein he's been combining a love of Swedish ( and European) folk, big bands, early jazz and Bach to spectacular, if idiosyncratic, effect. Story Of A Heart, with its combination of older BOA material and new compositions is designed to bring his CV up to date for non-Scandinavians.\n\nTo those not aware of Benny's folk roots this album may come as a bit of a surprise (his first major success was with The Hep Stars, a huge pop act in Sweden who combined his love of traditional music and rock 'n' roll). Songs from his back catalogue like Glasgow Boogie, Jehu or Tyrolean Schottische combine celtic forms with jolly brass and wheezing accordions and Trolska demonstrates his love of his nation's native music. It's life-affirming, purely instrumental fare, and a far cry from his more famous material. Elsewhere we're offered Debussy-like cinematic beauty in the piano meditation of Song From The Second Floor.\n\nBut Story Of A Heart's USP is undoubtedly the title track; the first song he's written with Bjorn in 15 years and sung by Swedish star, Helen SjÃƒÂ¶holm. It's a slice of pure B&amp;B magic, albeit a little too slick and sweet for some palates. But it was ever thus with ABBA, who often navigated the grey area betwixt cheese and chart perfection. Elsewhere both Helen and former Chess star Tommy KÃƒÂ¶rberg deliver more pop tunes which mainly fall into the style of 20s blues or 50s rock 'n' roll ballads (You Are My Man, Fait Accompli and (If This IS) Our Last Dance), delivered confidently with musical theatre at their heart.\n\nIt's an odd mixture of styles that will neither appeal to hardcore musicologists or ABBA fans, but it does showcase a man whose talents are both eclectic and accomplished. \n(Chris Jones, review, amazon.co.uk)\n\n- - -\n\nBenny Andersson Band - Story of a heart 2009\n(Stockholm Mono Music)\n\n 1. Glasgow boogie \n 2. Trolska \n 3. Story of a heart  \n 4. Bed of roses \n 5. You are my man \n 6. Cirkus finemang \n 7. Fait accompli \n 8. Song from the second floor \n 9. Birthday waltz for Mona \n10. (If this is) our last dance \n11. Jehu \n12. Tyrolean schottische \n13. The stars \n14. PS \n15. Sommaren du fick\n","torrent":{"xt":"urn:btih:dfa925b2d0644dd868d2e1f414c85a34e7dd305a","amp;dn":"Benny+Andersson+Band+-+Story+of+a+Heart+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfa925b2d0644dd868d2e1f414c85a34e7dd305a","infoHashBuffer":{"type":"Buffer","data":[223,169,37,178,208,100,77,216,104,210,225,244,20,200,90,52,231,221,48,90]},"announce":[],"urlList":[]}}