{"title":"Earthquake In A Box v0.2","uid":7314072,"size":115475839,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e13fc5e8c4590bcd9f33a965a4a7ef878bcc11e2&amp;dn=Earthquake+In+A+Box+v0.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stonecold1995","files":1,"time":1338428731,"description":"Earthquake In A Box is a care package for members of Anonymous.  It comes with a few tools that help enhance anonymity, as well as good documentation and some helpful e-books.  Note that this packages still has the old DDoS program LOIC.  DO NOT use LOIC against any server but your own.  Now I'm not saying this as a legal disclaimer, but because LOIC has a tendency to leak your IP address even if you're behind VPN.\n\nHere's an important note: DON'T trust just any software you find just because it says it's &quot;made by Anonymous&quot;.  I can assure you this specific torrent is not fake but you shouldn't trust me 100% either.  If I were malicious I would say the same thing to try to get you to trust me.  Download this only if you trust me and you know what you're doing.  More than likely this will set off your AV software, but that's only because it has tools like MAC changers and LOIC, which are not viruses but, according to most AV software, &quot;hack tools&quot; (although technically it's not hacking).\n\nThe installer is a self-extracting .exe file created with 7-Zip.  If you don't trust it, don't download it (it isn't malware though).  When you run the installer, it'll ask you where you want the contents extracted.  Select a location and press &quot;Extract&quot;.  Open the newly created folder and double-click &quot;start.exe&quot;.  That's all!\n\n\n\nI suggest you read the README which comes with this kit, which I've uploaded to http://pastehtml.com/raw/bzusbeiqa.txt (or alternatively http://www.pastebay.net/1062132).\n\nFeel free to check out my other Anonymous care package, the /i/Kit \n(https://thepiratebay.se/torrent/7311655/_i_Kit_for_Anonymous), which is a bit bigger (about 300MB) and has more programs.","torrent":{"xt":"urn:btih:e13fc5e8c4590bcd9f33a965a4a7ef878bcc11e2","amp;dn":"Earthquake+In+A+Box+v0.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e13fc5e8c4590bcd9f33a965a4a7ef878bcc11e2","infoHashBuffer":{"type":"Buffer","data":[225,63,197,232,196,89,11,205,159,51,169,101,164,167,239,135,139,204,17,226]},"announce":[],"urlList":[]}}