{"title":"An Introduction to NURBS with historical perspective","uid":7301977,"size":13048372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e17fd4c7c17421b4bad7d766b7b5da4f6386f6d3&amp;dn=An+Introduction+to+NURBS+with+historical+perspective&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"MeeLike","files":-1,"time":1338064171,"description":"The latest from a computer graphics pioneer, An Introduction to NURBS is the ideal resource for anyone seeking a theoretical and practical understanding of these very important curves and surfaces. Beginning with Bezier curves, the book develops a lucid explanation of NURBS curves, then does the same for surfaces, consistently stressing important shape design properties and the capabilities of each curve and surface type. Throughout, it relies heavily on illustrations and fully worked examples that help you grasp key NURBS concepts and deftly apply them in your own work. Supplementing the lucid explanations are illuminating accounts of the history of NURBS, written by some of its most prominent figures.\n\nWhether you write your own code or simply want deeper insight into how your computer graphics application works, An Introduction to NURBS will enhance and extend your knowledge to a degree unmatched by any other resource.\n\nFeatures\n\nVital information applicable in many different areas: CAD, scientific visualization, animation, computer games and more. \n\nDesigned for anyone with first-year undergraduate mathematics. \n\nDetails specific NURBS-based techniques. \n\nPresents all important algorithms in easy-to-read pseudocode. C-code implementations are available. \n\nIncludes complete references to additional NURBS resources.","torrent":{"xt":"urn:btih:e17fd4c7c17421b4bad7d766b7b5da4f6386f6d3","amp;dn":"An+Introduction+to+NURBS+with+historical+perspective","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17fd4c7c17421b4bad7d766b7b5da4f6386f6d3","infoHashBuffer":{"type":"Buffer","data":[225,127,212,199,193,116,33,180,186,215,215,102,183,181,218,79,99,134,246,211]},"announce":[],"urlList":[]}}