{"title":"Flash Facebook Cookbook{BBS}","uid":6663798,"size":8813057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1dccd83538d26735245218feac727b1f8552ba2&amp;dn=Flash+Facebook+Cookbook%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315609449,"description":"Written in a cookbook style, this book offers solutions using a recipe-based approach. Each recipe contains step-by-step instructions followed by an analysis of what was done in each task and other useful information. This Cookbook is targeted towards those with at least a basic understanding of the Flash Builder IDE and the Flex framework. No prior knowledge of the Facebook APIs is assumed or required. If you want to start building Flash Facebook apps quickly and effectively this is the book for you.\nAbout the Author\n\nJames Ford\n\n\nJames Ford lives and works in the relatively sedate Midlands of England, and is constantly thankful that he doesn't have to contend with public transport or large volumes of traffic on a regular basis. Occasionally being stuck behind a tractor for several miles is a small price to pay for that! Macromedia Flash 8 represented his first serious interaction with a programming language, an epiphany whereupon his BA in Design for Interactive Media became far more focused on the Programming side of things than the Art (although it turned out okay).\n\nHe considers himself to be fortunate to have encountered the Flash Platform when he did, as during that time between first contact and today, the Flash Platform has evolved at just the right pace to enable him to keep up with the latest shiny new features.\nProduct Details\n\n    * Paperback: 388 pages\n    * Publisher: Packt Publishing (August 25, 2011)\n    * Language: English\n    * ISBN-10: 1849690723\n    * ISBN-13: 978-1849690720","torrent":{"xt":"urn:btih:e1dccd83538d26735245218feac727b1f8552ba2","amp;dn":"Flash+Facebook+Cookbook%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1dccd83538d26735245218feac727b1f8552ba2","infoHashBuffer":{"type":"Buffer","data":[225,220,205,131,83,141,38,115,82,69,33,143,234,199,39,177,248,85,43,162]},"announce":[],"urlList":[]}}