{"title":"The.Secret.Circle.S01E01","uid":6679471,"size":4103077888,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e272d66a561b842a86dc667c916ea6012eceaf35&amp;dn=The.Secret.Circle.S01E01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rquile1","files":1,"time":1316146811,"description":"Cassie Blake's world is turned upside down after her mother dies in a mysterious accident, forcing Cassie to move in with her loving grandmother Jane in the small town of Chance Harbor, Washington. While trying to adjust to her new life, Cassie is quickly befriended by Diana Meade, a sweet-natured classmate who offers to show her around and introduces her to mean-girl Faye, her sidekick Melissa and Cassie's next door neighbor Nick. Things get complicated when she meets Adam, Diana's boyfriend, with whom she feels an instant and powerful connection. Upon meeting one of her mother's childhood friends, Dawn Chamberlain, the school principal and Faye's mother, Cassie begins to wonder why her mother never spoke of her hometown. When strange and dangerous things begin to happen, Cassie's new friends are forced to tell her their secret - they are all witches and her arrival will complete the Circle. However, the Circle has not been drawn together again by chance - Diana's father, Charles Meade has plans of his own for the group. Written by CW Publicity ","torrent":{"xt":"urn:btih:e272d66a561b842a86dc667c916ea6012eceaf35","amp;dn":"The.Secret.Circle.S01E01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e272d66a561b842a86dc667c916ea6012eceaf35","infoHashBuffer":{"type":"Buffer","data":[226,114,214,106,86,27,132,42,134,220,102,124,145,110,166,1,46,206,175,53]},"announce":[],"urlList":[]}}