{"title":"Batman 1966 Season 2 Episode 1 Shoot a Crooked Arrow","uid":7211405,"size":209902033,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e27f4f121c0fafe008855e1c78318485fe9baca6&amp;dn=Batman+1966+Season+2+Episode+1+Shoot+a+Crooked+Arrow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmanwf","files":1,"time":1335250237,"description":"In Batman's first episode of the second season, Fenton Quigley, a.k.a The Archer, a medieval enemy of Superman modeled after Robin Hood, escapes from Police Headquarters in a moving van from the Trojan Hearse Company, driven by Maid Marilyn. Together, with his band of &quot;merry malefactors&quot; - Crier Tuck and Big John (a play on Friar Tuck and Little John, respectively) - he pays a surprise visit to Wayne Manor. The inhabitants are gassed and cash is stolen. Later, the crew attacks Police Headquarters. When they are giving out other stolen cash they are apprehended by Batman and Robin. The Gotham citizens enriched by the muggers save them from arrest.\n\nBatman and Robin trace the Archer to his hideout at the Earl Of Huntington Archery Range (Robin Hood was the alias of the Earl of Huntingdon) in Gotham's Green Forest section, where Alfred Pennyworth attempts to divert the antagonists long enough for Batman and Robin to inspect his lair. The two are trapped in a giant net.\n\nThe Archer threatens to behead Alfred if he does not get the location of the Batcave, so the crime computers can be destroyed. Knowing the guillotine is fake, Batman refuses and challenges Quigley to a fair duel. The Archer then sets up Batman and Robin to be skewered by lances\n\n\nRecorded From A New Source 111hits Pay Tv Channel in Australia\n\nADVERT FREE","torrent":{"xt":"urn:btih:e27f4f121c0fafe008855e1c78318485fe9baca6","amp;dn":"Batman+1966+Season+2+Episode+1+Shoot+a+Crooked+Arrow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e27f4f121c0fafe008855e1c78318485fe9baca6","infoHashBuffer":{"type":"Buffer","data":[226,127,79,18,28,15,175,224,8,133,94,28,120,49,132,133,254,155,172,166]},"announce":[],"urlList":[]}}