{"title":"Match of the Day 2 - 29.04.2012","uid":7228417,"size":745561466,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e284d88394eac90f0454148001ad9f1d5a3e287f&amp;dn=Match+of+the+Day+2+-+29.04.2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"footy","files":1,"time":1335752466,"description":"BBC MOTD 2 29/04/2012\n\nDuration: 1 Hour, 5 Min\nColin Murray introduces highlights from the day's two Premier League fixtures, with expert analysis from Lee Dixon and Stoke City manager Tony Pulis.\n\nIn the early kick-off, Chelsea welcome west London rivals Queens Park Rangers to Stamford Bridge. The two sides have already clashed twice this season with honours even at one win apiece. QPR were the victors in a highly controversial Premier League match back in October, which saw two Chelsea players sent-off, before the Blues triumphed in a FA Cup fourth-round tie. Chelsea come into this fixture after a congested run of matches that has seen them play an FA Cup semi-final with Tottenham, and a two-legged Champions League semi-final with Barcelona sandwiched either side of a trip to face Arsenal in the league. Rangers are desperately trying to avoid a swift return to the Championship and will be keen to win at the home of their biggest rivals for the first time since 1986.\n\nIn the day's other game, Tottenham host Blackburn in a match crucial to both sides. Spurs are chasing a top-four finish that would secure a return to the Champions League - and they will be buoyed by their excellent recent record over Rovers which has seen them lose just two of their last 16 meetings. Steve Kean's Blackburn side meanwhile have endured a tough season as they battle to avoid relegation to the Championship for the first time since 1999. A win for them today would help ease those worries.\n\nAs ever, there is also a review of all the goals and incidents from Saturday.","torrent":{"xt":"urn:btih:e284d88394eac90f0454148001ad9f1d5a3e287f","amp;dn":"Match+of+the+Day+2+-+29.04.2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e284d88394eac90f0454148001ad9f1d5a3e287f","infoHashBuffer":{"type":"Buffer","data":[226,132,216,131,148,234,201,15,4,84,20,128,1,173,159,29,90,62,40,127]},"announce":[],"urlList":[]}}