{"title":"The Psychology of Prejudice and Discrimination 2nd Editon{BBS}","uid":6672710,"size":5459515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e29a9f8daf8336f7b25f96e93817a7c784f60736&amp;dn=The+Psychology+of+Prejudice+and+Discrimination+2nd+Editon%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315923616,"description":"This is the first comprehensive textbook on prejudice with a strong psychological research base. Whitley and Kite cover a broad range of topics--from race and ethnicity to gender, sexual orientation, and ageism. By integrating theory and research with students' own experiences, the authors increase students' awareness of influences that shape prejudices. As students evaluate research results and their personal, subjective beliefs, they develop an appreciation of scientific evidence regarding stereotypes, prejudice, and discrimination.\nAbout the Author\nBernard Whitley is Professor and Chair of the Department of Psychological Science at Ball State University. His research focuses the role of individual difference variables in prejudice. He is author, coauthor, or coeditor of four other books. He and Dr. Kite have collaborated together on numerous research projects.\n\nMary Kite is Professor of Psychological Science at Ball State University. Her research focuses on stereotyping and prejudice toward women, gays and lesbians, and older adults and has published widely in those areas. She is a past president of the Society for the Teaching of Psychology and currently serves as Secretary-Treasurer of the Midwestern Psychological Association. --This text refers to an out of print or unavailable edition of this title.\nProduct Details\n\n    * Paperback: 720 pages\n    * Publisher: Wadsworth Publishing; 2 edition (February 12, 2009)\n    * Language: English\n    * ISBN-10: 0495811289","torrent":{"xt":"urn:btih:e29a9f8daf8336f7b25f96e93817a7c784f60736","amp;dn":"The+Psychology+of+Prejudice+and+Discrimination+2nd+Editon%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e29a9f8daf8336f7b25f96e93817a7c784f60736","infoHashBuffer":{"type":"Buffer","data":[226,154,159,141,175,131,54,247,178,95,150,233,56,23,167,199,132,246,7,54]},"announce":[],"urlList":[]}}