{"title":"Red.Orchestra.2.Heroes.of.Stalingrad-SKIDROW(unziped)","uid":6676038,"size":7391373312,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e2c8cc646536f31eef216e280bb11aff57b7618d&amp;dn=Red.Orchestra.2.Heroes.of.Stalingrad-SKIDROW%28unziped%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DjAligator14","files":1,"time":1316031182,"description":"                      S  K  I  D  R  O  W\n                          .the leading force.\n\n                            proudly presents\n    Red Orchestra 2: Heroes of Stalingrad (c) Tripwire Interactive\n\n\n  14-09-2011........Release Date &lt;-&gt; Protection...............Steam\n  FPS..................Game Type &lt;-&gt; Disk(s)..................1 DVD\n\n\n  RELEASE NOTES\n\n\n Red Orchestra 2: Heroes of Stalingrad, the leading tactical multiplayer\n WWII shooter on the PC, will take the award winning Red Orchestra\n franchise into the next generation of gaming. Cutting edge graphics and\n audio built using the Unreal Engine 3, inventive features and\n streamlined realism will deliver an unrivalled tactical shooter\n experience.\n\n Heroes of Stalingrad will focus on the Battle of Stalingrad and the\n surrounding operations, both German and Russian, from July 1942 to\n February 1943. The game allows the player to experience one of the most\n brutal battles in all of human history. Delivering unrivalled accuracy\n and attention to detail, along with gritty, vicious combat in\n multiplayer and single-player modes the game will feature everything\n from quick, brutal firefights to more intricate and challenging\n tactical modes.\n\n Features:\n\n Red Orchestra multiplayer taken to new heights: The brutal, gritty Red\n Orchestra gameplay has been enhanced, expanded and made more\n accessible. Gameplay modes as instantly recognizable as Firefight\n (Tripwire's take on Team Death Match), single-life gaming redefined in\n Countdown mode - and the Territory mode already beloved by the hundreds\n of thousands of Red Orchestra players worldwide.\n\n Stalingrad Campaign: Before heading online hone your skills in one of\n two campaigns that recreate the battle for Stalingrad from both the\n German and Russian sides. Featuring open non-linear environments and\n unscripted gameplay players make their own path through the\n battlefield.\n\n Heroes: Achieve the ultimate goal and become a Hero online. Players\n with hero status inspire troops around them and cause fear in their\n enemies. Heroes have access to the best and rarest weapons and will\n stand out visually from the rest of the soldiers.\n\n First person cover system: Experience the ultimate firefights that a\n cover system allows, from the immersion of a first person view. Peek or\n blind fire over and around cover and more.\n\n Unique Focus  the Battle of Stalingrad in depth: takes the familiar\n WWII genre into a unique direction. Far removed from the well-trodden\n Normandy setting, gameplay is based on fresh scenarios and actions the\n player has never experienced before. Follow the German army as they\n assault the city of Stalingrad, to the banks of the Volga. Follow the\n Soviet army as it holds the city against all the odds then destroys the\n Axis forces.\n\n WWII weaponry redefined: true to life ballistics, bullet penetration,\n breathing, adjustable sights, free aim, weapon bracing, photo-real\n graphics and more, create WWII weaponry that has no equal.\n\n Immersive First Person Tank Warfare: experience what it was like to\n fight inside one of these metal beasts in WWII with the most immersive\n first person tank warfare ever created. Fully modeled 3d interiors, a\n full AI crew, and advanced armor and damage systems create a unique\n tanking experience.\n\n Morale: Experience what it is like to be a soldier in one of the\n bloodiest conflicts in history and the importance of a soldier's state\n of mind and how it can turn the tide of battle. Suppress your enemies\n and gain the advantage in combat!\n\n Persistent Stats Tracking and Player Progression: Persistence\n constantly gives the gamer something to strive for and keeps them\n playing. Grow in rank, earn achievements, improve your abilities, and\n become a Hero!\n\n Enhanced Unreal  Engine  3: Built on an enhanced version of Unreal\n Engine 3 the game features cutting edge visuals and features.\n\n\n  INSTALL NOTES\n\n\n 1. Unpack the release\n 2. Mount or burn image\n 3. Install\n 4. Copy all files from the SKIDROW folder to the game installation\n 5. Play the game\n 6. Support the companies, which software you actually enjoy!\n\n\n  GREETINGS\n\n\n To all friends of the family and honorable rival groups!\n\n\n                                ascii art by the\n                              godlike &amp; terrific duo\n                                  malodix + irokos\n                                    titan artdivision","torrent":{"xt":"urn:btih:e2c8cc646536f31eef216e280bb11aff57b7618d","amp;dn":"Red.Orchestra.2.Heroes.of.Stalingrad-SKIDROW%28unziped%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2c8cc646536f31eef216e280bb11aff57b7618d","infoHashBuffer":{"type":"Buffer","data":[226,200,204,100,101,54,243,30,239,33,110,40,11,177,26,255,87,183,97,141]},"announce":[],"urlList":[]}}