{"title":"Tipard Video Downloader 3.1.16 ","uid":7358970,"size":10185355,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e4f6b7c41c3c14d9c5b6e8cde5f11ec366a95e6d&amp;dn=Tipard+Video+Downloader+3.1.16+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LJUSALF","files":-1,"time":1339879281,"description":"\nTipard Video Downloader 3.1.16 | 9.71 MB\n\nTipard Studio newly released a fantastic video downloader - Tipard Video Downloader, which can assist you to download any streaming video and online TV show with amazing speed. Plus, this powerful Video Downloader can detect and download streaming video automatically. What's more, it can convert the downloaded video and local video to whatever video formats as you like. In a word, this powerful Video Downloader can help you enjoy the streaming video with your iPhone, iPad, BlackBerry, etc.\n\nFEATURES:\n- Download streaming video\n- Supported protocols: RTMP, HTTP, RTSP, MMS, etc.\n- Convert downloaded and local video\n- Preview the video with the built-in player\n\nRecord streaming video\nThis powerful Video Downloader supports most protocols, such as RTMP, HTTP, RTSP, MMS, etc. Then you can download any streaming video from YouTube, Yahoo, Google, MySpace, CNN, PBS, Metacafe, ABC, ESPN, etc.\n\nBatch downloading\nTipard Video Downloader allows you to batches download online videos at a time. And it can save you much time.\n\nPlay the IE cache video\nThis Video Downloader can help you find the video from your IE cache and play it for you. Also it can export these videos from the cache.\n\nConvert downloaded video\nThis Video Downloader can automatically add the recorded video to the Video Converter Tool to be converted. Also you can set this Video Downloader to automatically start conversion after added.\n\nConvert local video\nWith this Video Downloader, you can load the local video and convert it to any video as you like.\n\nAdjust video settings\nTipard Video Downloader enables you to adjust Video Encoder, Resolution, Frame Rate, Video Bitrate and the Audio Encoder, Sample Rate, Channels, Audio Bitrate. Also you are allowed to input your own solution.\n\nDetect the streaming video automatically\nJust play the video you want to download and this Video Downloader will download automatically. \n\nUseful video player\nThe built-in player can help you view the video. Also it enables you to capture your favorite frame and save it as an image.\n\nUser-friendly interface\nTipard Video Downloader owns an intuitive interface, which can simply the operation much.\n","torrent":{"xt":"urn:btih:e4f6b7c41c3c14d9c5b6e8cde5f11ec366a95e6d","amp;dn":"Tipard+Video+Downloader+3.1.16+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f6b7c41c3c14d9c5b6e8cde5f11ec366a95e6d","infoHashBuffer":{"type":"Buffer","data":[228,246,183,196,28,60,20,217,197,182,232,205,229,241,30,195,102,169,94,109]},"announce":[],"urlList":[]}}