{"title":"The Ramones - Swallow My Pride [promo].VOB","uid":7236832,"size":86466560,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e7fa6226c4fd3a5af00a5589c3fd6bbf983ef7e1&amp;dn=The+Ramones+-+Swallow+My+Pride+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1336016110,"description":"The Ramones - Swallow My Pride [promo].VOB\n\n\nHQ promo music video from a promo DVD. &quot;Swallow My Pride&quot; is a song from Leave Home, the second studio album by American punk rock band \n\nThe Ramones. It was released on January 10, 1977 through Sire Records. The album features the classic Ramones songs &quot;Pinhead&quot; and &quot;Gimme \n\nGimme Shock Treatment&quot;. It is the only Ramones album to go through different incarnations on its original release, due to label \n\ncontroversy over the song &quot;Carbona Not Glue&quot;.\n\nThe band had written most of the songs appearing on their first two albums by the time they were signed to Sire (as evidenced by the \n\nsong listing of the 1976 live tracks appearing on the CD rerelease). They were placed roughly in chronological order on the first two \n\nalbums; as explained by Johnny Ramone: &quot;We recorded them in the order they were written; we wanted to show a slight progression in song \n\nstructure.&quot;\n\nMany fans and critics point to the more polished pop sensibilities of the second album as evidence of the band's evolving musical skill \n\nand style. The second album was recorded at the relatively upscale Sundragon Studios in Manhattan, New York.\n\nThe Ramones were an American rock band that formed in the New York City neighborhood of Forest Hills, Queens, in 1974. They are often \n\ncited as the first punk rock group. Despite achieving only limited commercial success, the band was a major influence on the punk rock \n\nmovement both in the United States and the United Kingdom.\n\nAll of the band members adopted pseudonyms ending with the surname &quot;Ramone&quot;, though none of them were related. They performed 2,263 \n\nconcerts, touring virtually nonstop for 22 years. In 1996, after a tour with the Lollapalooza music festival, the band played a farewell \n\nconcert and disbanded. Little more than eight years after the breakup, the band's three founding members, lead singer Joey Ramone, \n\nguitarist Johnny Ramone, and bassist Dee Dee Ramone had died.\n(video does not have any logos)\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Leave_Home&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Leave_Home&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/eaOpGAadf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/eaOpGAadf&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9800kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:02:04\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated April 01, 2012!\n\n\n*Media Player Classic Home Cinema*   &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\n","torrent":{"xt":"urn:btih:e7fa6226c4fd3a5af00a5589c3fd6bbf983ef7e1","amp;dn":"The+Ramones+-+Swallow+My+Pride+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7fa6226c4fd3a5af00a5589c3fd6bbf983ef7e1","infoHashBuffer":{"type":"Buffer","data":[231,250,98,38,196,253,58,90,240,10,85,137,195,253,107,191,152,62,247,225]},"announce":[],"urlList":[]}}