{"title":"Lake Placid(1999)DVDRip.AC3(ENG)-DROCK","uid":6553492,"size":733296838,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea5e9d931ffdccc968aead145a9f660a621a7d85&amp;dn=Lake+Placid%281999%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1311190657,"description":"So what's under the water in that lake deep in the Maine woods? No one is sure what it could be, but a dead and severely mutilated body was found near the shore, and the only clue is a large tooth which appears to be from a prehistoric animal resembling a huge crocodile. Jack Wells (Bill Pullman), the local fish and game warden, is investigating the case when he's assigned a helper, paleontologist Kelly Scott (Bridget Fonda). Kelly generally does office work since she hates the outdoors (a drawback in her line of work) and is recovering from a breakup with one of her co-workers. Jack would just as soon handle this matter without Kelly's help, but with time, the two get used to each other and something beyond a working relationship begins to develop. Meanwhile, Jack and Kelly also have to deal with Sheriff Hank Keogh (Brendan Gleeson), who would like to find the mystery creature and kill it; Hector Cyr (Oliver Platt), a quirky mythology expert who wants to capture and study the beast; and Mrs. Bickerman (Betty White), an eccentric older woman with dubious stories about her missing cattle -- and missing husband. Blending suspense, humor, and romance, Lake Placid was written by David E. Kelley, creator of the popular TV shows Ally McBeal and The Practice, and directed by Steve Miner, whose credits range from TV's The Wonder Years to the films Forever Young and Halloween: H20. \n\nRipped with Handbrake.\n\nLength: 1 Hour 22 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 304\n\nAudio\n\nBit Rate: 160kbps","torrent":{"xt":"urn:btih:ea5e9d931ffdccc968aead145a9f660a621a7d85","amp;dn":"Lake+Placid%281999%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea5e9d931ffdccc968aead145a9f660a621a7d85","infoHashBuffer":{"type":"Buffer","data":[234,94,157,147,31,253,204,201,104,174,173,20,90,159,102,10,98,26,125,133]},"announce":[],"urlList":[]}}