{"title":"Custom Firmware For PSP","uid":7284855,"size":4531649,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:eb3a6614892ba2a3f6d4953666226b91dcc06e8d&amp;dn=Custom+Firmware+For+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SoraFan96","files":17,"time":1337549540,"description":"IF YOU WANT TO KNOW HOW TO INSTALL CUSTOM FIRMWARE ON YOUR PSP CHECK THE STEPS BELOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nThis is custom Firmware for PSP. This let's you play ISO and CSO files downloaded from the internet and play them on your PSP without a UMD disc. This is really useful if you have a psp and want to spare money on psp games.\n\nHere is a instruction:\n\n1. Connect your PSP to your PC using a cable.\n\n2. When the folder with the PSP stuff comes up, click on the folder that says PSP.\n\n3. Then you click on the GAME folder.\n\n4. After that you open the custom firmware folder.\n\n5. There you will see some numbers. Click on the folder that has the system software you have on your PSP. (to see wich system software you have go to the settings section on your PSP. Then go to system settings and system information.)\n\n6. Then click on the PSP folder, followed by the GAME folder.\n\n7. There you will see a folder named PROUPDATE. \n\n8. Drag the PROUPDATE folder, into the GAME folder on the PSP.\n\n9. After that you go to the GAME section on your PSP. There you will see a white box that says &quot;Pro PSP Firmware Update&quot; Press that.\n\n10. Then it will come a black screen with some white letters. Just press the &quot;X&quot; button twice. And there you go. You have gotten custom firmware. Check your system software. If it's some letters behind your original software you have done it right. \n\nIf you want to know how to download ISO and CSO files search on youtube.","torrent":{"xt":"urn:btih:eb3a6614892ba2a3f6d4953666226b91dcc06e8d","amp;dn":"Custom+Firmware+For+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb3a6614892ba2a3f6d4953666226b91dcc06e8d","infoHashBuffer":{"type":"Buffer","data":[235,58,102,20,137,43,162,163,246,212,149,54,102,34,107,145,220,192,110,141]},"announce":[],"urlList":[]}}