{"title":"Silence of the Lambs(1991)DVDRip.AC3(ENG)-DROCK","uid":6668445,"size":732552922,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ebc7c74c69c94710e73b6b2531e5baee401bb504&amp;dn=Silence+of+the+Lambs%281991%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drock232","files":-1,"time":1315785877,"description":"In this multiple Oscar-winning thriller, Jodie Foster stars as Clarice Starling, a top student at the FBI's training academy whose shrewd analyses of serial killers lands her a special assignment: the FBI is investigating a vicious murderer nicknamed Buffalo Bill, who kills young women and then removes the skin from their bodies. Jack Crawford (Scott Glenn) wants Clarice to interview Dr. Hannibal Lecter (Anthony Hopkins), a brilliant psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism. Crawford believes that Lecter may have insight into this case and that Starling, as an attractive young woman, may be just the bait to draw him out. Lecter does indeed know something of Buffalo Bill, but his information comes with a price: in exchange for telling what he knows, he wants to be housed in a more comfortable facility. More important, he wants to speak with Clarice about her past. He skillfully digs into her psyche, forcing her to reveal her innermost traumas and putting her in a position of vulnerability when she can least afford to be weak. The film mingles the horrors of criminal acts with the psychological horrors of Lecter's slow-motion interrogation of Clarice and of her memories that emerge from it.\n\nRipped with Handbrake.\n\nLength: 1 Hour 58 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:ebc7c74c69c94710e73b6b2531e5baee401bb504","amp;dn":"Silence+of+the+Lambs%281991%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebc7c74c69c94710e73b6b2531e5baee401bb504","infoHashBuffer":{"type":"Buffer","data":[235,199,199,76,105,201,71,16,231,59,107,37,49,229,186,238,64,27,181,4]},"announce":[],"urlList":[]}}