{"title":"The History Channel Great Battles Medieval USA XBOX360-CLANDESTi","uid":6673324,"size":7838697876,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ebf05b8ce69b2a0fbff9c53518d1ab24aacf1055&amp;dn=The+History+Channel+Great+Battles+Medieval+USA+XBOX360-CLANDESTi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sunblock.","files":-1,"time":1315947165,"description":"The History Channel Great Battles Medieval USA XBOX360-CLANDESTiNE\n\nDescription\n\nHistory Great Battles Medieval is set against the background of the historic Hundred Years War, spanning various conflicts between England and France in the 14th and 15th centuries. History Great Battles Medieval allows players to assume complete control of huge armies with more than 40 different units. From knights on horseback to infantry, French crossbowmen and English longbow archers, all units of the two warring factions are represented in the game, historically correct. Whether in campaign mode, a brief skirmish, or multiplayer mode, History Great Battles Medieval offers precise, realistic recreations of medieval battles.\n\nFeatures\n\nAdvanced graphics engine optimized for the capabilities of each platform\nFree form quest map that allows players to decide when and where to fight within a historical framework\n70 Medieval battles, including 26 historical encounters from the Hundred Years war (like the well-known siege of Orleans or the Battle of Crecy)\nMore than 40 different units all accurately researched and carefully modeled Weapons and shields are added to each unit by the player, giving an almost infinite number of equipment combinations\nOver 100 unique skills to customize your squads\nRegion: NTSC/U ","torrent":{"xt":"urn:btih:ebf05b8ce69b2a0fbff9c53518d1ab24aacf1055","amp;dn":"The+History+Channel+Great+Battles+Medieval+USA+XBOX360-CLANDESTi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebf05b8ce69b2a0fbff9c53518d1ab24aacf1055","infoHashBuffer":{"type":"Buffer","data":[235,240,91,140,230,155,42,15,191,249,197,53,24,209,171,36,170,207,16,85]},"announce":[],"urlList":[]}}