{"title":"The Devil's Disciple [1959] George Bernard Shaw","uid":6688584,"size":682004963,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ecc4e47e66dab855939361d517035c14856c0945&amp;dn=The+Devil%5C%27s+Disciple+%5B1959%5D+George+Bernard+Shaw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1316498916,"description":" &lt;a href=&quot;http://bayimg.com/nakFhaaDC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/nakFhaaDC&lt;/a&gt;\n\nThe Devil's Disciple (1959) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0052735/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0052735/&lt;/a&gt;\n\nThe Devil's Disciple is an 1897 play written by Irish dramatist, George Bernard Shaw. The play is Shaw's eighth, and after Richard Mansfield's original 1897 American production it was his first financial success, which helped to affirm his career as a playwright. It was published in Shaw's 1901 collection Three Plays for Puritans together with Captain Brassbound's Conversion and Caesar and Cleopatra. Set in Colonial America during the Revolutionary era, the play tells the story of Richard Dudgeon, a local outcast and self-proclaimed &quot;Devil's disciple&quot;. In a twist characteristic of Shaw's love of paradox, Dudgeon sacrifices himself in a Christ-like gesture despite his professed Infernal allegiance.\n\nThe Devil's Disciple is a 1959 film adaptation of the George Bernard Shaw play of the same title. The Anglo-American film was directed by Guy Hamilton who replaced Alexander Mackendrick[1] and starred Burt Lancaster, Kirk Douglas, and Laurence Olivier. Mary Grant designed the film's costumes.\n\nLancaster and Douglas made several films together over the decades, including I Walk Alone (1948), Gunfight at the O.K. Corral (1957), Seven Days in May (1964), and Tough Guys (1986), which fixed the notion of the pair as something of a team in the public's imagination. Douglas was always second-billed under Lancaster in these films but, with the exception of I Walk Alone, in which Douglas played a villain, their roles were usually more or less the same size.\n\nGeorge Bernard Shaw made no secret of the fact that he was unhappy with hisRevolutionary War-based play, The Devil's Disciple. In his prefaceto the text, he actually wrote, &quot;The Devil's Disciple does notcontain even a single passably novel incident.&quot; Shaw, who apparently was inno mood to do re-writes, even refused to stage the play in Britain. Iteventually made its public debut in America.\n\nWith such ringing non-endorsements from its author, it's surprising thatKirk Douglas and Burt Lancaster decided to produce and co-star in a filmversion of The Devil's Disciple (1959). Even with Laurence Olivier in aglorified supporting role, the resulting picture isn't completelysuccessful. For once however, something was gained by tinkering with thework of a brilliant writer. Many critics noted that the depiction of battlesequences that Shaw only described in his play helped open the story up,but audiences at the time couldn't be lured to theatres to see it. It probablydidn't help matters that the picture was marketed via the legendarily awfultag line: &quot;Burt, Kirk and Larry are coming - by George!&quot;\n\nThe story takes place in New Hampshire, in 1777. British troops move infrom Canada under the leadership of Gen. John Burgoyne (Olivier.) Thelocals, of course, plan to resist, but Burgoyne changes their minds when he publicly hangs a local bigwig named Timothy Dudgeon. But he doesn't count onthe return of the man's son, Richard Dudgeon (Douglas), who vows to takerevenge. Anthony Anderson (Lancaster), the pastor of a nearby village,understands Dudgeon's position, but is unwilling to join up with him becausehe's afraid that his wife (Janette Scott) is falling in love with the youngrebel. Before it's over, a case of mistaken identity will bring the battleto a violent head.\n\nShaw, who was Irish, never tired of poking fun at the British, and TheDevil's Disciple is loaded with sarcastic swipes at their perceivedsocial and military inadequacies. How ironic, then, that Olivier, the Brit,is so much fun to watch and gets all the best lines. As the critic forThe London Daily Standard wrote at the time, &quot;It is a film to seejust because Laurence Olivier gives the performance of his life. Andbecause, in his superb self-confidence, he dared to take the third lead,knowing that he would steal the film from Burt Lancaster and Kirk Douglas,the two male leads. And he does. Those two able actors look like stupidoafs.&quot;\n\nThat's over-stating it considerably, but Olivier seems to be having such awonderful time you'd never know that he was miserable while making themovie. The project he originally planned to work on was his own filmadaptation of Macbeth. Unfortunately, he couldn't get the funding heneeded, so it was with ulterior motives that he agreed to appear in The Devil's Disciple.\n\nFor openers, the picture was filming in England, so he wouldn't have to flyoverseas, and he was certainly happy to accept a $200,000 salary. But healso hoped that Lancaster might be able to get Hollywood interested in a bigShakespearean production. Olivier's plan was to cast his then-wife, VivienLeigh, as Lady Macbeth, and to offer the role of Macduff to Lancaster.These plans never materialized, however, due to personal problems.\n\nWhile Olivier was busy filming with Lancaster and Douglas, Leigh, who hadbeen growing increasingly histrionic, suffered a violent mental collapse.Leigh had had a long history of psychological problems, and Olivier knewthat this episode put an end to any hopes that she might fullyrecover.\n\nIt's no wonder, then, that he seemed to lose focus while working on the The Devil's Disciple. Leigh's condition, of course, was his mainconcern. But he was also frustrated that, no matter how he tried, hecouldn't land the money for an English production of a film by a Britishplaywright, while Burt Lancaster could with no trouble. Duringshooting, whether it was an intentional dig at their star status or not,Olivier consistently reversed Lancaster's and Douglas' names, calling them&quot;Kirk&quot; and &quot;Burt&quot; respectively. Lancaster, at least, grew increasinglyirritated by this as filming continued.\n\nOlivier later stated that he had never had &quot;such a miserable time on a job,&quot; but seen today most admirers of the actor's work will find his performance in The Devil's Disciple simply &quot;irresistible,&quot; to quote critic Pauline Kael.\n\nDirector: Guy Hamilton\nProducer: Harold Hecht\nScreenplay: Roland Kibbee and John Dighton (based on the play by GeorgeBernard Shaw)\nCinematography: Jack Hildyard\nEditor: Alan Osbiston\nArt Design: Terence Verity and Edward Carrere\nCostume Design: Mary Grant\nPrincipal Cast: Burt Lancaster (Anthony Anderson), Kirk Douglas (RichardDudgeon), Laurence Olivier (Gen. Burgoyne), Janette Scott (Judith Anderson),Eva LeGallienne (Mrs. Dudgeon), Mervyn Johns (Rev. Maindeck Parshotter),David Horne (William), Jenny Jones (Essie), Erik Chitty (Titus.)\n","torrent":{"xt":"urn:btih:ecc4e47e66dab855939361d517035c14856c0945","amp;dn":"The+Devil%5C%27s+Disciple+%5B1959%5D+George+Bernard+Shaw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc4e47e66dab855939361d517035c14856c0945","infoHashBuffer":{"type":"Buffer","data":[236,196,228,126,102,218,184,85,147,147,97,213,23,3,92,20,133,108,9,69]},"announce":[],"urlList":[]}}