{"title":"Tomorrow When the War Began (2010) DVDRip DUAL Eng-Spa","uid":6539875,"size":2078837821,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f021534664432268868a9b280db441cf2ca79ab8&amp;dn=Tomorrow+When+the+War+Began+%282010%29+DVDRip+DUAL+Eng-Spa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":2,"time":1310650573,"description":"MaÃƒÂ±ana Cuando La Guerra Empiece (2010) [DVDRip][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.twtwb.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.twtwb.com/&lt;/a&gt;\n\nEnglish:\n--------\nVideo Quality: DVDrip \nAudio Track: Castilian Ac3 / English \n\nTitle: Tomorrow, When the War Began  \nCountry: Australia \nUSA release: 02/09/2010 \nReleased in Spain: 04/03/2011 \nReleased on DVD (rental): 13/07/2011 \nStudio: Paramount Vantage \nDirector: Stuart Beattie \nScreenplay: Stuart Beattie \nStarring: Caitlin Stasey, Rachel Hurd-Wood, Lincoln Lewis, Deniz Akdeniz, Phoebe Tonkin, Chris Pang, Ashleigh Cummings, Andrew Ryan, Colin Friels \nRating: Not recommended for children under 12 years \n\n\nSynopsis: \nFed to help their parents in farm work, Ellie Linton (Caitlin Stasey), 17, chooses to live one last adventure before they end the summer: camping in a valley a paradise supposedly located in a of dense undergrowth, which neighbors refer to the unflattering name of &quot;Hell.&quot; \n\nAfter getting her parents to pay the Land Rover, Ellie takes his fellow high school, accompanying you on your adventure: his best friend McKenzie Corrie (Rachel Hurd-Wood) and her loving and athletic boyfriend, Kevin Holmes (Lincoln Lewis ), the shy beauty Fiona Maxwell (Phoebe Tonkin), the rowdy Homer Yannos (Deniz Akdeniz), the Puritan Robyn Mathers (Ashleigh Cummings), and Lee Takkam (Chris Pang), whose parents run the restaurant Thai people Wirrawee. \n\nArriving at his destination, the group discovers that the place has nothing infernal. On the contrary, is a lush and idyllic hidden paradise with a creek and a waterfall is the ideal place to flourish friendship and love. During the week of the camp, the rest of the world seems a distant memory for the kids ... until suddenly appear in the night sky several squadrons of planes flying low. \n\nReturning to the people, the seven young people discover that something serious happens: in the houses have no electricity, livestock and pets have died or are dying and, worst of all, their families have gone. \n\nWith the feeling that an unseen danger looming over them, the friends split up to search for clues about what is happening. Ellie, Corrie and Kevin make a shocking discovery: the fairgrounds has been converted into a prison camp and the whole town is a military prisoner unknown. \n\nWhen the hostile army is aware of the presence of children, Ellie and her friends, along with a new addition, the apathetic pothead Chris Lang (played by Andrew Ryan), must join forces to outwit and fight the mysterious enemy who has taken of his people and who apprehended his friends and loved ones. \n\nProduction notes: \nThe writer of the series' Pirates', Stuart Beattie, made his directorial debut with this action film based on the hit young adult novel by John Marsden, 'Tomorrow, When the War Began. &quot; \n\n\n\n\nEspaÃƒÂ±ol:\n--------\nCalidad Video: DVDrip \nPista Audio : Castellano Ac3 / Ingles\n\nTÃƒÂ­tulo: MaÃƒÂ±ana, cuando la guerra empiece\nTÃƒÂ­tulo original: Tomorrow, When the War Began\nPaÃƒÂ­s: Australia \nEstreno en USA: 02/09/2010 \nEstreno en EspaÃƒÂ±a: 04/03/2011 \nLanzamiento en DVD (alquiler): 13/07/2011 \nProductora: Paramount Vantage \nDirector: Stuart Beattie \nGuiÃƒÂ³n: Stuart Beattie \nReparto: Caitlin Stasey, Rachel Hurd-Wood, Lincoln Lewis, Deniz Akdeniz, Phoebe Tonkin, Chris Pang, Ashleigh Cummings, Andrew Ryan, Colin Friels\nCalificaciÃƒÂ³n: No recomendada para menores de 12 aÃƒÂ±os\n\n\nSinopsis:\nHarta de ayudar a sus padres en las tareas del campo, Ellie Linton (Caitlin Stasey), de 17 aÃƒÂ±os, decide vivir una ÃƒÂºltima aventura antes de que acaben las vacaciones de verano: una acampada en un valle paradisÃƒÂ­aco que supuestamente se encuentra en una zona de densa maleza, a la que los vecinos se refieren con el poco halagÃƒÂ¼eÃƒÂ±o nombre de Ã‚Â«El InfiernoÃ‚Â». \n\nTras conseguir que sus padres le presten el Land Rover, Ellie recoge a sus compaÃƒÂ±eros de instituto, que la acompaÃƒÂ±an en su aventura: su mejor amiga, Corrie McKenzie (Rachel Hurd-Wood) y su cariÃƒÂ±oso y atlÃƒÂ©tico novio, Kevin Holmes (Lincoln Lewis); la tÃƒÂ­mida belleza Fiona Maxwell (Phoebe Tonkin); el camorrista Homer Yannos (Deniz Akdeniz); la puritana Robyn Mathers (Ashleigh Cummings), y Lee Takkam (Chris Pang), cuyos padres regentan el restaurante tailandÃƒÂ©s del pueblo, Wirrawee. \n\nAl llegar a su destino, el grupo descubre que el lugar no tiene nada de infernal. Muy al contrario, es un exuberante e idÃƒÂ­lico paraÃƒÂ­so oculto, con un arroyo y una cascada: el lugar perfecto para que florezcan la amistad y el amor. Durante la semana que dura su acampada, el resto del mundo parece un recuerdo lejano para los chicos... hasta que de repente aparecen en el cielo nocturno varias escuadrillas de aviones volando bajo. \n\nAl volver al pueblo, los siete jÃƒÂ³venes descubren que algo grave sucede: en las casas no hay electricidad, el ganado y las mascotas han muerto o estÃƒÂ¡n agonizantes y, lo peor de todo, sus familias han desaparecido. \n\nCon la sensaciÃƒÂ³n de que un peligro invisible se cierne sobre ellos, los amigos se separan para buscar pistas sobre lo que estÃƒÂ¡ sucediendo. Ellie, Corrie y Kevin hacen un descubrimiento impactante: el recinto ferial ha sido convertido en un campo de prisioneros y todo el pueblo se encuentra preso de una fuerza militar desconocida. \n\nCuando el ejÃƒÂ©rcito hostil se percata de la presencia de los chicos, Ellie y sus amigos, junto con una nueva incorporaciÃƒÂ³n, el apÃƒÂ¡tico porrero Chris Lang (interpretado por Andrew Ryan), deberÃƒÂ¡n aunar fuerzas para burlar y contraatacar al misterioso enemigo que se ha apoderado de su pueblo y que ha apresado a sus amigos y seres queridos. \n\nNotas de producciÃƒÂ³n:\nEl guionista de la saga 'Piratas del Caribe', Stuart Beattie, debuta en la direcciÃƒÂ³n con esta pelÃƒÂ­cula de acciÃƒÂ³n basada en la exitosa novela juvenil de John Marsden, 'Tomorrow, When the War Began'.\n","torrent":{"xt":"urn:btih:f021534664432268868a9b280db441cf2ca79ab8","amp;dn":"Tomorrow+When+the+War+Began+%282010%29+DVDRip+DUAL+Eng-Spa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f021534664432268868a9b280db441cf2ca79ab8","infoHashBuffer":{"type":"Buffer","data":[240,33,83,70,100,67,34,104,134,138,155,40,13,180,65,207,44,167,154,184]},"announce":[],"urlList":[]}}