{"title":"Somewhere in the Night (1946) FULL DVD (ISO)","uid":7281638,"size":8274297078,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f031e1f450e0a6871d9b0c4d40ccf3e629a24e6f&amp;dn=Somewhere+in+the+Night+%281946%29+FULL+DVD+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Auge","files":-1,"time":1337449459,"description":"Somewhere in the Night (1946) FULL DVD (ISO)\n\nThis is a DVD rip to an ISO so you can watch it on your media player, mount it to a virtual drive or burn it to a DVD.\n\nThis file includes EVERYTHING the original DVD has:\n\n\n1946\n110 minutes\nBlack &amp; White \n1.33:1\nSpoken Language: English Mono, English Stereo\nSubtitles: English, Spanish\n\n(DVD-9)\n\nDirector: \nJoseph L. Mankiewicz\n\nCast: \nJohn Hodiak, Nancy Guild, Lloyd Nolan, Richard Conte, Josephine Hutchinson, Fritz Kortner, Margo Woode, Sheldon Leonard, Lou Nova, Morris Carnovsky\n\nDisc Features:\n* Commentary by Film Noir Historian Eddie Muller \n* Theatrical Trailer\n* Fox Noir\n\nSYNOPSIS:  \nIn the wake of World War II, recovering GI George Taylor cant remember anything about his former life, but hes determined to jog his memory. Clutching two letters that are his only clue, he sets out for Los Angeles to find himself.\n\nBonus Stuff: \nThe Philosophy of Film Noir by Mark T. Conard\n-    When Nietzsche declared God is dead, little did he know he was helping to launch a new cinematic genre characterized by shady characters and seamy plotlines involving fallen women, murder and betrayal. But noir is inevitably more than just stylish filmmaking or the marriage between American hard-boiled fiction and German expressionism, according to the philosophers, film historians and English professors who contributed to this book: film noir challenged widespread assumptions about material and moral progress and represents a systematic deconstruction of the American Dream. Examining classic noir films and books by writers such as Albert Camus, Dashiell Hammett and James Cain, contributors discuss essence of film noir as reflecting a sense of disenchantment, inversion of traditional values and the spiritual defeat of modernity. In her essay on The Maltese Falcon, Deborah Knight draws the distinction between the emotionally conflicted detective Sam Spade and his more detached predecessor, Sherlock Holmes. Philosophy professor Steven Sanders sifts through existentialist texts and classic noir films to find the meaning of life, while several contributors weigh in on themes of morality and Pulp Fiction gets a deep scholarly massage from Conard. Dense and intriguing, the book suggests noir is best perceived as a slightly warped mirror held up to contemporary society. \n","torrent":{"xt":"urn:btih:f031e1f450e0a6871d9b0c4d40ccf3e629a24e6f","amp;dn":"Somewhere+in+the+Night+%281946%29+FULL+DVD+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f031e1f450e0a6871d9b0c4d40ccf3e629a24e6f","infoHashBuffer":{"type":"Buffer","data":[240,49,225,244,80,224,166,135,29,155,12,77,64,204,243,230,41,162,78,111]},"announce":[],"urlList":[]}}