{"title":"POtHS - SIN-ister Secrets - 01 - Arrival of The AntiChrist - Doc","uid":6535003,"size":2715048568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0c4735990d1aed1f0864a93cc5a5e183a02366a&amp;dn=POtHS+-+SIN-ister+Secrets+-+01+-+Arrival+of+The+AntiChrist+-+Doc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":7,"time":1310482929,"description":"Downloader Instructions\n\nThe More You Share the More Shares you will receive, may Yahweh Bless you as He has me.\nI have Prayed to The Father To Bless all those that SEED LONG.\nDescription\n\n\n\n\n\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nSIN-ister Secrets\n\n\nPOtHS - Sinister Secrets - 01 - Arrival of The AntiChrist - Doc Marquis - 2 discs\n\n\n\n\n\nPOtHS - Sinister Secrets - 01 - Arrival of The AntiChrist - Doc Marquis - 2 discs\n\n\nPOtHS Comments on This one.........This is a BAD NAME for this tape. Although the title gets your attention, it is not truthful in describing the Contents. In saying that,,,the only thing bad with this Video is The Title. The ANTICHRIST has NOT ARRIVED YET. Any day though he could show.\n\nThis is an EXCELLENT Video with an inappropriate name. Doc lays it right on the line with these Illuminati Scumbags. &quot;Witchcraft of The Elite&quot; would have better title.\n\n\nWhat's in This Folder:\n\n\n1) 'Arrival of the Antichrist' - Focus is on the infamous Rothschild 'Protocols of the Learned Elders of Zion' and how leaders are following that plan as a blueprint\n\nNext\n\n2) 'America's Occult Holidays' - Former Satanist, Doc Marquis, delivers a knockout punch against the practice of all our major holidays, providing details only a former Witch would know. Doc begins by demonstrating how the Illuminati effected the change in our calendar and how that change has created a dramatic change in our everyday lives.\n\n3) 'Front Men of the Illuminati' - 'These men pull the strings and we dance'! Doc boldly outlines the real 'movers and shakers' of the Illuminati, those organizations most responsible for driving us all into the global dictatorship, the New World Order. Focus is on the most important 'Illuminati Card Game', explaining the importance of the insights provided by these remarkably accurate cards\n\n4) 'Magick, Mysticism, and Masonry' - This is THE ONE video every Mason to whom you are witnessing must see! Doc Marquis drives a wooden stake into the heart of Freemasonry by exposing truths only known to a former Satanist.\n\n\nIT IS HERE   POtHS 3 - Conspiracy Facts - Part 99A - Creating An Event In Heaven - Face To Face With Jesus &amp; The Holy Spirit  Solved - Jesus Lives - coming 7-4-11. Your Independence Day.\n\n\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nPOtHS 3 - Conspiracy Facts - Part 99 - The Greatest Conspiracy of All Times - Solved - Jesus Lives\n- NO MORE DOUBTS - Coming Soon - Jesus Lives - coming 7-4-11 -  Your Independence Day.\n\nThe Entire Collection can be found here: \n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe That The Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed..\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...\n\nMay Yahweh Bless You as He has me. Seed Long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the tRUtH.    \n\n\nGet info on the Take Over by The New World Order Below\n\n\n &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                         Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                               End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.hickoryhammockbaptist.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hickoryhammockbaptist.org&lt;/a&gt;                                                                Pastueur Carl Gallops\n                                                                                      Listen to Alex Jones   Secular Truth &lt;a href=&quot;\nhttp://www.overcomers.ca&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.overcomers.ca&lt;/a&gt;                                                                                    Current Bible Prophecy &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                  Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                              Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                         Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                        Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;       Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n\n[color=purple]11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n           \n      (thankyou) :thankyou:    (thankyou) :thankyou:    Thank You JESUS    \n","torrent":{"xt":"urn:btih:f0c4735990d1aed1f0864a93cc5a5e183a02366a","amp;dn":"POtHS+-+SIN-ister+Secrets+-+01+-+Arrival+of+The+AntiChrist+-+Doc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0c4735990d1aed1f0864a93cc5a5e183a02366a","infoHashBuffer":{"type":"Buffer","data":[240,196,115,89,144,209,174,209,240,134,74,147,204,90,94,24,58,2,54,106]},"announce":[],"urlList":[]}}