{"title":"BLUR NO DISTANCE LEFT TO RUN DVD 1","uid":7219878,"size":7513786368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0e96ef649be550252b8c7718d42146f5625c9d7&amp;dn=BLUR+NO+DISTANCE+LEFT+TO+RUN+DVD+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thelastb","files":13,"time":1335497693,"description":"And a day... they decided to return...\nFor anyone  who has admired Blur at any point during their diverse and long career, is likely to have  tingles up on  spine watching this.  Its the kind of film that makes you want to immediately listen to every Blur song that can lay on our hands on.\n An enjoyable, comprehensive and insightful documentary that takes a interesting  look at Blur's history from their early beginnings right up to the present day, followed  by an amazing high energy reunion captured in the park where &quot;Parklife&quot; was penned.\nBlur's story may not be another thing that a spectacular rock 'n' roll clash, where its protagonists are four intriguing - musical  erudites - individuals,  together for the first time in nine years.,  that answers all questions and shows the band gearing up for the big show.\nAnd If the documentary doesn't bring back your love to  Blur, the live show from Hyde Park  certainly will. A well captured live event  where   the sun sets and  the moon rises while Blur pumps out hit after hit.,  a beauty to behold.\nDamon Albarn can devote himself to Gorillaz all he wants, but to me he will always be , above all, the frontman of Blur...\n\nENJOY AND SHARE PLEASE\n\nwearethelastbeatniks.com","torrent":{"xt":"urn:btih:f0e96ef649be550252b8c7718d42146f5625c9d7","amp;dn":"BLUR+NO+DISTANCE+LEFT+TO+RUN+DVD+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0e96ef649be550252b8c7718d42146f5625c9d7","infoHashBuffer":{"type":"Buffer","data":[240,233,110,246,73,190,85,2,82,184,199,113,141,66,20,111,86,37,201,215]},"announce":[],"urlList":[]}}