{"title":"Mourning Phase... Mourning Phase(1971)[FLc]","uid":6681504,"size":173630274,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f266b6cbf8fd6cd0bcc83c3551f14450bb420c9c&amp;dn=Mourning+Phase...+Mourning+Phase%281971%29%5BFLc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dickspic","files":12,"time":1316212117,"description":"[img]https://images-na.ssl-images-amazon.com/images/I/51uWpBu4U5L._SL500_AA300_.jpg[/img]\n[color=Green]Mourning Phase (1971)Kissing Spell KSCD9440[/color] \n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n01. Ring Out The Bells (4:30) \n02. August Song (4:42)\n03. Smile Song (3:40)\n04. Dross (2:57)\n05. Putrescence (5:20)\n06. Damn Your Eyes (4:33)\n07. Contrived (3:08)\n \n\nOne of the rarest of all U.K. early-'70s folk-rock recordings, Mourning Phase's self-titled, privately pressed 1971 LP was reissued on CD to only slightly wider availability in 1994. It's also one of the strangest of all early-'70s U.K. folk-rock albums, with exceptionally bittersweet male-female duo harmonies, unceasingly mournful (yet attractive) melodies, and skeletal arrangements on which the couple seems to be backed by nothing but a single modestly amplified electric guitar and a single reverberant acoustic guitar. Adding yet further to the ghostly beyond-the-pale atmosphere are the lyrics, documenting romantic travails with unflinching nakedness. It's a little like eavesdropping on some experimental psychiatric technique in which a couple, troubled but still entangled with each other, is encouraged to vent its subconscious musings in as cathartic plainsong as they can manage. The imagery can be striking, albeit in a way that brings to mind a British folk-rock equivalent to Who's Afraid of Virginia Woolf?, with &quot;Smile Song&quot; griping that a forcing a smile is &quot;cheaper than grinning upside down,&quot; and &quot;Damn Your Eyes&quot; unleashing some of the most hateful lyrics to be found in any popular music song of the era. Despite the absence of drums or bass, it's not especially aligned with traditional folk; it's easy to imagine this sounding something like early Jefferson Airplane had it been fleshed out with standard full-band rock arrangements. Had that happened, though, this home-recorded relic -- which deserves an audience beyond the mere handful of hardcore collectors aware of its existence -- might not have as much of a mystical aura as it does.\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/09/14/mourning-phase/[/url]","torrent":{"xt":"urn:btih:f266b6cbf8fd6cd0bcc83c3551f14450bb420c9c","amp;dn":"Mourning+Phase...+Mourning+Phase%281971%29%5BFLc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f266b6cbf8fd6cd0bcc83c3551f14450bb420c9c","infoHashBuffer":{"type":"Buffer","data":[242,102,182,203,248,253,108,208,188,200,60,53,81,241,68,80,187,66,12,156]},"announce":[],"urlList":[]}}