{"title":"Problem Solving 101 - A Simple Book for Smart People","uid":6682663,"size":3188650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3ad5faabe70370691361776b4ca1f69da391f9c&amp;dn=Problem+Solving+101+-+A+Simple+Book+for+Smart+People&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GunningHawk90","files":1,"time":1316220262,"description":"The fun and simple problem-solving guide that took Japan by storm\n\nKen Watanabe originally wrote Problem Solving 101 for Japanese schoolchildren. His goal was to help shift the focus in Japanese education from memorization to critical thinking, by adapting some of the techniques he had learned as an elite McKinsey consultant.\n\nHe was amazed to discover that adults were hungry for his fun and easy guide to problem solving and decision making. The book became a surprise Japanese bestseller, with more than 370,000 in print after six months. Now American businesspeople can also use it to master some powerful skills.\n\nWatanabe uses sample scenarios to illustrate his techniques, which include logic trees and matrixes. A rock band figures out how to drive up concert attendance. An aspiring animator budgets for a new computer purchase. Students decide which high school they will attend.\n\nIllustrated with diagrams and quirky drawings, the book is simple enough for a middleschooler to understand but sophisticated enough for business leaders to apply to their most challenging problems.","torrent":{"xt":"urn:btih:f3ad5faabe70370691361776b4ca1f69da391f9c","amp;dn":"Problem+Solving+101+-+A+Simple+Book+for+Smart+People","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3ad5faabe70370691361776b4ca1f69da391f9c","infoHashBuffer":{"type":"Buffer","data":[243,173,95,170,190,112,55,6,145,54,23,118,180,202,31,105,218,57,31,156]},"announce":[],"urlList":[]}}