{"title":"Magnesium Injection Molding{BBS}","uid":6670781,"size":24972824,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f53701fd2c364bc15dbde2e2138a280e8d1e5794&amp;dn=Magnesium+Injection+Molding%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315863149,"description":"Injection molding of metallic alloys is a modern and environment-friendly technology with universal features, capable of implementing many conventional and novel processing methods based on semisolid and liquid routes. After its application to magnesium and recent commercialization, it is used to manufacture millions of light-weight, fully-recyclable components for various markets, including consumer electronics housings, automotive parts, sporting goods, household devices and office equipment.\n\nMagnesium Injection Molding takes the mystery out of this technique and covers both the scientific background and the technological aspects as they are understood at present. Fundamentals of magnesium alloys, semisolid state metallurgy and injection molding hardware are accompanied by intricate details of processing, phase transformations and properties of final structures with broad references to die casting and plastics injection. Also included are introductory topics which will allow beginners to understand the basics of magnesium molding and gradually work their way into this fascinating area of metal processing. For subjects where no literature data exist, pioneering research was conducted to provide scientifically credible explanations. As a unique blend of theory and industrial practice, this work represents a single source of interdisciplinary information at a level accessible to both the scientists and engineers from academia and industry.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 586 pages\n    * Publisher: Springer; 1 edition (December 17, 2007)\n    * Language: English\n    * ISBN-10: 0387723994\n    * ISBN-13: 978-0387723990","torrent":{"xt":"urn:btih:f53701fd2c364bc15dbde2e2138a280e8d1e5794","amp;dn":"Magnesium+Injection+Molding%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f53701fd2c364bc15dbde2e2138a280e8d1e5794","infoHashBuffer":{"type":"Buffer","data":[245,55,1,253,44,54,75,193,93,189,226,226,19,138,40,14,141,30,87,148]},"announce":[],"urlList":[]}}