{"title":"American Ghost Hunter - Sneakpeak collection (Chad and Ryan from","uid":7279967,"size":551204444,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f62f5c403607175ef2fa37efcef1d67207589959&amp;dn=American+Ghost+Hunter+-+Sneakpeak+collection+%28Chad+and+Ryan+from&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"psspss","files":4,"time":1337406913,"description":"American Ghost Hunter - Sneakpeak collection (Chad and Ryan from PRS) xvid avi\n\nif you wondered what ever happened to paranormal state and\nwhy only one episode of the Ghost prophecies air-ed and no\nother then this will explain it\n\nI thought I put this up.. it end up being more free advertising for them\nif anything. since no one has leaked yet any of the full episodes they\nhave put together.\n\nIt seems theyre touring America showing the film to a selective audience\nwho pay for tickets via their website.. Im not sure if its been released on DVD yet\n\nguess they got a taste for making big money from paranormal\nlike TAPs but decided to cut out the middle man e.g. a&amp;e and traveltv\n\nI havent joined their website not sure even if allowed if youre not in USA\nbut to watch their stuff streamed only via website is a downer\nand costs $100 a year.. I guess someone has to help pay for his\nsmoking addiction :)\n\nfrankly I like other paranormal shows as they show the complete\nepisodes for free and let you donate or buy merchandise to support them\nthey could of at least release the movie for free and used it\nto hook people to pay and join the website after that.\nso you can see if its really worth supporting or following :)\n-PSSPSS\n\nThe projects they worked on or working on.\n\n1) The Movie (Chads personal experience of paranormal\nand  family experience)\n2) UFO incident\n3) Voices from the Hell (from underground mining)\nIm sure this was debunked as a faked recordings though??\n4) Amityville Hauntings\n4) Other ghost investigations\n\nhere is a iMDB reference I have found &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1753433/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1753433/&lt;/a&gt;\n\nParanormal investigator and documentary filmmaker Chad Calek (Guest Star and Director of A&amp;E's Paranormal State and The Ghost Prophecies) returns to his hometown of Persia, Iowa in hopes to put an end to the 20 year reign of suffering that his family has endured due to an overwhelming amount of intense negative paranormal activity. Armed with the support and paranormal knowledge of best friend and paranormal investigator Ryan Buell (Star and Executive Producer of A&amp;E's Paranormal State), as well as world renown psychic Lorraine Warren, who's also known for her work as the primary investigator in the Amityville and Enfield Poltergeist cases, Calek is determined to not only solve the mysteries as to why the paranormal phenomena initially began, but also to finally bring an end to the activity that has been tormenting his family for over two decades\n\n\nHELP TO SEED if grabbing.. this will want you to get more of them\nim sure\n\n\nenjoy","torrent":{"xt":"urn:btih:f62f5c403607175ef2fa37efcef1d67207589959","amp;dn":"American+Ghost+Hunter+-+Sneakpeak+collection+%28Chad+and+Ryan+from","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f62f5c403607175ef2fa37efcef1d67207589959","infoHashBuffer":{"type":"Buffer","data":[246,47,92,64,54,7,23,94,242,250,55,239,206,241,214,114,7,88,153,89]},"announce":[],"urlList":[]}}