{"title":"SAP Gui 7.20 (2011) [Spanish]","uid":6538004,"size":739698725,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f6d1d0c18fa97314764bd104c2a090c9b7105c9f&amp;dn=SAP+Gui+7.20+%282011%29+%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":16,"time":1310575033,"description":"SAP Gui 7.20 (2011) [Spanish]\n\nCategoria: Software de GestiÃƒÂ³n\nIdioma: EspaÃƒÂ±ol Castellano\n\nDescripcion:\n------------\nSAP AG (Systeme, Anwendungen und Produkte) (Sistemas, Aplicaciones y Productos) es una empresa de informÃƒÂ¡tica alemana con sede en Walldorf. Comercializa un conjunto de aplicaciones de software empresarial, entre ellas mySAP Business Suite, que provee soluciones escalables, es decir, con capacidad de adaptarse a nuevos requisitos conforme cambian o aumentan las necesidades del negocio del cliente, con mÃƒÂ¡s de 1.000 procesos de negocio, que la empresa argumenta se encuentran entre las mejores prÃƒÂ¡cticas empresariales. \n\nSAP estÃƒÂ¡ considerada como el tercer proveedor independiente de software del mundo (tras Microsoft y Oracle) y el mayor de la UniÃƒÂ³n Europea. Cuenta con 12 millones de usuarios, 100.700 instalaciones y mÃƒÂ¡s de 1.500 socios. A finales de 2005, SAP empleaba a 35.873 personas en mÃƒÂ¡s de 50 paÃƒÂ­ses y sus ingresos anuales fueron de 8.513 millones de euros.\nContenido \n\n1 Historia \n2 MÃƒÂ³dulos de aplicaciÃƒÂ³n \n\n\nSAP fue fundada en 1972 en la ciudad de Mannheim, Alemania, por algunos antiguos empleados de IBM (Claus Wellenreuther, Hans-Werner Hector, Klaus Tschira, Dietmar Hopp y Hasso Plattner) bajo el nombre de &quot;SAP Systemanalyse, Anwendungen und Programmentwicklung&quot;. El nombre fue tomado de la divisiÃƒÂ³n en la que trabajaban en IBM. \n\nEl nombre SAP R/3 es al mismo tiempo el nombre de una empresa y el de un sistema informÃƒÂ¡tico. Este sistema comprende muchos mÃƒÂ³dulos integrados, que abarcan prÃƒÂ¡cticamente todos los aspectos de la administraciÃƒÂ³n empresarial. SAP ha puesto su mirada en el negocio como un todo: asÃƒÂ­ ofrece un sistema ÃƒÂºnico que soporta prÃƒÂ¡cticamente todas las ÃƒÂ¡reas de negocio. SAP proporciona la oportunidad de sustituir un gran nÃƒÂºmero de sistemas independientes, que se han desarrollado e instalado en organizaciones ya establecidas, por un solo sistema modular. Cada mÃƒÂ³dulo realiza una funciÃƒÂ³n diferente, pero estÃƒÂ¡ diseÃƒÂ±ado para trabajar con otros mÃƒÂ³dulos. EstÃƒÂ¡ totalmente integrado, ofreciendo autÃƒÂ©ntica compatibilidad entre todas las funciones de una empresa. \n\nDespuÃƒÂ©s de haber dominado el mercado, la empresa afronta una mayor competencia de Microsoft e IBM. En marzo de 2004 cambiÃƒÂ³ su enfoque de negocio en favor de crear la &quot;plataforma&quot; que desarrolla y utiliza, la nueva versiÃƒÂ³n de su software NetWeaver. \n\nEs en este punto donde SAP se encuentra enfrentada con Microsoft e IBM, que comercializan las plataformas alternativas .NET y WebSphere, respectivamente. \n\nA comienzos de 2004, SAP sostuvo conversaciones con Microsoft sobre una posible fusiÃƒÂ³n. Las negociaciones finalizaron sin un acuerdo. Sin embargo, a comienzos de 2006 se anunciÃƒÂ³ una alianza entre SAP y Microsoft para integrar las aplicaciones ERP de SAP con las de Microsoft Office bajo el nombre de proyecto &quot;Duet&quot;. \n\nLa compra de SAP por parte de Microsoft habrÃƒÂ­a sido uno de los acuerdos mÃƒÂ¡s grandes en la historia de la industria del software, dado el valor de mercado de la alemana, de mÃƒÂ¡s de 55.000 millones de euros (junio de 2004). \n\nSAP ha conquistado clientes de forma consistente para aumentar la cuota del mercado global a un 55% a fines de 2004, desde un 48% dos aÃƒÂ±os antes[cita requerida]. La participaciÃƒÂ³n combinada de Oracle y PeopleSoft declinÃƒÂ³ de un 29% a un 23%[cita requerida]. \n\nEn mayo de 2010 adquiriÃƒÂ³ a su competidor Sybase por 4.567 millones de euros. \n\nMÃƒÂ³dulos de aplicaciÃƒÂ³n \n\nGestiÃƒÂ³n Financiera (FI): Libro mayor, libros auxiliares, ledgers especiales, etc. \nControlling (CO): Gastos generales, costes de producto, cuenta de resultados, centros de beneficio, etc. \nTesorerÃƒÂ­a (TR): Control de fondos, gestiÃƒÂ³n presupuestaria, flujo de caja. \nSistema de proyectos (PS): Grafos, contabilidad de costes de proyecto, etc. \nGestiÃƒÂ³n de personal (HR): Los SubmÃƒÂ³dulos de Recursos Humanos son: \nGestiÃƒÂ³n de Personal: PA \nGestiÃƒÂ³n de la OrganizaciÃƒÂ³n: OM \nGestiÃƒÂ³n de Eventos \nReclutamiento RC \nCapacitaciÃƒÂ³n \nEvaluaciÃƒÂ³n del DesempeÃƒÂ±o \nDesarrollo de Personal PD \nPlanificaciÃƒÂ³n de Costo PC \nCÃƒÂ¡lculo de la nÃƒÂ³mina PY \nGestiÃƒÂ³n de tiempo TM \nBusiness Warehouse (BW) o Business Intelligence (BI): Datawarehousing. \nVentas y DistribuciÃƒÂ³n (SD): FacturaciÃƒÂ³n, Pedidos de ventas, solicitudes, pedidos abiertos. \nEjecuciÃƒÂ³n LogÃƒÂ­stica (LE): GestiÃƒÂ³n de entregas y necesidades \nGestiÃƒÂ³n de Materiales (MM) \nGestiÃƒÂ³n de Almacenes (WM) \nPlan de Mantenimiento (IA) \nPlanificaciÃƒÂ³n de ProducciÃƒÂ³n (PP) \n","torrent":{"xt":"urn:btih:f6d1d0c18fa97314764bd104c2a090c9b7105c9f","amp;dn":"SAP+Gui+7.20+%282011%29+%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6d1d0c18fa97314764bd104c2a090c9b7105c9f","infoHashBuffer":{"type":"Buffer","data":[246,209,208,193,143,169,115,20,118,75,209,4,194,160,144,201,183,16,92,159]},"announce":[],"urlList":[]}}