{"title":"Distant Shores","uid":7233145,"size":4792222959,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f7042dfd434681ebfa8f29d3dbb286a64e85ecc3&amp;dn=Distant+Shores&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"N0Drew","files":19,"time":1335904724,"description":"These notes are in the file contents.txt.\n---\n\n\nThese came from the private tracker provided by http://thebox.bz/.\n==================================================================\n\nDistant Shores - Series 1 (2005) [TVRip (XVID)]\nDistant Shores - Series 2 (2006) [TVRip (XVID)]\n\nWhere these came from before thebox.bz that is unclear. There are issues\nwith aspect ratio and letter boxing. VLC and other modern video players will\nallow these to be corrected while viewing. It appears that Windows Media\nPlayer will not.\n\nTo re-encode these risked losing quality, and would have prevented others who \nalready have these files from seeding this torrent without downloading again.\n\nThe aspect ratio flag for the series 1 files is set to 16:9. But it should\nhave been set to 4:3. It seems that these were was captured as a 16:9 video\nletter-boxed (black bars above and below) within a 4:3 feed. These bars got\nencoed into the video files. So view the video with the aspect ratio overridden\nto 4:3, and then also &quot;crop&quot; the video to 16:9 to remove the black bars to get\nit to display full-screen correctly on displays wider than 4:3.\n\nThe aspect ratio flag for the series 2 files is set to 4:3. But it should have\nbeen set to 16:9. So view the video with the aspect ratio overridden to 16:9.\nIt is not necessary to crop the series 2 videos.\n\nOVERVIEW\n\nDistant Shores is a comedy-drama first shown in the UK on ITV1 in January 2005.\n\nPeter Davison plays high flying London plastic surgeon Bill Shore. His marriage\nis on the rocks and his wife Lisa played by Samantha Bond has got a six month\nresearch job on a small Northumbrian island called Hildasay. Bill reluctantly\nagrees to relocate on the island with his wife, goth daughter, son and dog.\n\nSeries 2 was produced, but has yet to air on ITV. It has aired in Canada and in\nsome European countries, but not in the UK. And ITV has said they have no plans\nto screen it. \n","torrent":{"xt":"urn:btih:f7042dfd434681ebfa8f29d3dbb286a64e85ecc3","amp;dn":"Distant+Shores","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7042dfd434681ebfa8f29d3dbb286a64e85ecc3","infoHashBuffer":{"type":"Buffer","data":[247,4,45,253,67,70,129,235,250,143,41,211,219,178,134,166,78,133,236,195]},"announce":[],"urlList":[]}}