{"title":"Deadman Wonderland  (1280x720, HD Anime) ~ Nine-T","uid":6546339,"size":3574997319,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:f9456fb5bb0b6586ba82b2d2ee479581f5276fa5&amp;dn=Deadman+Wonderland++%281280x720%2C+HD+Anime%29+%7E+Nine-T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Nine-T","files":12,"time":1310877533,"description":"DEADMAN WONDERLAND\n\n\nA massive earthquake ravaged Japan's mainland and destroyed most of Tokyo, sinking three-quarters of it into the ocean. Ten years later, the story shifts to Igarashi Ganta, a seemingly ordinary student attending Nagano Prefecture's middle school. An escapee, a survivor of the great earthquake, Ganta has no memories of the tragedy and has lived a normal life. This all changes when a strange man covered in blood and crimson armour floats through his classroom windows. Grinning madly, the Red Man massacres Ganta's entire class but instead of killing him, embeds a red crystal shard in Ganta's chest. Within days of the massacre, Ganta is declared the sole suspect and, following a quick trial, is sentenced to life imprisonment in Deadman Wonderland, a massive theme park like prison.\nArriving at the prison, Ganta is fitted with a special collar which monitors his location and life signs. Due to the heinous nature of Ganta's 'crime', he has to live out his imprisonment under Deadman Wonderland's 'Death Sentence'. A lethal poison is constantly injected into his bloodstream through the collar, but it can be neutralized by consuming a peculiar candy-like medicine every three days. Additional candy can be earned through hard work or by purchasing it. In order to gather Cast Points, the prison's currency, an inmate has to perform in the facility's lethal games and survive. Fortunately for Ganta, he is aided by a mysterious girl named Shiro, who apparently knows Ganta, and is known by other prisoners as well.\nWhile trying to survive as an inmate on death row, Ganta becomes increasingly obsessed with the 'Red Man' and tries to find him so he could clear his name. In a bizarre twist, Ganta begins to develop the ability to manipulate his own blood, to the point of turning it into a weapon. Unbeknownst to him, Ganta has become one of the prison's 'Deadmen', a segregated group of prisoners possessing the Branches of Sin which makes them capable of controlling their blood. After his ability is discovered, Ganta is forced to participate in brutal gladiatorial death matches, known as Carnival Corpse, whose anonymous spectators pay large amounts of money to watch. In his struggle he manages to befriend some of those he fought off in the arena, and with their help Ganta continues his quest to uncover the identity of the Red Man, why he turned into a Deadman and the dark secrets the prison authorities are hiding.\n\nThe source of this fansub is unknown.\n\nHave fun,\nNine-T","torrent":{"xt":"urn:btih:f9456fb5bb0b6586ba82b2d2ee479581f5276fa5","amp;dn":"Deadman+Wonderland++%281280x720%2C+HD+Anime%29+%7E+Nine-T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9456fb5bb0b6586ba82b2d2ee479581f5276fa5","infoHashBuffer":{"type":"Buffer","data":[249,69,111,181,187,11,101,134,186,130,178,210,238,71,149,129,245,39,111,165]},"announce":[],"urlList":[]}}