{"title":"VMware Workstation  With  CentOS 5.8  32-Bit","uid":7369154,"size":4205198633,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fb96d3b8521792014052f0b6bf2ff2be7a9a856e&amp;dn=VMware+Workstation++With++CentOS+5.8++32-Bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LacieHeart","files":-1,"time":1340192387,"description":"VMware, Inc. (NYSE: VMW) is a company providing virtualization software,[1][2][3] founded in 1998 and based in Palo Alto, California, USA. The company was acquired by EMC Corporation in 2004, and operates as a separate software subsidiary.\n\nVMware's desktop software runs on Microsoft Windows, Linux, and Mac OS X, while VMware's enterprise software hypervisors for servers, VMware ESX and VMware ESXi, are bare-metal embedded hypervisors that run directly on server hardware without requiring an additional underlying operating system.[4]\n\n\nWith  :\n\n\n\nCentOS is a free operating system distribution based upon the Linux kernel. It is derived entirely from the Red Hat Enterprise Linux (RHEL) distribution. CentOS exists to provide a free enterprise class computing platform and strives to maintain 100% binary compatibility with its upstream source, Red Hat.[2] CentOS stands for Community ENTerprise Operating System.\n\nIn July 2010 CentOS overtook Debian to become the most popular Linux distribution for web servers, with almost 30% of all Linux web servers using it.[3] But in January 2012, after a head-to-head race, it lost that position to Debian.[4]","torrent":{"xt":"urn:btih:fb96d3b8521792014052f0b6bf2ff2be7a9a856e","amp;dn":"VMware+Workstation++With++CentOS+5.8++32-Bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb96d3b8521792014052f0b6bf2ff2be7a9a856e","infoHashBuffer":{"type":"Buffer","data":[251,150,211,184,82,23,146,1,64,82,240,182,191,47,242,190,122,154,133,110]},"announce":[],"urlList":[]}}