{"title":"Dynamo - Magician Impossible E01","uid":6538478,"size":374741038,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fc7fd67aa03da81708df6685b7f054f1b175f250&amp;dn=Dynamo+-+Magician+Impossible+E01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Redt0rrent","files":2,"time":1310593495,"description":"EXCLUSIVE TO WATCH - starts Thursday 7th July at 9pm\n\nIn a truly jaw-dropping stunt this weekend, Dynamo stunned onlookers as he walked across the river Thames in London. That's right - the British illusionist performed the impossible and actually walked on water in front of a crowd of enthralled spectators at Westminster Bridge in the capital. And they'll be plenty more astounding feats and mind-bending tricks in Dynamo: Magician Impossible, new and exclusive to Watch, starting Thursday 7th July. \n\nTipped as the most exciting British magician to emerge in decades and with a list of celebrity fans that reads like a 'who's who' of the Hollywood elite, Dynamo: Magician Impossible is the story of an ordinary boy from Bradford living an extraordinary life. Like his dear grandfather before him, Dynamo grew up practicing precision card-handling and developing powerful magical skills. \n\nThe series sees the 28-year-old travelling the globe as the unassuming anti-hero who just happens to astound everyone he meets, whether it's an international footballer or Hollywood actor. \n\nIn episode one, Dynamo performs his spectacular matrix style levitation, physically moves a girl's tan line on the glamorous Miami Beach and performs magic with Manchester rock legend Ian Brown. \n\nOther highlights in this mind blowing series include; transporting a mobile phone into a glass beer bottle, magically transforming snow into diamonds in the Austrian mountains and bringing a flutter of butterflies to life in Hollywood's famous Chateau Marmont. \n\nThroughout the series, Dynamo: Magician Impossible will take viewers on his magical journey before stunning them with incredible, headline-grabbing stunts beyond the realms of possibility. \n\n&quot;Absolutely stunning&quot; Will Smith\n&quot;The greatest magic I've ever seen&quot; Chris Martin (Coldplay) \n","torrent":{"xt":"urn:btih:fc7fd67aa03da81708df6685b7f054f1b175f250","amp;dn":"Dynamo+-+Magician+Impossible+E01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc7fd67aa03da81708df6685b7f054f1b175f250","infoHashBuffer":{"type":"Buffer","data":[252,127,214,122,160,61,168,23,8,223,102,133,183,240,84,241,177,117,242,80]},"announce":[],"urlList":[]}}