{"title":"Golden Frog Free Game 1.2 by Ochirware &amp; Softrave - For chil","uid":7343236,"size":5391443,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fe2c956891154e9375c81721005258612df670dc&amp;dn=Golden+Frog+Free+Game+1.2+by+Ochirware+%26amp%3B+Softrave+-+For+chil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"drt2","files":1,"time":1339327210,"description":" &lt;a href=&quot;http://tikov.com/games.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://tikov.com/games.htm&lt;/a&gt;\nFree Game for kids and their parents, Office workers and time killers, arcade that will make you happy and entertain you more than Duke Nukem. \n\nGold Frog is a unique arcade game/simulator that allows players to observe the secret world of animals and insects from within and even become a part of it. The application features two original game scenarios with more than 100 levels to play, five types of insects each with its distinctive behavior, clear and beautiful graphics with realistic 3D environments, amusing and nonviolent gameplay, incredible nature sound effects, and smooth game controls.\n\nreview by CNET\n\nAlthough designed primarily for children, Gold Frog also makes a nice time killer for older players. The object of the game is simple: you control a small amphibian and must aim its long tongue to eat a variety of insects and move on to the next level. Gold Frog's quality graphics and realistic nature sounds were better than we expected, and we appreciate that the background scenery and colors vary from board to board. It does take a good deal of hand-eye coordination to accurately lash your frog's tongue at its prey, especially since the amphibian rotates very slowly no matter whether you play with the keyboard or the mouse. You can reconfigure the keyboard controls and resize the game window, but we couldn't get the latter feature to work. Really, the main thing that bothered us about this game were the egregious spelling and grammatical errors on the statistics screen, which sets a bad example for this game's target audience. Nevertheless, grade-school kids and bored office workers alike might enjoy a round of Gold Frog from time to time. ","torrent":{"xt":"urn:btih:fe2c956891154e9375c81721005258612df670dc","amp;dn":"Golden+Frog+Free+Game+1.2+by+Ochirware+%26amp%3B+Softrave+-+For+chil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe2c956891154e9375c81721005258612df670dc","infoHashBuffer":{"type":"Buffer","data":[254,44,149,104,145,21,78,147,117,200,23,33,0,82,88,97,45,246,112,220]},"announce":[],"urlList":[]}}