{"title":"FreeSWITCH 1.0.6 Ebook [6mb]","uid":6539945,"size":6825595,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fed283d41668fa1e8cfe3a2852840e1a948f703b&amp;dn=FreeSWITCH+1.0.6+Ebook+%5B6mb%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"piratesky","files":1,"time":1310654787,"description":"FreeSWITCH 1.0.6\n\nLanguage : English\nPaperback : 320 pages [ 235mm x 191mm ]\nRelease Date : July 2010\nISBN : 1847199968\nISBN 13 : 978-1-847199-96-6\n\nAuthor(s) : Anthony Minessale, Darren Schreiber, Michael S. Collins\n\nFreeSWITCH is an open source telephony platform designed to facilitate the creation of voice and chat-driven products scaling from a soft-phone to a PBX and even up to an enterprise-class soft-switch. It is always exciting to design and build your own telephony system to suit your needs, but the task is time consuming and involves a lot of technical skills.\n\nThis book comes to your rescue, helping you to set up a telephony system fast and easily using FreeSWITCH. It will take you from being a novice to creating a fully-functional telephony system of your own. It is rich with practical examples and will give you all of the information and skills needed to implement your own PBX system.\n\nThe book begins by introducing the architecture and working of FreeSWITCH before detailing how to plan a telephone system and moving on to the installation, configuration, and management of a feature-packed PBX. You will learn about maintaining a user directory, XML dial plan and advanced dial plan concepts, call routing, and the extremely powerful Event Socket. You will finally learn about the online community and history of FreeSWITCH.\n\nA step-by-step guide to building, managing, and maintaining an efficient FreeSWITCH telephony system\n\n\nWhat you will learn from this book :\n\n    Set up a basic system to make and receive phone calls, make calls between extensions, and utilize basic PBX functionality\n    Avoid common implementation mistakes and deploy various features of this telephony system with best practices and expert tips\n    Perform routine maintenance for smooth running and troubleshoot the system when things are not going right\n    Apply regular expressions to unlock unique and powerful call routing scenarios\n    Call your own application(s) when particular events occur and control FreeSWITCH using the powerful Event Socket\n    Set up multi-party conferencing facilities for your system\n    Interact with callers, gather information, and route calls to the appropriate recipient using the automated, built-in XML IVR (Interactive Voice Response) engine\n    Create a flexible dialplan, and allow third-party tools to be quickly and easily created using dialplan parsers other than the default XML Dialplan\n    Park multiple calls in a FIFO queue and unpark them in the order in which they were received, using the mod_fifo module\n    Record an entire phone call or session using the call recording feature\n    Create advanced call control applications with the Lua scripting language\n    Take a peek into the vibrant online community and history of FreeSWITCH\n\n\n\nTable of Contents\n\nPreface\nChapter 1: Architecture of FreeSWITCH\nChapter 2: Building and Installation\nChapter 3: Test Driving the Default Configuration\nChapter 4: SIP and the User Directory\nChapter 5: Understanding the XML Dialplan\nChapter 6: Using the Built-in XML IVR Engine\nChapter 7: Building IVR Applications with Lua\nChapter 8: Advanced Dialplan Concepts\nChapter 9: Controlling FreeSWITCH Externally\nChapter 10: Advanced Features and Further Reading\nAppendix A: The FreeSWITCH Online Community\nAppendix B: The History of FreeSWITCH\nIndex \n\n\n\nApproach\n\nThis book is a step-by-step tutorial with clear instructions and screenshots to guide you through the creation of a complete, cost-effective telephony system. You will start with installation, walk through the different features, and see how to manage and maintain the system.\n\nWho this book is written for\n\nIf you are an IT professional or enthusiast who is interested in quickly getting a powerful telephony system up and running using the free and open source application FreeSWITCH, this book is for you. Telephony experience will be helpful, but is not required.\n\n\nSOURCE : http://www.packtpub.com/freeswitch-1-0-6-build-robust-high-performance-telephony-systems/book\n\n\nPIRATESKY","torrent":{"xt":"urn:btih:fed283d41668fa1e8cfe3a2852840e1a948f703b","amp;dn":"FreeSWITCH+1.0.6+Ebook+%5B6mb%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fed283d41668fa1e8cfe3a2852840e1a948f703b","infoHashBuffer":{"type":"Buffer","data":[254,210,131,212,22,104,250,30,140,254,58,40,82,132,14,26,148,143,112,59]},"announce":[],"urlList":[]}}